/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

pub const IOPOL_MATERIALIZE_DATALESS_FILES_OFF: u32 = 1;
pub const IOPOL_MATERIALIZE_DATALESS_FILES_ON: u32 = 2;
pub const IOPOL_VFS_STATFS_NO_DATA_VOLUME_DEFAULT: u32 = 0;
pub const IOPOL_VFS_STATFS_FORCE_NO_DATA_VOLUME: u32 = 1;
pub const IOPOL_VFS_TRIGGER_RESOLVE_DEFAULT: u32 = 0;
pub const IOPOL_VFS_TRIGGER_RESOLVE_OFF: u32 = 1;
pub const IOPOL_VFS_CONTENT_PROTECTION_DEFAULT: u32 = 0;
pub const IOPOL_VFS_CONTENT_PROTECTION_IGNORE: u32 = 1;
pub const IOPOL_VFS_IGNORE_PERMISSIONS_OFF: u32 = 0;
pub const IOPOL_VFS_IGNORE_PERMISSIONS_ON: u32 = 1;
pub const IOPOL_VFS_SKIP_MTIME_UPDATE_OFF: u32 = 0;
pub const IOPOL_VFS_SKIP_MTIME_UPDATE_ON: u32 = 1;
pub const IOPOL_VFS_ALLOW_LOW_SPACE_WRITES_OFF: u32 = 0;
pub const IOPOL_VFS_ALLOW_LOW_SPACE_WRITES_ON: u32 = 1;
pub const IOPOL_VFS_DISALLOW_RW_FOR_O_EVTONLY_DEFAULT: u32 = 0;
pub const IOPOL_VFS_DISALLOW_RW_FOR_O_EVTONLY_ON: u32 = 1;
pub const IOPOL_VFS_NOCACHE_WRITE_FS_BLKSIZE_DEFAULT: u32 = 0;
pub const IOPOL_VFS_NOCACHE_WRITE_FS_BLKSIZE_ON: u32 = 1;
pub const WNOHANG: u32 = 1;
pub const WUNTRACED: u32 = 2;
pub const WCOREFLAG: u32 = 128;
pub const _WSTOPPED: u32 = 127;
pub const WEXITED: u32 = 4;
pub const WSTOPPED: u32 = 8;
pub const WCONTINUED: u32 = 16;
pub const WNOWAIT: u32 = 32;
pub const WAIT_ANY: i32 = -1;
pub const WAIT_MYPGRP: u32 = 0;
pub const _QUAD_HIGHWORD: u32 = 1;
pub const _QUAD_LOWWORD: u32 = 0;
pub const __DARWIN_LITTLE_ENDIAN: u32 = 1234;
pub const __DARWIN_BIG_ENDIAN: u32 = 4321;
pub const __DARWIN_PDP_ENDIAN: u32 = 3412;
pub const LITTLE_ENDIAN: u32 = 1234;
pub const BIG_ENDIAN: u32 = 4321;
pub const PDP_ENDIAN: u32 = 3412;
pub const __DARWIN_BYTE_ORDER: u32 = 1234;
pub const BYTE_ORDER: u32 = 1234;
pub const EXIT_FAILURE: u32 = 1;
pub const EXIT_SUCCESS: u32 = 0;
pub const RAND_MAX: u32 = 2147483647;
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type __int8_t = ::core::ffi::c_schar;
pub type __uint8_t = ::core::ffi::c_uchar;
pub type __int16_t = ::core::ffi::c_short;
pub type __uint16_t = ::core::ffi::c_ushort;
pub type __int32_t = ::core::ffi::c_int;
pub type __uint32_t = ::core::ffi::c_uint;
pub type __int64_t = ::core::ffi::c_longlong;
pub type __uint64_t = ::core::ffi::c_ulonglong;
pub type __darwin_intptr_t = ::core::ffi::c_long;
pub type __darwin_natural_t = ::core::ffi::c_uint;
pub type __darwin_ct_rune_t = ::core::ffi::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::core::ffi::c_char; 128usize],
    pub _mbstateL: ::core::ffi::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::core::mem::size_of::<__mbstate_t>() - 128usize];
    ["Alignment of __mbstate_t"][::core::mem::align_of::<__mbstate_t>() - 8usize];
    ["Offset of field: __mbstate_t::__mbstate8"]
        [::core::mem::offset_of!(__mbstate_t, __mbstate8) - 0usize];
    ["Offset of field: __mbstate_t::_mbstateL"]
        [::core::mem::offset_of!(__mbstate_t, _mbstateL) - 0usize];
};
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::core::ffi::c_long;
pub type __darwin_size_t = ::core::ffi::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::core::ffi::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::core::ffi::c_int;
pub type __darwin_clock_t = ::core::ffi::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::core::ffi::c_long;
pub type __darwin_time_t = ::core::ffi::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::core::ffi::c_uint;
pub type __darwin_fsfilcnt_t = ::core::ffi::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::core::ffi::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::core::ffi::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    pub __arg: *mut ::core::ffi::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_pthread_handler_rec"]
        [::core::mem::size_of::<__darwin_pthread_handler_rec>() - 24usize];
    ["Alignment of __darwin_pthread_handler_rec"]
        [::core::mem::align_of::<__darwin_pthread_handler_rec>() - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__routine"]
        [::core::mem::offset_of!(__darwin_pthread_handler_rec, __routine) - 0usize];
    ["Offset of field: __darwin_pthread_handler_rec::__arg"]
        [::core::mem::offset_of!(__darwin_pthread_handler_rec, __arg) - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__next"]
        [::core::mem::offset_of!(__darwin_pthread_handler_rec, __next) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_attr_t"][::core::mem::size_of::<_opaque_pthread_attr_t>() - 64usize];
    ["Alignment of _opaque_pthread_attr_t"]
        [::core::mem::align_of::<_opaque_pthread_attr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_attr_t::__sig"]
        [::core::mem::offset_of!(_opaque_pthread_attr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_attr_t::__opaque"]
        [::core::mem::offset_of!(_opaque_pthread_attr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 40usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_cond_t"][::core::mem::size_of::<_opaque_pthread_cond_t>() - 48usize];
    ["Alignment of _opaque_pthread_cond_t"]
        [::core::mem::align_of::<_opaque_pthread_cond_t>() - 8usize];
    ["Offset of field: _opaque_pthread_cond_t::__sig"]
        [::core::mem::offset_of!(_opaque_pthread_cond_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_cond_t::__opaque"]
        [::core::mem::offset_of!(_opaque_pthread_cond_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_condattr_t"]
        [::core::mem::size_of::<_opaque_pthread_condattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_condattr_t"]
        [::core::mem::align_of::<_opaque_pthread_condattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_condattr_t::__sig"]
        [::core::mem::offset_of!(_opaque_pthread_condattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_condattr_t::__opaque"]
        [::core::mem::offset_of!(_opaque_pthread_condattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutex_t"]
        [::core::mem::size_of::<_opaque_pthread_mutex_t>() - 64usize];
    ["Alignment of _opaque_pthread_mutex_t"]
        [::core::mem::align_of::<_opaque_pthread_mutex_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutex_t::__sig"]
        [::core::mem::offset_of!(_opaque_pthread_mutex_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutex_t::__opaque"]
        [::core::mem::offset_of!(_opaque_pthread_mutex_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutexattr_t"]
        [::core::mem::size_of::<_opaque_pthread_mutexattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_mutexattr_t"]
        [::core::mem::align_of::<_opaque_pthread_mutexattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__sig"]
        [::core::mem::offset_of!(_opaque_pthread_mutexattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__opaque"]
        [::core::mem::offset_of!(_opaque_pthread_mutexattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_once_t"][::core::mem::size_of::<_opaque_pthread_once_t>() - 16usize];
    ["Alignment of _opaque_pthread_once_t"]
        [::core::mem::align_of::<_opaque_pthread_once_t>() - 8usize];
    ["Offset of field: _opaque_pthread_once_t::__sig"]
        [::core::mem::offset_of!(_opaque_pthread_once_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_once_t::__opaque"]
        [::core::mem::offset_of!(_opaque_pthread_once_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 192usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlock_t"]
        [::core::mem::size_of::<_opaque_pthread_rwlock_t>() - 200usize];
    ["Alignment of _opaque_pthread_rwlock_t"]
        [::core::mem::align_of::<_opaque_pthread_rwlock_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__sig"]
        [::core::mem::offset_of!(_opaque_pthread_rwlock_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__opaque"]
        [::core::mem::offset_of!(_opaque_pthread_rwlock_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlockattr_t"]
        [::core::mem::size_of::<_opaque_pthread_rwlockattr_t>() - 24usize];
    ["Alignment of _opaque_pthread_rwlockattr_t"]
        [::core::mem::align_of::<_opaque_pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__sig"]
        [::core::mem::offset_of!(_opaque_pthread_rwlockattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__opaque"]
        [::core::mem::offset_of!(_opaque_pthread_rwlockattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::core::ffi::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::core::ffi::c_char; 8176usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_t"][::core::mem::size_of::<_opaque_pthread_t>() - 8192usize];
    ["Alignment of _opaque_pthread_t"][::core::mem::align_of::<_opaque_pthread_t>() - 8usize];
    ["Offset of field: _opaque_pthread_t::__sig"]
        [::core::mem::offset_of!(_opaque_pthread_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_t::__cleanup_stack"]
        [::core::mem::offset_of!(_opaque_pthread_t, __cleanup_stack) - 8usize];
    ["Offset of field: _opaque_pthread_t::__opaque"]
        [::core::mem::offset_of!(_opaque_pthread_t, __opaque) - 16usize];
};
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::core::ffi::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type intmax_t = ::core::ffi::c_long;
pub type uintmax_t = ::core::ffi::c_ulong;
pub type rsize_t = ::core::ffi::c_ulong;
pub type wchar_t = ::core::ffi::c_int;
pub type max_align_t = f64;
unsafe extern "C" {
    pub fn __assert_rtn(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
        arg4: *const ::core::ffi::c_char,
    ) -> !;
}
pub type __darwin_nl_item = ::core::ffi::c_int;
pub type __darwin_wctrans_t = ::core::ffi::c_int;
pub type __darwin_wctype_t = __uint32_t;
unsafe extern "C" {
    pub fn memchr(
        __s: *const ::core::ffi::c_void,
        __c: ::core::ffi::c_int,
        __n: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn memcmp(
        __s1: *const ::core::ffi::c_void,
        __s2: *const ::core::ffi::c_void,
        __n: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn memcpy(
        __dst: *mut ::core::ffi::c_void,
        __src: *const ::core::ffi::c_void,
        __n: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn memmove(
        __dst: *mut ::core::ffi::c_void,
        __src: *const ::core::ffi::c_void,
        __len: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn memset(
        __b: *mut ::core::ffi::c_void,
        __c: ::core::ffi::c_int,
        __len: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn strcat(
        __s1: *mut ::core::ffi::c_char,
        __s2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strchr(
        __s: *const ::core::ffi::c_char,
        __c: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strcmp(
        __s1: *const ::core::ffi::c_char,
        __s2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strcoll(
        __s1: *const ::core::ffi::c_char,
        __s2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strcpy(
        __dst: *mut ::core::ffi::c_char,
        __src: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strcspn(
        __s: *const ::core::ffi::c_char,
        __charset: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn strerror(__errnum: ::core::ffi::c_int) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strlen(__s: *const ::core::ffi::c_char) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn strncat(
        __s1: *mut ::core::ffi::c_char,
        __s2: *const ::core::ffi::c_char,
        __n: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strncmp(
        __s1: *const ::core::ffi::c_char,
        __s2: *const ::core::ffi::c_char,
        __n: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strncpy(
        __dst: *mut ::core::ffi::c_char,
        __src: *const ::core::ffi::c_char,
        __n: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strpbrk(
        __s: *const ::core::ffi::c_char,
        __charset: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strrchr(
        __s: *const ::core::ffi::c_char,
        __c: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strspn(
        __s: *const ::core::ffi::c_char,
        __charset: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn strstr(
        __big: *const ::core::ffi::c_char,
        __little: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strtok(
        __str: *mut ::core::ffi::c_char,
        __sep: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strxfrm(
        __s1: *mut ::core::ffi::c_char,
        __s2: *const ::core::ffi::c_char,
        __n: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn strtok_r(
        __str: *mut ::core::ffi::c_char,
        __sep: *const ::core::ffi::c_char,
        __lasts: *mut *mut ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strerror_r(
        __errnum: ::core::ffi::c_int,
        __strerrbuf: *mut ::core::ffi::c_char,
        __buflen: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strdup(__s1: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn memccpy(
        __dst: *mut ::core::ffi::c_void,
        __src: *const ::core::ffi::c_void,
        __c: ::core::ffi::c_int,
        __n: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn stpcpy(
        __dst: *mut ::core::ffi::c_char,
        __src: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn stpncpy(
        __dst: *mut ::core::ffi::c_char,
        __src: *const ::core::ffi::c_char,
        __n: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strndup(
        __s1: *const ::core::ffi::c_char,
        __n: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strnlen(__s1: *const ::core::ffi::c_char, __n: usize) -> usize;
}
unsafe extern "C" {
    pub fn strsignal(__sig: ::core::ffi::c_int) -> *mut ::core::ffi::c_char;
}
pub type errno_t = ::core::ffi::c_int;
unsafe extern "C" {
    pub fn memset_s(
        __s: *mut ::core::ffi::c_void,
        __smax: rsize_t,
        __c: ::core::ffi::c_int,
        __n: rsize_t,
    ) -> errno_t;
}
pub type u_int8_t = ::core::ffi::c_uchar;
pub type u_int16_t = ::core::ffi::c_ushort;
pub type u_int32_t = ::core::ffi::c_uint;
pub type u_int64_t = ::core::ffi::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
unsafe extern "C" {
    pub fn memmem(
        __big: *const ::core::ffi::c_void,
        __big_len: usize,
        __little: *const ::core::ffi::c_void,
        __little_len: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn memset_pattern4(
        __b: *mut ::core::ffi::c_void,
        __pattern4: *const ::core::ffi::c_void,
        __len: usize,
    );
}
unsafe extern "C" {
    pub fn memset_pattern8(
        __b: *mut ::core::ffi::c_void,
        __pattern8: *const ::core::ffi::c_void,
        __len: usize,
    );
}
unsafe extern "C" {
    pub fn memset_pattern16(
        __b: *mut ::core::ffi::c_void,
        __pattern16: *const ::core::ffi::c_void,
        __len: usize,
    );
}
unsafe extern "C" {
    pub fn strcasestr(
        __big: *const ::core::ffi::c_char,
        __little: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strnstr(
        __big: *const ::core::ffi::c_char,
        __little: *const ::core::ffi::c_char,
        __len: usize,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strlcat(
        __dst: *mut ::core::ffi::c_char,
        __source: *const ::core::ffi::c_char,
        __size: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn strlcpy(
        __dst: *mut ::core::ffi::c_char,
        __source: *const ::core::ffi::c_char,
        __size: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn strmode(__mode: ::core::ffi::c_int, __bp: *mut ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::core::ffi::c_char,
        __delim: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn swab(arg1: *const ::core::ffi::c_void, arg2: *mut ::core::ffi::c_void, arg3: isize);
}
unsafe extern "C" {
    pub fn timingsafe_bcmp(
        __b1: *const ::core::ffi::c_void,
        __b2: *const ::core::ffi::c_void,
        __len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strsignal_r(
        __sig: ::core::ffi::c_int,
        __strsignalbuf: *mut ::core::ffi::c_char,
        __buflen: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn bcmp(
        arg1: *const ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn bcopy(arg1: *const ::core::ffi::c_void, arg2: *mut ::core::ffi::c_void, arg3: usize);
}
unsafe extern "C" {
    pub fn bzero(arg1: *mut ::core::ffi::c_void, arg2: ::core::ffi::c_ulong);
}
unsafe extern "C" {
    pub fn index(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn rindex(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn ffs(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_ulong,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ffsl(arg1: ::core::ffi::c_long) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ffsll(arg1: ::core::ffi::c_longlong) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fls(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn flsl(arg1: ::core::ffi::c_long) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn flsll(arg1: ::core::ffi::c_longlong) -> ::core::ffi::c_int;
}
pub type z_result_t = i8;
pub const _z_res_t__Z_RES_OK: _z_res_t = 0;
pub const _z_res_t_Z_OK: _z_res_t = 0;
pub const _z_res_t__Z_RES_CHANNEL_CLOSED: _z_res_t = 1;
pub const _z_res_t_Z_CHANNEL_DISCONNECTED: _z_res_t = 1;
pub const _z_res_t__Z_RES_CHANNEL_NODATA: _z_res_t = 2;
pub const _z_res_t_Z_CHANNEL_NODATA: _z_res_t = 2;
pub const _z_res_t__Z_NO_DATA_PROCESSED: _z_res_t = 3;
pub const _z_res_t_Z_NO_DATA_PROCESSED: _z_res_t = 3;
pub const _z_res_t__Z_ERR_MESSAGE_DESERIALIZATION_FAILED: _z_res_t = -119;
pub const _z_res_t__Z_ERR_MESSAGE_SERIALIZATION_FAILED: _z_res_t = -118;
pub const _z_res_t__Z_ERR_MESSAGE_UNEXPECTED: _z_res_t = -117;
pub const _z_res_t__Z_ERR_MESSAGE_FLAG_UNEXPECTED: _z_res_t = -116;
pub const _z_res_t__Z_ERR_MESSAGE_ZENOH_DECLARATION_UNKNOWN: _z_res_t = -115;
pub const _z_res_t__Z_ERR_MESSAGE_ZENOH_UNKNOWN: _z_res_t = -114;
pub const _z_res_t__Z_ERR_MESSAGE_TRANSPORT_UNKNOWN: _z_res_t = -113;
pub const _z_res_t__Z_ERR_MESSAGE_EXTENSION_MANDATORY_AND_UNKNOWN: _z_res_t = -112;
pub const _z_res_t__Z_ERR_ENTITY_DECLARATION_FAILED: _z_res_t = -111;
pub const _z_res_t__Z_ERR_ENTITY_UNKNOWN: _z_res_t = -110;
pub const _z_res_t__Z_ERR_KEYEXPR_UNKNOWN: _z_res_t = -109;
pub const _z_res_t__Z_ERR_KEYEXPR_NOT_MATCH: _z_res_t = -108;
pub const _z_res_t__Z_ERR_QUERY_NOT_MATCH: _z_res_t = -107;
pub const _z_res_t__Z_ERR_TRANSPORT_NOT_AVAILABLE: _z_res_t = -103;
pub const _z_res_t__Z_ERR_TRANSPORT_OPEN_FAILED: _z_res_t = -102;
pub const _z_res_t__Z_ERR_TRANSPORT_OPEN_SN_RESOLUTION: _z_res_t = -101;
pub const _z_res_t__Z_ERR_TRANSPORT_TX_FAILED: _z_res_t = -100;
pub const _z_res_t__Z_ERR_TRANSPORT_RX_FAILED: _z_res_t = -99;
pub const _z_res_t__Z_ERR_TRANSPORT_NO_SPACE: _z_res_t = -98;
pub const _z_res_t__Z_ERR_TRANSPORT_NOT_ENOUGH_BYTES: _z_res_t = -97;
pub const _z_res_t__Z_ERR_CONFIG_FAILED_INSERT: _z_res_t = -95;
pub const _z_res_t__Z_ERR_CONFIG_UNSUPPORTED_CLIENT_MULTICAST: _z_res_t = -94;
pub const _z_res_t__Z_ERR_CONFIG_UNSUPPORTED_PEER_UNICAST: _z_res_t = -93;
pub const _z_res_t__Z_ERR_CONFIG_LOCATOR_SCHEMA_UNKNOWN: _z_res_t = -92;
pub const _z_res_t__Z_ERR_CONFIG_LOCATOR_INVALID: _z_res_t = -91;
pub const _z_res_t__Z_ERR_CONFIG_INVALID_MODE: _z_res_t = -90;
pub const _z_res_t__Z_ERR_SCOUT_NO_RESULTS: _z_res_t = -87;
pub const _z_res_t__Z_ERR_SYSTEM_GENERIC: _z_res_t = -80;
pub const _z_res_t__Z_ERR_SYSTEM_TASK_FAILED: _z_res_t = -79;
pub const _z_res_t__Z_ERR_SYSTEM_OUT_OF_MEMORY: _z_res_t = -78;
pub const _z_res_t__Z_ERR_CONNECTION_CLOSED: _z_res_t = -77;
pub const _z_res_t__Z_ERR_DID_NOT_READ: _z_res_t = -76;
pub const _z_res_t__Z_ERR_INVALID: _z_res_t = -75;
pub const _z_res_t_Z_EINVAL: _z_res_t = -75;
pub const _z_res_t__Z_ERR_OVERFLOW: _z_res_t = -74;
pub const _z_res_t__Z_ERR_SESSION_CLOSED: _z_res_t = -73;
pub const _z_res_t_Z_EDESERIALIZE: _z_res_t = -72;
pub const _z_res_t_Z_ETIMEDOUT: _z_res_t = -71;
pub const _z_res_t__Z_ERR_GENERIC: _z_res_t = -128;
pub type _z_res_t = ::core::ffi::c_int;
unsafe extern "C" {
    pub fn _z_rc_init(cnt: *mut *mut ::core::ffi::c_void) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_rc_increase_strong(cnt: *mut ::core::ffi::c_void) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_rc_increase_weak(cnt: *mut ::core::ffi::c_void) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_rc_decrease_strong(cnt: *mut *mut ::core::ffi::c_void) -> bool;
}
unsafe extern "C" {
    pub fn _z_rc_decrease_weak(cnt: *mut *mut ::core::ffi::c_void) -> bool;
}
unsafe extern "C" {
    pub fn _z_rc_weak_upgrade(cnt: *mut ::core::ffi::c_void) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_rc_weak_count(cnt: *mut ::core::ffi::c_void) -> usize;
}
unsafe extern "C" {
    pub fn _z_rc_strong_count(cnt: *mut ::core::ffi::c_void) -> usize;
}
unsafe extern "C" {
    pub fn _z_simple_rc_value(rc: *mut ::core::ffi::c_void) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn _z_simple_rc_init(
        rc: *mut *mut ::core::ffi::c_void,
        val: *const ::core::ffi::c_void,
        val_size: usize,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_simple_rc_increase(rc: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn _z_simple_rc_decrease(rc: *mut ::core::ffi::c_void) -> bool;
}
unsafe extern "C" {
    pub fn _z_simple_rc_strong_count(rc: *mut ::core::ffi::c_void) -> usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_delete_context_t {
    pub deleter: ::core::option::Option<
        unsafe extern "C" fn(data: *mut ::core::ffi::c_void, context: *mut ::core::ffi::c_void),
    >,
    pub context: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_delete_context_t"][::core::mem::size_of::<_z_delete_context_t>() - 16usize];
    ["Alignment of _z_delete_context_t"][::core::mem::align_of::<_z_delete_context_t>() - 8usize];
    ["Offset of field: _z_delete_context_t::deleter"]
        [::core::mem::offset_of!(_z_delete_context_t, deleter) - 0usize];
    ["Offset of field: _z_delete_context_t::context"]
        [::core::mem::offset_of!(_z_delete_context_t, context) - 8usize];
};
unsafe extern "C" {
    pub fn _z_delete_context_default() -> _z_delete_context_t;
}
unsafe extern "C" {
    pub fn _z_delete_context_static() -> _z_delete_context_t;
}
#[doc = " An array of bytes.\n\n Members:\n   size_t len: The length of the bytes array.\n   uint8_t *start: A pointer to the bytes array.\n   _z_delete_context_t delete_context - context used to delete the data."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_slice_t {
    pub len: usize,
    pub start: *const u8,
    pub _delete_context: _z_delete_context_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_slice_t"][::core::mem::size_of::<_z_slice_t>() - 32usize];
    ["Alignment of _z_slice_t"][::core::mem::align_of::<_z_slice_t>() - 8usize];
    ["Offset of field: _z_slice_t::len"][::core::mem::offset_of!(_z_slice_t, len) - 0usize];
    ["Offset of field: _z_slice_t::start"][::core::mem::offset_of!(_z_slice_t, start) - 8usize];
    ["Offset of field: _z_slice_t::_delete_context"]
        [::core::mem::offset_of!(_z_slice_t, _delete_context) - 16usize];
};
unsafe extern "C" {
    pub fn _z_slice_init(bs: *mut _z_slice_t, capacity: usize) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_slice_make(capacity: usize) -> _z_slice_t;
}
unsafe extern "C" {
    pub fn _z_slice_copy_from_buf(bs: *const u8, len: usize) -> _z_slice_t;
}
unsafe extern "C" {
    pub fn _z_slice_steal(b: *mut _z_slice_t) -> _z_slice_t;
}
unsafe extern "C" {
    pub fn _z_slice_copy(dst: *mut _z_slice_t, src: *const _z_slice_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_slice_n_copy(
        dst: *mut _z_slice_t,
        src: *const _z_slice_t,
        offset: usize,
        len: usize,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_slice_duplicate(src: *const _z_slice_t) -> _z_slice_t;
}
unsafe extern "C" {
    pub fn _z_slice_move(dst: *mut _z_slice_t, src: *mut _z_slice_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_slice_eq(left: *const _z_slice_t, right: *const _z_slice_t) -> bool;
}
unsafe extern "C" {
    pub fn _z_slice_free(bs: *mut *mut _z_slice_t);
}
unsafe extern "C" {
    pub fn _z_slice_is_alloced(s: *const _z_slice_t) -> bool;
}
pub type va_list = __darwin_va_list;
unsafe extern "C" {
    pub fn renameat(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
        arg4: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn renamex_np(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn renameatx_np(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
        arg4: *const ::core::ffi::c_char,
        arg5: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn printf(arg1: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
pub type fpos_t = __darwin_off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::core::ffi::c_uchar,
    pub _size: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sbuf"][::core::mem::size_of::<__sbuf>() - 16usize];
    ["Alignment of __sbuf"][::core::mem::align_of::<__sbuf>() - 8usize];
    ["Offset of field: __sbuf::_base"][::core::mem::offset_of!(__sbuf, _base) - 0usize];
    ["Offset of field: __sbuf::_size"][::core::mem::offset_of!(__sbuf, _size) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILEX {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::core::ffi::c_uchar,
    pub _r: ::core::ffi::c_int,
    pub _w: ::core::ffi::c_int,
    pub _flags: ::core::ffi::c_short,
    pub _file: ::core::ffi::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::core::ffi::c_int,
    pub _cookie: *mut ::core::ffi::c_void,
    pub _close: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
    >,
    pub _read: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::core::ffi::c_void,
            arg2: *mut ::core::ffi::c_char,
            arg3: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub _seek: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::core::ffi::c_void,
            arg2: fpos_t,
            arg3: ::core::ffi::c_int,
        ) -> fpos_t,
    >,
    pub _write: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::core::ffi::c_void,
            arg2: *const ::core::ffi::c_char,
            arg3: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub _ub: __sbuf,
    pub _extra: *mut __sFILEX,
    pub _ur: ::core::ffi::c_int,
    pub _ubuf: [::core::ffi::c_uchar; 3usize],
    pub _nbuf: [::core::ffi::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::core::ffi::c_int,
    pub _offset: fpos_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sFILE"][::core::mem::size_of::<__sFILE>() - 152usize];
    ["Alignment of __sFILE"][::core::mem::align_of::<__sFILE>() - 8usize];
    ["Offset of field: __sFILE::_p"][::core::mem::offset_of!(__sFILE, _p) - 0usize];
    ["Offset of field: __sFILE::_r"][::core::mem::offset_of!(__sFILE, _r) - 8usize];
    ["Offset of field: __sFILE::_w"][::core::mem::offset_of!(__sFILE, _w) - 12usize];
    ["Offset of field: __sFILE::_flags"][::core::mem::offset_of!(__sFILE, _flags) - 16usize];
    ["Offset of field: __sFILE::_file"][::core::mem::offset_of!(__sFILE, _file) - 18usize];
    ["Offset of field: __sFILE::_bf"][::core::mem::offset_of!(__sFILE, _bf) - 24usize];
    ["Offset of field: __sFILE::_lbfsize"][::core::mem::offset_of!(__sFILE, _lbfsize) - 40usize];
    ["Offset of field: __sFILE::_cookie"][::core::mem::offset_of!(__sFILE, _cookie) - 48usize];
    ["Offset of field: __sFILE::_close"][::core::mem::offset_of!(__sFILE, _close) - 56usize];
    ["Offset of field: __sFILE::_read"][::core::mem::offset_of!(__sFILE, _read) - 64usize];
    ["Offset of field: __sFILE::_seek"][::core::mem::offset_of!(__sFILE, _seek) - 72usize];
    ["Offset of field: __sFILE::_write"][::core::mem::offset_of!(__sFILE, _write) - 80usize];
    ["Offset of field: __sFILE::_ub"][::core::mem::offset_of!(__sFILE, _ub) - 88usize];
    ["Offset of field: __sFILE::_extra"][::core::mem::offset_of!(__sFILE, _extra) - 104usize];
    ["Offset of field: __sFILE::_ur"][::core::mem::offset_of!(__sFILE, _ur) - 112usize];
    ["Offset of field: __sFILE::_ubuf"][::core::mem::offset_of!(__sFILE, _ubuf) - 116usize];
    ["Offset of field: __sFILE::_nbuf"][::core::mem::offset_of!(__sFILE, _nbuf) - 119usize];
    ["Offset of field: __sFILE::_lb"][::core::mem::offset_of!(__sFILE, _lb) - 120usize];
    ["Offset of field: __sFILE::_blksize"][::core::mem::offset_of!(__sFILE, _blksize) - 136usize];
    ["Offset of field: __sFILE::_offset"][::core::mem::offset_of!(__sFILE, _offset) - 144usize];
};
pub type FILE = __sFILE;
unsafe extern "C" {
    pub static mut __stdinp: *mut FILE;
}
unsafe extern "C" {
    pub static mut __stdoutp: *mut FILE;
}
unsafe extern "C" {
    pub static mut __stderrp: *mut FILE;
}
unsafe extern "C" {
    pub fn clearerr(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn fclose(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn feof(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ferror(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fflush(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fgetc(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fgets(
        arg1: *mut ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
        arg3: *mut FILE,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn fopen(
        __filename: *const ::core::ffi::c_char,
        __mode: *const ::core::ffi::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fprintf(arg1: *mut FILE, arg2: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fputc(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fputs(arg1: *const ::core::ffi::c_char, arg2: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fread(
        __ptr: *mut ::core::ffi::c_void,
        __size: ::core::ffi::c_ulong,
        __nitems: ::core::ffi::c_ulong,
        __stream: *mut FILE,
    ) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn freopen(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fscanf(arg1: *mut FILE, arg2: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fseek(
        arg1: *mut FILE,
        arg2: ::core::ffi::c_long,
        arg3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ftell(arg1: *mut FILE) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn fwrite(
        __ptr: *const ::core::ffi::c_void,
        __size: ::core::ffi::c_ulong,
        __nitems: ::core::ffi::c_ulong,
        __stream: *mut FILE,
    ) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn getc(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn gets(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn perror(arg1: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn putc(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn putchar(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn puts(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn remove(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn rename(
        __old: *const ::core::ffi::c_char,
        __new: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn rewind(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn scanf(arg1: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setbuf(arg1: *mut FILE, arg2: *mut ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn setvbuf(
        arg1: *mut FILE,
        arg2: *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
        arg4: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sscanf(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn tmpnam(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn ungetc(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vfprintf(
        arg1: *mut FILE,
        arg2: *const ::core::ffi::c_char,
        arg3: __builtin_va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vprintf(arg1: *const ::core::ffi::c_char, arg2: __builtin_va_list)
    -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vsprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: __builtin_va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ctermid(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn fdopen(arg1: ::core::ffi::c_int, arg2: *const ::core::ffi::c_char) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fileno(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pclose(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn popen(arg1: *const ::core::ffi::c_char, arg2: *const ::core::ffi::c_char) -> *mut FILE;
}
unsafe extern "C" {
    pub fn __srget(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __svfscanf(
        arg1: *mut FILE,
        arg2: *const ::core::ffi::c_char,
        arg3: va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __swbuf(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn flockfile(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn ftrylockfile(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn funlockfile(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn getc_unlocked(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getchar_unlocked() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn putc_unlocked(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn putchar_unlocked(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getw(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn putw(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn tempnam(
        __dir: *const ::core::ffi::c_char,
        __prefix: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
pub type off_t = __darwin_off_t;
unsafe extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __offset: off_t,
        __whence: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ftello(__stream: *mut FILE) -> off_t;
}
unsafe extern "C" {
    pub fn snprintf(
        __str: *mut ::core::ffi::c_char,
        __size: ::core::ffi::c_ulong,
        __format: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vfscanf(
        __stream: *mut FILE,
        __format: *const ::core::ffi::c_char,
        arg1: __builtin_va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vscanf(
        __format: *const ::core::ffi::c_char,
        arg1: __builtin_va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vsnprintf(
        __str: *mut ::core::ffi::c_char,
        __size: ::core::ffi::c_ulong,
        __format: *const ::core::ffi::c_char,
        arg1: __builtin_va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vsscanf(
        __str: *const ::core::ffi::c_char,
        __format: *const ::core::ffi::c_char,
        arg1: __builtin_va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn dprintf(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vdprintf(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        arg3: va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getdelim(
        __linep: *mut *mut ::core::ffi::c_char,
        __linecapp: *mut usize,
        __delimiter: ::core::ffi::c_int,
        __stream: *mut FILE,
    ) -> isize;
}
unsafe extern "C" {
    pub fn getline(
        __linep: *mut *mut ::core::ffi::c_char,
        __linecapp: *mut usize,
        __stream: *mut FILE,
    ) -> isize;
}
unsafe extern "C" {
    pub fn fmemopen(
        __buf: *mut ::core::ffi::c_void,
        __size: usize,
        __mode: *const ::core::ffi::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn open_memstream(__bufp: *mut *mut ::core::ffi::c_char, __sizep: *mut usize) -> *mut FILE;
}
unsafe extern "C" {
    pub static sys_nerr: ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static sys_errlist: [*const ::core::ffi::c_char; 0usize];
}
unsafe extern "C" {
    pub fn asprintf(
        arg1: *mut *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ctermid_r(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn fgetln(arg1: *mut FILE, arg2: *mut usize) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn fmtcheck(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn fpurge(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setbuffer(arg1: *mut FILE, arg2: *mut ::core::ffi::c_char, arg3: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn setlinebuf(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vasprintf(
        arg1: *mut *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn funopen(
        arg1: *const ::core::ffi::c_void,
        arg2: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: *mut ::core::ffi::c_char,
                arg3: ::core::ffi::c_int,
            ) -> ::core::ffi::c_int,
        >,
        arg3: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: *const ::core::ffi::c_char,
                arg3: ::core::ffi::c_int,
            ) -> ::core::ffi::c_int,
        >,
        arg4: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: fpos_t,
                arg3: ::core::ffi::c_int,
            ) -> fpos_t,
        >,
        arg5: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
        >,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn __sprintf_chk(
        arg1: *mut ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
        arg3: usize,
        arg4: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __snprintf_chk(
        arg1: *mut ::core::ffi::c_char,
        arg2: usize,
        arg3: ::core::ffi::c_int,
        arg4: usize,
        arg5: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __vsprintf_chk(
        arg1: *mut ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
        arg3: usize,
        arg4: *const ::core::ffi::c_char,
        arg5: va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __vsnprintf_chk(
        arg1: *mut ::core::ffi::c_char,
        arg2: usize,
        arg3: ::core::ffi::c_int,
        arg4: usize,
        arg5: *const ::core::ffi::c_char,
        arg6: va_list,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub fds_bits: [__int32_t; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::core::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::core::mem::align_of::<fd_set>() - 4usize];
    ["Offset of field: fd_set::fds_bits"][::core::mem::offset_of!(fd_set, fds_bits) - 0usize];
};
unsafe extern "C" {
    pub fn __darwin_check_fd_set_overflow(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __darwin_time_t,
    pub tv_nsec: ::core::ffi::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::core::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::core::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::core::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::core::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __darwin_time_t,
    pub tv_usec: __darwin_suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::core::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::core::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::core::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::core::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval64 {
    pub tv_sec: __int64_t,
    pub tv_usec: __int64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval64"][::core::mem::size_of::<timeval64>() - 16usize];
    ["Alignment of timeval64"][::core::mem::align_of::<timeval64>() - 8usize];
    ["Offset of field: timeval64::tv_sec"][::core::mem::offset_of!(timeval64, tv_sec) - 0usize];
    ["Offset of field: timeval64::tv_usec"][::core::mem::offset_of!(timeval64, tv_usec) - 8usize];
};
pub type time_t = __darwin_time_t;
pub type suseconds_t = __darwin_suseconds_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerval {
    pub it_interval: timeval,
    pub it_value: timeval,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itimerval"][::core::mem::size_of::<itimerval>() - 32usize];
    ["Alignment of itimerval"][::core::mem::align_of::<itimerval>() - 8usize];
    ["Offset of field: itimerval::it_interval"]
        [::core::mem::offset_of!(itimerval, it_interval) - 0usize];
    ["Offset of field: itimerval::it_value"]
        [::core::mem::offset_of!(itimerval, it_value) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timezone {
    pub tz_minuteswest: ::core::ffi::c_int,
    pub tz_dsttime: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timezone"][::core::mem::size_of::<timezone>() - 8usize];
    ["Alignment of timezone"][::core::mem::align_of::<timezone>() - 4usize];
    ["Offset of field: timezone::tz_minuteswest"]
        [::core::mem::offset_of!(timezone, tz_minuteswest) - 0usize];
    ["Offset of field: timezone::tz_dsttime"]
        [::core::mem::offset_of!(timezone, tz_dsttime) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct clockinfo {
    pub hz: ::core::ffi::c_int,
    pub tick: ::core::ffi::c_int,
    pub tickadj: ::core::ffi::c_int,
    pub stathz: ::core::ffi::c_int,
    pub profhz: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of clockinfo"][::core::mem::size_of::<clockinfo>() - 20usize];
    ["Alignment of clockinfo"][::core::mem::align_of::<clockinfo>() - 4usize];
    ["Offset of field: clockinfo::hz"][::core::mem::offset_of!(clockinfo, hz) - 0usize];
    ["Offset of field: clockinfo::tick"][::core::mem::offset_of!(clockinfo, tick) - 4usize];
    ["Offset of field: clockinfo::tickadj"][::core::mem::offset_of!(clockinfo, tickadj) - 8usize];
    ["Offset of field: clockinfo::stathz"][::core::mem::offset_of!(clockinfo, stathz) - 12usize];
    ["Offset of field: clockinfo::profhz"][::core::mem::offset_of!(clockinfo, profhz) - 16usize];
};
pub type clock_t = __darwin_clock_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::core::ffi::c_int,
    pub tm_min: ::core::ffi::c_int,
    pub tm_hour: ::core::ffi::c_int,
    pub tm_mday: ::core::ffi::c_int,
    pub tm_mon: ::core::ffi::c_int,
    pub tm_year: ::core::ffi::c_int,
    pub tm_wday: ::core::ffi::c_int,
    pub tm_yday: ::core::ffi::c_int,
    pub tm_isdst: ::core::ffi::c_int,
    pub tm_gmtoff: ::core::ffi::c_long,
    pub tm_zone: *mut ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tm"][::core::mem::size_of::<tm>() - 56usize];
    ["Alignment of tm"][::core::mem::align_of::<tm>() - 8usize];
    ["Offset of field: tm::tm_sec"][::core::mem::offset_of!(tm, tm_sec) - 0usize];
    ["Offset of field: tm::tm_min"][::core::mem::offset_of!(tm, tm_min) - 4usize];
    ["Offset of field: tm::tm_hour"][::core::mem::offset_of!(tm, tm_hour) - 8usize];
    ["Offset of field: tm::tm_mday"][::core::mem::offset_of!(tm, tm_mday) - 12usize];
    ["Offset of field: tm::tm_mon"][::core::mem::offset_of!(tm, tm_mon) - 16usize];
    ["Offset of field: tm::tm_year"][::core::mem::offset_of!(tm, tm_year) - 20usize];
    ["Offset of field: tm::tm_wday"][::core::mem::offset_of!(tm, tm_wday) - 24usize];
    ["Offset of field: tm::tm_yday"][::core::mem::offset_of!(tm, tm_yday) - 28usize];
    ["Offset of field: tm::tm_isdst"][::core::mem::offset_of!(tm, tm_isdst) - 32usize];
    ["Offset of field: tm::tm_gmtoff"][::core::mem::offset_of!(tm, tm_gmtoff) - 40usize];
    ["Offset of field: tm::tm_zone"][::core::mem::offset_of!(tm, tm_zone) - 48usize];
};
unsafe extern "C" {
    pub static mut tzname: [*mut ::core::ffi::c_char; 0usize];
}
unsafe extern "C" {
    pub static mut getdate_err: ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static mut timezone: ::core::ffi::c_long;
}
unsafe extern "C" {
    pub static mut daylight: ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn asctime(arg1: *const tm) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn clock() -> clock_t;
}
unsafe extern "C" {
    pub fn ctime(arg1: *const time_t) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn difftime(arg1: time_t, arg2: time_t) -> f64;
}
unsafe extern "C" {
    pub fn getdate(arg1: *const ::core::ffi::c_char) -> *mut tm;
}
unsafe extern "C" {
    pub fn gmtime(arg1: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime(arg1: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn mktime(arg1: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn strftime(
        arg1: *mut ::core::ffi::c_char,
        arg2: usize,
        arg3: *const ::core::ffi::c_char,
        arg4: *const tm,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strptime(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut tm,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn time(arg1: *mut time_t) -> time_t;
}
unsafe extern "C" {
    pub fn tzset();
}
unsafe extern "C" {
    pub fn asctime_r(arg1: *const tm, arg2: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn ctime_r(arg1: *const time_t, arg2: *mut ::core::ffi::c_char)
    -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn gmtime_r(arg1: *const time_t, arg2: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime_r(arg1: *const time_t, arg2: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn posix2time(arg1: time_t) -> time_t;
}
unsafe extern "C" {
    pub fn tzsetwall();
}
unsafe extern "C" {
    pub fn time2posix(arg1: time_t) -> time_t;
}
unsafe extern "C" {
    pub fn timelocal(arg1: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn timegm(arg1: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn nanosleep(__rqtp: *const timespec, __rmtp: *mut timespec) -> ::core::ffi::c_int;
}
pub const clockid_t__CLOCK_REALTIME: clockid_t = 0;
pub const clockid_t__CLOCK_MONOTONIC: clockid_t = 6;
pub const clockid_t__CLOCK_MONOTONIC_RAW: clockid_t = 4;
pub const clockid_t__CLOCK_MONOTONIC_RAW_APPROX: clockid_t = 5;
pub const clockid_t__CLOCK_UPTIME_RAW: clockid_t = 8;
pub const clockid_t__CLOCK_UPTIME_RAW_APPROX: clockid_t = 9;
pub const clockid_t__CLOCK_PROCESS_CPUTIME_ID: clockid_t = 12;
pub const clockid_t__CLOCK_THREAD_CPUTIME_ID: clockid_t = 16;
pub type clockid_t = ::core::ffi::c_uint;
unsafe extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn clock_gettime_nsec_np(__clock_id: clockid_t) -> __uint64_t;
}
unsafe extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn timespec_get(ts: *mut timespec, base: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn adjtime(arg1: *const timeval, arg2: *mut timeval) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn futimes(arg1: ::core::ffi::c_int, arg2: *const timeval) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn lutimes(arg1: *const ::core::ffi::c_char, arg2: *const timeval) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn settimeofday(arg1: *const timeval, arg2: *const timezone) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getitimer(arg1: ::core::ffi::c_int, arg2: *mut itimerval) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn gettimeofday(arg1: *mut timeval, arg2: *mut ::core::ffi::c_void) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn select(
        arg1: ::core::ffi::c_int,
        arg2: *mut fd_set,
        arg3: *mut fd_set,
        arg4: *mut fd_set,
        arg5: *mut timeval,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setitimer(
        arg1: ::core::ffi::c_int,
        arg2: *const itimerval,
        arg3: *mut itimerval,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn utimes(arg1: *const ::core::ffi::c_char, arg2: *const timeval) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sched_param {
    pub sched_priority: ::core::ffi::c_int,
    pub __opaque: [::core::ffi::c_char; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sched_param"][::core::mem::size_of::<sched_param>() - 8usize];
    ["Alignment of sched_param"][::core::mem::align_of::<sched_param>() - 4usize];
    ["Offset of field: sched_param::sched_priority"]
        [::core::mem::offset_of!(sched_param, sched_priority) - 0usize];
    ["Offset of field: sched_param::__opaque"]
        [::core::mem::offset_of!(sched_param, __opaque) - 4usize];
};
unsafe extern "C" {
    pub fn sched_yield() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sched_get_priority_min(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sched_get_priority_max(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
pub type pthread_attr_t = __darwin_pthread_attr_t;
pub type pthread_cond_t = __darwin_pthread_cond_t;
pub type pthread_condattr_t = __darwin_pthread_condattr_t;
pub type pthread_key_t = __darwin_pthread_key_t;
pub type pthread_mutex_t = __darwin_pthread_mutex_t;
pub type pthread_mutexattr_t = __darwin_pthread_mutexattr_t;
pub type pthread_once_t = __darwin_pthread_once_t;
pub type pthread_rwlock_t = __darwin_pthread_rwlock_t;
pub type pthread_rwlockattr_t = __darwin_pthread_rwlockattr_t;
pub type pthread_t = __darwin_pthread_t;
pub const QOS_CLASS_USER_INTERACTIVE: _bindgen_ty_1 = 33;
pub const QOS_CLASS_USER_INITIATED: _bindgen_ty_1 = 25;
pub const QOS_CLASS_DEFAULT: _bindgen_ty_1 = 21;
pub const QOS_CLASS_UTILITY: _bindgen_ty_1 = 17;
pub const QOS_CLASS_BACKGROUND: _bindgen_ty_1 = 9;
pub const QOS_CLASS_UNSPECIFIED: _bindgen_ty_1 = 0;
pub type _bindgen_ty_1 = ::core::ffi::c_uint;
pub type qos_class_t = ::core::ffi::c_uint;
unsafe extern "C" {
    pub fn qos_class_self() -> qos_class_t;
}
unsafe extern "C" {
    pub fn qos_class_main() -> qos_class_t;
}
unsafe extern "C" {
    pub fn pthread_attr_set_qos_class_np(
        __attr: *mut pthread_attr_t,
        __qos_class: qos_class_t,
        __relative_priority: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_get_qos_class_np(
        __attr: *mut pthread_attr_t,
        __qos_class: *mut qos_class_t,
        __relative_priority: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_set_qos_class_self_np(
        __qos_class: qos_class_t,
        __relative_priority: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_get_qos_class_np(
        __pthread: pthread_t,
        __qos_class: *mut qos_class_t,
        __relative_priority: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_override_s {
    _unused: [u8; 0],
}
pub type pthread_override_t = *mut pthread_override_s;
unsafe extern "C" {
    pub fn pthread_override_qos_class_start_np(
        __pthread: pthread_t,
        __qos_class: qos_class_t,
        __relative_priority: ::core::ffi::c_int,
    ) -> pthread_override_t;
}
unsafe extern "C" {
    pub fn pthread_override_qos_class_end_np(__override: pthread_override_t) -> ::core::ffi::c_int;
}
pub type mach_port_t = __darwin_mach_port_t;
pub type sigset_t = __darwin_sigset_t;
unsafe extern "C" {
    pub fn pthread_atfork(
        arg1: ::core::option::Option<unsafe extern "C" fn()>,
        arg2: ::core::option::Option<unsafe extern "C" fn()>,
        arg3: ::core::option::Option<unsafe extern "C" fn()>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_destroy(arg1: *mut pthread_attr_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getdetachstate(
        arg1: *const pthread_attr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getguardsize(
        arg1: *const pthread_attr_t,
        arg2: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getinheritsched(
        arg1: *const pthread_attr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getschedparam(
        arg1: *const pthread_attr_t,
        arg2: *mut sched_param,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getschedpolicy(
        arg1: *const pthread_attr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getscope(
        arg1: *const pthread_attr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getstack(
        arg1: *const pthread_attr_t,
        arg2: *mut *mut ::core::ffi::c_void,
        arg3: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getstackaddr(
        arg1: *const pthread_attr_t,
        arg2: *mut *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getstacksize(
        arg1: *const pthread_attr_t,
        arg2: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_init(arg1: *mut pthread_attr_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setdetachstate(
        arg1: *mut pthread_attr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setguardsize(arg1: *mut pthread_attr_t, arg2: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setinheritsched(
        arg1: *mut pthread_attr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setschedparam(
        arg1: *mut pthread_attr_t,
        arg2: *const sched_param,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setschedpolicy(
        arg1: *mut pthread_attr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setscope(
        arg1: *mut pthread_attr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setstack(
        arg1: *mut pthread_attr_t,
        arg2: *mut ::core::ffi::c_void,
        arg3: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setstackaddr(
        arg1: *mut pthread_attr_t,
        arg2: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setstacksize(arg1: *mut pthread_attr_t, arg2: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_cancel(arg1: pthread_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_broadcast(arg1: *mut pthread_cond_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_destroy(arg1: *mut pthread_cond_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_init(
        arg1: *mut pthread_cond_t,
        arg2: *const pthread_condattr_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_signal(arg1: *mut pthread_cond_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_timedwait(
        arg1: *mut pthread_cond_t,
        arg2: *mut pthread_mutex_t,
        arg3: *const timespec,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_wait(
        arg1: *mut pthread_cond_t,
        arg2: *mut pthread_mutex_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_destroy(arg1: *mut pthread_condattr_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_init(arg1: *mut pthread_condattr_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_getpshared(
        arg1: *const pthread_condattr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_setpshared(
        arg1: *mut pthread_condattr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_create(
        arg1: *mut pthread_t,
        arg2: *const pthread_attr_t,
        arg3: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> *mut ::core::ffi::c_void,
        >,
        arg4: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_detach(arg1: pthread_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_equal(arg1: pthread_t, arg2: pthread_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_exit(arg1: *mut ::core::ffi::c_void) -> !;
}
unsafe extern "C" {
    pub fn pthread_getconcurrency() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_getschedparam(
        arg1: pthread_t,
        arg2: *mut ::core::ffi::c_int,
        arg3: *mut sched_param,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_getspecific(arg1: pthread_key_t) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn pthread_join(arg1: pthread_t, arg2: *mut *mut ::core::ffi::c_void)
    -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_key_create(
        arg1: *mut pthread_key_t,
        arg2: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_key_delete(arg1: pthread_key_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_destroy(arg1: *mut pthread_mutex_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_getprioceiling(
        arg1: *const pthread_mutex_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_init(
        arg1: *mut pthread_mutex_t,
        arg2: *const pthread_mutexattr_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_lock(arg1: *mut pthread_mutex_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_setprioceiling(
        arg1: *mut pthread_mutex_t,
        arg2: ::core::ffi::c_int,
        arg3: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_trylock(arg1: *mut pthread_mutex_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_unlock(arg1: *mut pthread_mutex_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_destroy(arg1: *mut pthread_mutexattr_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_getprioceiling(
        arg1: *const pthread_mutexattr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_getprotocol(
        arg1: *const pthread_mutexattr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_getpshared(
        arg1: *const pthread_mutexattr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_gettype(
        arg1: *const pthread_mutexattr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_getpolicy_np(
        arg1: *const pthread_mutexattr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_init(arg1: *mut pthread_mutexattr_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_setprioceiling(
        arg1: *mut pthread_mutexattr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_setprotocol(
        arg1: *mut pthread_mutexattr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_setpshared(
        arg1: *mut pthread_mutexattr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_settype(
        arg1: *mut pthread_mutexattr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_setpolicy_np(
        arg1: *mut pthread_mutexattr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_once(
        arg1: *mut pthread_once_t,
        arg2: ::core::option::Option<unsafe extern "C" fn()>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_destroy(arg1: *mut pthread_rwlock_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_init(
        arg1: *mut pthread_rwlock_t,
        arg2: *const pthread_rwlockattr_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_rdlock(arg1: *mut pthread_rwlock_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_tryrdlock(arg1: *mut pthread_rwlock_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_trywrlock(arg1: *mut pthread_rwlock_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_wrlock(arg1: *mut pthread_rwlock_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_unlock(arg1: *mut pthread_rwlock_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_destroy(arg1: *mut pthread_rwlockattr_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_getpshared(
        arg1: *const pthread_rwlockattr_t,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_init(arg1: *mut pthread_rwlockattr_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_setpshared(
        arg1: *mut pthread_rwlockattr_t,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_self() -> pthread_t;
}
unsafe extern "C" {
    pub fn pthread_setcancelstate(
        arg1: ::core::ffi::c_int,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_setcanceltype(
        arg1: ::core::ffi::c_int,
        arg2: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_setconcurrency(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_setschedparam(
        arg1: pthread_t,
        arg2: ::core::ffi::c_int,
        arg3: *const sched_param,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_setspecific(
        arg1: pthread_key_t,
        arg2: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_testcancel();
}
unsafe extern "C" {
    pub fn pthread_is_threaded_np() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_threadid_np(arg1: pthread_t, arg2: *mut __uint64_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_getname_np(
        arg1: pthread_t,
        arg2: *mut ::core::ffi::c_char,
        arg3: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_setname_np(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_main_np() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_mach_thread_np(arg1: pthread_t) -> mach_port_t;
}
unsafe extern "C" {
    pub fn pthread_get_stacksize_np(arg1: pthread_t) -> usize;
}
unsafe extern "C" {
    pub fn pthread_get_stackaddr_np(arg1: pthread_t) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn pthread_cond_signal_thread_np(
        arg1: *mut pthread_cond_t,
        arg2: pthread_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_timedwait_relative_np(
        arg1: *mut pthread_cond_t,
        arg2: *mut pthread_mutex_t,
        arg3: *const timespec,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_create_suspended_np(
        arg1: *mut pthread_t,
        arg2: *const pthread_attr_t,
        arg3: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> *mut ::core::ffi::c_void,
        >,
        arg4: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_kill(arg1: pthread_t, arg2: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_from_mach_thread_np(arg1: mach_port_t) -> pthread_t;
}
unsafe extern "C" {
    pub fn pthread_sigmask(
        arg1: ::core::ffi::c_int,
        arg2: *const sigset_t,
        arg3: *mut sigset_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_yield_np();
}
unsafe extern "C" {
    pub fn pthread_jit_write_protect_np(enabled: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn pthread_jit_write_protect_supported_np() -> ::core::ffi::c_int;
}
pub type pthread_jit_write_callback_t = ::core::option::Option<
    unsafe extern "C" fn(ctx: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    pub fn pthread_jit_write_with_callback_np(
        callback: pthread_jit_write_callback_t,
        ctx: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pthread_jit_write_freeze_callbacks_np();
}
unsafe extern "C" {
    pub fn pthread_cpu_number_np(cpu_number_out: *mut usize) -> ::core::ffi::c_int;
}
pub type _z_task_t = pthread_t;
pub type z_task_attr_t = pthread_attr_t;
pub type _z_mutex_t = pthread_mutex_t;
pub type _z_mutex_rec_t = pthread_mutex_t;
pub type _z_condvar_t = pthread_cond_t;
pub type z_clock_t = timespec;
pub type z_time_t = timeval;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_sys_net_socket_t {
    pub __bindgen_anon_1: _z_sys_net_socket_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _z_sys_net_socket_t__bindgen_ty_1 {
    pub _fd: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_sys_net_socket_t__bindgen_ty_1"]
        [::core::mem::size_of::<_z_sys_net_socket_t__bindgen_ty_1>() - 4usize];
    ["Alignment of _z_sys_net_socket_t__bindgen_ty_1"]
        [::core::mem::align_of::<_z_sys_net_socket_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: _z_sys_net_socket_t__bindgen_ty_1::_fd"]
        [::core::mem::offset_of!(_z_sys_net_socket_t__bindgen_ty_1, _fd) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_sys_net_socket_t"][::core::mem::size_of::<_z_sys_net_socket_t>() - 4usize];
    ["Alignment of _z_sys_net_socket_t"][::core::mem::align_of::<_z_sys_net_socket_t>() - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_sys_net_endpoint_t {
    pub __bindgen_anon_1: _z_sys_net_endpoint_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _z_sys_net_endpoint_t__bindgen_ty_1 {
    pub _iptcp: *mut addrinfo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_sys_net_endpoint_t__bindgen_ty_1"]
        [::core::mem::size_of::<_z_sys_net_endpoint_t__bindgen_ty_1>() - 8usize];
    ["Alignment of _z_sys_net_endpoint_t__bindgen_ty_1"]
        [::core::mem::align_of::<_z_sys_net_endpoint_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: _z_sys_net_endpoint_t__bindgen_ty_1::_iptcp"]
        [::core::mem::offset_of!(_z_sys_net_endpoint_t__bindgen_ty_1, _iptcp) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_sys_net_endpoint_t"][::core::mem::size_of::<_z_sys_net_endpoint_t>() - 8usize];
    ["Alignment of _z_sys_net_endpoint_t"]
        [::core::mem::align_of::<_z_sys_net_endpoint_t>() - 8usize];
};
unsafe extern "C" {
    pub fn _z_report_system_error(errcode: ::core::ffi::c_int);
}
unsafe extern "C" {
    #[doc = " Generates a random unsigned 8-bit integer."]
    pub fn z_random_u8() -> u8;
}
unsafe extern "C" {
    #[doc = " Generates a random unsigned 16-bit integer."]
    pub fn z_random_u16() -> u16;
}
unsafe extern "C" {
    #[doc = " Generates a random unsigned 32-bit integer."]
    pub fn z_random_u32() -> u32;
}
unsafe extern "C" {
    #[doc = " Generates a random unsigned 64-bit integer."]
    pub fn z_random_u64() -> u64;
}
unsafe extern "C" {
    #[doc = " Fills buffer with random data.\n\n Parameters:\n   buf: Pointer to the buffer that will be filled with random data.\n   len: Number of bytes to fill in the buffer."]
    pub fn z_random_fill(buf: *mut ::core::ffi::c_void, len: usize);
}
unsafe extern "C" {
    #[doc = " Allocates memory of the specified size.\n\n Parameters:\n   size: The number of bytes to allocate.\n\n Returns:\n   A pointer to the allocated memory, or NULL if the allocation fails."]
    pub fn z_malloc(size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = " Reallocates the given memory block to a new size.\n\n Parameters:\n   ptr: Pointer to the previously allocated memory. Can be NULL, in which case it behaves like z_malloc().\n   size: The new size for the memory block in bytes.\n\n Returns:\n   A pointer to the reallocated memory, or NULL if the reallocation fails."]
    pub fn z_realloc(ptr: *mut ::core::ffi::c_void, size: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = " Frees the memory previously allocated by z_malloc or z_realloc.\n\n Parameters:\n   ptr: Pointer to the memory to be freed. If NULL, no action is taken."]
    pub fn z_free(ptr: *mut ::core::ffi::c_void);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct z_owned_task_t {
    pub _val: _z_task_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of z_owned_task_t"][::core::mem::size_of::<z_owned_task_t>() - 8usize];
    ["Alignment of z_owned_task_t"][::core::mem::align_of::<z_owned_task_t>() - 8usize];
    ["Offset of field: z_owned_task_t::_val"]
        [::core::mem::offset_of!(z_owned_task_t, _val) - 0usize];
};
pub type z_loaned_task_t = _z_task_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct z_moved_task_t {
    pub _this: z_owned_task_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of z_moved_task_t"][::core::mem::size_of::<z_moved_task_t>() - 8usize];
    ["Alignment of z_moved_task_t"][::core::mem::align_of::<z_moved_task_t>() - 8usize];
    ["Offset of field: z_moved_task_t::_this"]
        [::core::mem::offset_of!(z_moved_task_t, _this) - 0usize];
};
unsafe extern "C" {
    pub fn z_internal_task_null(obj: *mut z_owned_task_t);
}
unsafe extern "C" {
    pub fn z_task_take(obj: *mut z_owned_task_t, src: *mut z_moved_task_t);
}
unsafe extern "C" {
    pub fn z_task_loan(obj: *const z_owned_task_t) -> *const z_loaned_task_t;
}
unsafe extern "C" {
    pub fn z_task_loan_mut(obj: *mut z_owned_task_t) -> *mut z_loaned_task_t;
}
unsafe extern "C" {
    pub fn z_task_move(obj: *mut z_owned_task_t) -> *mut z_moved_task_t;
}
unsafe extern "C" {
    pub fn _z_task_init(
        task: *mut _z_task_t,
        attr: *mut z_task_attr_t,
        fun: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> *mut ::core::ffi::c_void,
        >,
        arg: *mut ::core::ffi::c_void,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_task_join(task: *mut _z_task_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_task_detach(task: *mut _z_task_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_task_cancel(task: *mut _z_task_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_task_exit();
}
unsafe extern "C" {
    pub fn _z_task_free(task: *mut *mut _z_task_t);
}
unsafe extern "C" {
    #[doc = " Constructs a new task.\n\n Parameters:\n   task: An uninitialized memory location where task will be constructed.\n   attr: Attributes of the task.\n   fun: Function to be executed by the task.\n   arg: Argument that will be passed to the function `fun`.\n\n Returns:\n   ``0`` in case of success, negative error code otherwise."]
    pub fn z_task_init(
        task: *mut z_owned_task_t,
        attr: *mut z_task_attr_t,
        fun: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> *mut ::core::ffi::c_void,
        >,
        arg: *mut ::core::ffi::c_void,
    ) -> z_result_t;
}
unsafe extern "C" {
    #[doc = " Joins the task and releases all allocated resources.\n\n Parameters:\n   task: Pointer to a :c:type:`z_moved_task_t` representing the task to be joined.\n\n Returns:\n   ``0`` in case of success, negative error code otherwise."]
    pub fn z_task_join(task: *mut z_moved_task_t) -> z_result_t;
}
unsafe extern "C" {
    #[doc = " Detaches the task and releases all allocated resources.\n\n Parameters:\n   task: Pointer to a :c:type:`z_moved_task_t` representing the task to be detached.\n\n Returns:\n   ``0`` in case of success, negative error code otherwise."]
    pub fn z_task_detach(task: *mut z_moved_task_t) -> z_result_t;
}
unsafe extern "C" {
    #[doc = " Drops the task. Same as :c:func:`z_task_detach`. Use :c:func:`z_task_join` to wait for the task completion.\n\n Parameters:\n   task: Pointer to a :c:type:`z_moved_task_t` representing the task to be dropped.\n\n Returns:\n   ``0`` in case of success, negative error code otherwise."]
    pub fn z_task_drop(task: *mut z_moved_task_t) -> z_result_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct z_owned_mutex_t {
    pub _val: _z_mutex_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of z_owned_mutex_t"][::core::mem::size_of::<z_owned_mutex_t>() - 64usize];
    ["Alignment of z_owned_mutex_t"][::core::mem::align_of::<z_owned_mutex_t>() - 8usize];
    ["Offset of field: z_owned_mutex_t::_val"]
        [::core::mem::offset_of!(z_owned_mutex_t, _val) - 0usize];
};
pub type z_loaned_mutex_t = _z_mutex_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct z_moved_mutex_t {
    pub _this: z_owned_mutex_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of z_moved_mutex_t"][::core::mem::size_of::<z_moved_mutex_t>() - 64usize];
    ["Alignment of z_moved_mutex_t"][::core::mem::align_of::<z_moved_mutex_t>() - 8usize];
    ["Offset of field: z_moved_mutex_t::_this"]
        [::core::mem::offset_of!(z_moved_mutex_t, _this) - 0usize];
};
unsafe extern "C" {
    pub fn z_internal_mutex_null(obj: *mut z_owned_mutex_t);
}
unsafe extern "C" {
    pub fn z_mutex_take(obj: *mut z_owned_mutex_t, src: *mut z_moved_mutex_t);
}
unsafe extern "C" {
    pub fn z_mutex_loan(obj: *const z_owned_mutex_t) -> *const z_loaned_mutex_t;
}
unsafe extern "C" {
    pub fn z_mutex_loan_mut(obj: *mut z_owned_mutex_t) -> *mut z_loaned_mutex_t;
}
unsafe extern "C" {
    pub fn z_mutex_move(obj: *mut z_owned_mutex_t) -> *mut z_moved_mutex_t;
}
unsafe extern "C" {
    pub fn _z_mutex_init(m: *mut _z_mutex_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_mutex_drop(m: *mut _z_mutex_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_mutex_lock(m: *mut _z_mutex_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_mutex_try_lock(m: *mut _z_mutex_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_mutex_unlock(m: *mut _z_mutex_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_mutex_rec_init(m: *mut _z_mutex_rec_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_mutex_rec_drop(m: *mut _z_mutex_rec_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_mutex_rec_lock(m: *mut _z_mutex_rec_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_mutex_rec_try_lock(m: *mut _z_mutex_rec_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_mutex_rec_unlock(m: *mut _z_mutex_rec_t) -> z_result_t;
}
unsafe extern "C" {
    #[doc = " Constructs a mutex.\n\n Parameters:\n   m: Pointer to an uninitialized :c:type:`z_owned_mutex_t` that will be constructed.\n\n Returns:\n   ``0`` in case of success, negative error code otherwise."]
    pub fn z_mutex_init(m: *mut z_owned_mutex_t) -> z_result_t;
}
unsafe extern "C" {
    #[doc = " Drops a mutex and resets it to its gravestone state.\n\n Parameters:\n   m: Pointer to a :c:type:`z_moved_mutex_t` that will be dropped.\n\n Returns:\n   ``0`` in case of success, negative error code otherwise."]
    pub fn z_mutex_drop(m: *mut z_moved_mutex_t) -> z_result_t;
}
unsafe extern "C" {
    #[doc = " Locks a mutex. If the mutex is already locked, blocks the thread until it acquires the lock.\n\n Parameters:\n   m: Pointer to a :c:type:`z_loaned_mutex_t` that will be locked.\n\n Returns:\n   ``0`` in case of success, negative error code otherwise."]
    pub fn z_mutex_lock(m: *mut z_loaned_mutex_t) -> z_result_t;
}
unsafe extern "C" {
    #[doc = " Tries to lock a mutex. If the mutex is already locked, the function returns immediately.\n\n Parameters:\n   m: Pointer to a :c:type:`z_loaned_mutex_t` that will be locked if not already locked.\n\n Returns:\n   ``0`` in case of success, negative error code otherwise."]
    pub fn z_mutex_try_lock(m: *mut z_loaned_mutex_t) -> z_result_t;
}
unsafe extern "C" {
    #[doc = " Unlocks a previously locked mutex. If the mutex was not locked by the current thread, the behavior is undefined.\n\n Parameters:\n   m: Pointer to a :c:type:`z_loaned_mutex_t` that will be unlocked.\n\n Returns:\n   ``0`` in case of success, negative error code otherwise."]
    pub fn z_mutex_unlock(m: *mut z_loaned_mutex_t) -> z_result_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct z_owned_condvar_t {
    pub _val: _z_condvar_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of z_owned_condvar_t"][::core::mem::size_of::<z_owned_condvar_t>() - 48usize];
    ["Alignment of z_owned_condvar_t"][::core::mem::align_of::<z_owned_condvar_t>() - 8usize];
    ["Offset of field: z_owned_condvar_t::_val"]
        [::core::mem::offset_of!(z_owned_condvar_t, _val) - 0usize];
};
pub type z_loaned_condvar_t = _z_condvar_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct z_moved_condvar_t {
    pub _this: z_owned_condvar_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of z_moved_condvar_t"][::core::mem::size_of::<z_moved_condvar_t>() - 48usize];
    ["Alignment of z_moved_condvar_t"][::core::mem::align_of::<z_moved_condvar_t>() - 8usize];
    ["Offset of field: z_moved_condvar_t::_this"]
        [::core::mem::offset_of!(z_moved_condvar_t, _this) - 0usize];
};
unsafe extern "C" {
    pub fn z_internal_condvar_null(obj: *mut z_owned_condvar_t);
}
unsafe extern "C" {
    pub fn z_condvar_take(obj: *mut z_owned_condvar_t, src: *mut z_moved_condvar_t);
}
unsafe extern "C" {
    pub fn z_condvar_loan(obj: *const z_owned_condvar_t) -> *const z_loaned_condvar_t;
}
unsafe extern "C" {
    pub fn z_condvar_loan_mut(obj: *mut z_owned_condvar_t) -> *mut z_loaned_condvar_t;
}
unsafe extern "C" {
    pub fn z_condvar_move(obj: *mut z_owned_condvar_t) -> *mut z_moved_condvar_t;
}
unsafe extern "C" {
    pub fn _z_condvar_init(cv: *mut _z_condvar_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_condvar_drop(cv: *mut _z_condvar_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_condvar_signal(cv: *mut _z_condvar_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_condvar_signal_all(cv: *mut _z_condvar_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_condvar_wait(cv: *mut _z_condvar_t, m: *mut _z_mutex_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_condvar_wait_until(
        cv: *mut _z_condvar_t,
        m: *mut _z_mutex_t,
        abstime: *const z_clock_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    #[doc = " Initializes a condition variable.\n\n Parameters:\n   cv: Pointer to an uninitialized :c:type:`z_owned_condvar_t` that will be initialized.\n\n Returns:\n   ``0`` if the initialization is successful, a negative value otherwise."]
    pub fn z_condvar_init(cv: *mut z_owned_condvar_t) -> z_result_t;
}
unsafe extern "C" {
    #[doc = " Destroys a condition variable and releases its resources.\n\n Parameters:\n   cv: Pointer to a :c:type:`z_moved_condvar_t` that will be destroyed.\n\n Returns:\n   ``0`` if the destruction is successful, a negative value otherwise."]
    pub fn z_condvar_drop(cv: *mut z_moved_condvar_t) -> z_result_t;
}
unsafe extern "C" {
    #[doc = " Signals (wakes up) one thread waiting on the condition variable.\n\n Parameters:\n   cv: Pointer to a :c:type:`z_loaned_condvar_t` that will be signaled.\n\n Returns:\n   ``0`` if the signal is successful, a negative value otherwise."]
    pub fn z_condvar_signal(cv: *mut z_loaned_condvar_t) -> z_result_t;
}
unsafe extern "C" {
    #[doc = " Waits for a signal on the condition variable while holding a mutex.\n\n The calling thread is blocked until the condition variable is signaled.\n The associated mutex must be locked by the calling thread, and it will be automatically unlocked while waiting.\n\n Parameters:\n   cv: Pointer to a :c:type:`z_loaned_condvar_t` on which to wait.\n   m: Pointer to a :c:type:`z_loaned_mutex_t` that will be unlocked during the wait.\n\n Returns:\n   ``0`` if the wait is successful, a negative value otherwise."]
    pub fn z_condvar_wait(cv: *mut z_loaned_condvar_t, m: *mut z_loaned_mutex_t) -> z_result_t;
}
unsafe extern "C" {
    #[doc = " Waits for a signal on the condition variable while holding a mutex until a specified time.\n\n The calling thread is blocked until the condition variable is signaled or the timeout occurs.\n The associated mutex must be locked by the calling thread, and it will be automatically unlocked while waiting.\n\n Parameters:\n   cv: Pointer to a :c:type:`z_loaned_condvar_t` on which to wait.\n   m: Pointer to a :c:type:`z_loaned_mutex_t` that will be unlocked during the wait.\n   abstime: Absolute end time.\n\n Returns:\n   ``0`` if the wait is successful, ``Z_ETIMEDOUT`` if a timeout occurred, other negative value otherwise."]
    pub fn z_condvar_wait_until(
        cv: *mut z_loaned_condvar_t,
        m: *mut z_loaned_mutex_t,
        abstime: *const z_clock_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    #[doc = " Suspends execution for a specified amount of time in microseconds.\n\n Parameters:\n   time: The amount of time to sleep, in microseconds.\n\n Returns:\n   ``0`` if the sleep is successful, a negative value otherwise."]
    pub fn z_sleep_us(time: usize) -> z_result_t;
}
unsafe extern "C" {
    #[doc = " Suspends execution for a specified amount of time in milliseconds.\n\n Parameters:\n   time: The amount of time to sleep, in milliseconds.\n\n Returns:\n   ``0`` if the sleep is successful, a negative value otherwise."]
    pub fn z_sleep_ms(time: usize) -> z_result_t;
}
unsafe extern "C" {
    #[doc = " Suspends execution for a specified amount of time in seconds.\n\n Parameters:\n   time: The amount of time to sleep, in seconds.\n\n Returns:\n   ``0`` if the sleep is successful, a negative value otherwise."]
    pub fn z_sleep_s(time: usize) -> z_result_t;
}
unsafe extern "C" {
    #[doc = " Returns monotonic clock time point corresponding to the current time instant."]
    pub fn z_clock_now() -> z_clock_t;
}
unsafe extern "C" {
    #[doc = " Returns the elapsed time in microseconds since a given clock time.\n\n Parameters:\n   time: Pointer to a `z_clock_t` representing the starting time.\n\n Returns:\n   The elapsed time in microseconds."]
    pub fn z_clock_elapsed_us(time: *mut z_clock_t) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    #[doc = " Returns the elapsed time in milliseconds since a given clock time.\n\n Parameters:\n   time: Pointer to a `z_clock_t` representing the starting time.\n\n Returns:\n   The elapsed time in milliseconds."]
    pub fn z_clock_elapsed_ms(time: *mut z_clock_t) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    #[doc = " Returns the elapsed time in seconds since a given clock time.\n\n Parameters:\n   time: Pointer to a `z_clock_t` representing the starting time.\n\n Returns:\n   The elapsed time in seconds."]
    pub fn z_clock_elapsed_s(time: *mut z_clock_t) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    #[doc = " Offsets the clock by a specified duration in microseconds.\n\n Parameters:\n   clock: Pointer to a `z_clock_t` to offset.\n   duration: The duration in microseconds."]
    pub fn z_clock_advance_us(clock: *mut z_clock_t, duration: ::core::ffi::c_ulong);
}
unsafe extern "C" {
    #[doc = " Offsets the clock by a specified duration in milliseconds.\n\n Parameters:\n   clock: Pointer to a `z_clock_t` to offset.\n   duration: The duration in milliseconds."]
    pub fn z_clock_advance_ms(clock: *mut z_clock_t, duration: ::core::ffi::c_ulong);
}
unsafe extern "C" {
    #[doc = " Offsets the clock by a specified duration in seconds.\n\n Parameters:\n   clock: Pointer to a `z_clock_t` to offset.\n   duration: The duration in seconds."]
    pub fn z_clock_advance_s(clock: *mut z_clock_t, duration: ::core::ffi::c_ulong);
}
unsafe extern "C" {
    #[doc = " Returns system clock time point corresponding to the current time instant."]
    pub fn z_time_now() -> z_time_t;
}
unsafe extern "C" {
    #[doc = " Gets the current time as a string.\n\n Parameters:\n   buf: Pointer to a buffer where the time string will be written.\n   buflen: The length of the buffer.\n\n Returns:\n   A pointer to the buffer containing the time string."]
    pub fn z_time_now_as_str(
        buf: *mut ::core::ffi::c_char,
        buflen: ::core::ffi::c_ulong,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Returns the elapsed time in microseconds since a given time.\n\n Parameters:\n   time: Pointer to a `z_time_t` representing the starting time.\n\n Returns:\n   The elapsed time in microseconds."]
    pub fn z_time_elapsed_us(time: *mut z_time_t) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    #[doc = " Returns the elapsed time in milliseconds since a given time.\n\n Parameters:\n   time: Pointer to a `z_time_t` representing the starting time.\n\n Returns:\n   The elapsed time in milliseconds."]
    pub fn z_time_elapsed_ms(time: *mut z_time_t) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    #[doc = " Returns the elapsed time in seconds since a given time.\n\n Parameters:\n   time: Pointer to a `z_time_t` representing the starting time.\n\n Returns:\n   The elapsed time in seconds."]
    pub fn z_time_elapsed_s(time: *mut z_time_t) -> ::core::ffi::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_time_since_epoch {
    pub secs: u32,
    pub nanos: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_time_since_epoch"][::core::mem::size_of::<_z_time_since_epoch>() - 8usize];
    ["Alignment of _z_time_since_epoch"][::core::mem::align_of::<_z_time_since_epoch>() - 4usize];
    ["Offset of field: _z_time_since_epoch::secs"]
        [::core::mem::offset_of!(_z_time_since_epoch, secs) - 0usize];
    ["Offset of field: _z_time_since_epoch::nanos"]
        [::core::mem::offset_of!(_z_time_since_epoch, nanos) - 4usize];
};
unsafe extern "C" {
    pub fn _z_get_time_since_epoch(t: *mut _z_time_since_epoch) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_socket_set_non_blocking(sock: *const _z_sys_net_socket_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_socket_accept(
        sock_in: *const _z_sys_net_socket_t,
        sock_out: *mut _z_sys_net_socket_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_socket_close(sock: *mut _z_sys_net_socket_t);
}
unsafe extern "C" {
    pub fn _z_socket_wait_event(
        peers: *mut ::core::ffi::c_void,
        mutex: *mut _z_mutex_rec_t,
    ) -> z_result_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_slice_simple_rc_t {
    pub _val: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_slice_simple_rc_t"][::core::mem::size_of::<_z_slice_simple_rc_t>() - 8usize];
    ["Alignment of _z_slice_simple_rc_t"][::core::mem::align_of::<_z_slice_simple_rc_t>() - 8usize];
    ["Offset of field: _z_slice_simple_rc_t::_val"]
        [::core::mem::offset_of!(_z_slice_simple_rc_t, _val) - 0usize];
};
#[doc = " An atomically reference counted subslice.\n\n Members:\n   _z_slice_simple_rc_t len: Rc counted slice.\n   size_t start: Offset to the subslice start.\n   size_t len: Length of the subslice."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_arc_slice_t {
    pub slice: _z_slice_simple_rc_t,
    pub start: usize,
    pub len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_arc_slice_t"][::core::mem::size_of::<_z_arc_slice_t>() - 24usize];
    ["Alignment of _z_arc_slice_t"][::core::mem::align_of::<_z_arc_slice_t>() - 8usize];
    ["Offset of field: _z_arc_slice_t::slice"]
        [::core::mem::offset_of!(_z_arc_slice_t, slice) - 0usize];
    ["Offset of field: _z_arc_slice_t::start"]
        [::core::mem::offset_of!(_z_arc_slice_t, start) - 8usize];
    ["Offset of field: _z_arc_slice_t::len"]
        [::core::mem::offset_of!(_z_arc_slice_t, len) - 16usize];
};
unsafe extern "C" {
    pub fn _z_arc_slice_wrap(s: *mut _z_slice_t, offset: usize, len: usize) -> _z_arc_slice_t;
}
unsafe extern "C" {
    pub fn _z_arc_slice_get_subslice(
        s: *const _z_arc_slice_t,
        offset: usize,
        len: usize,
    ) -> _z_arc_slice_t;
}
unsafe extern "C" {
    pub fn _z_arc_slice_copy(dst: *mut _z_arc_slice_t, src: *const _z_arc_slice_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_arc_slice_move(dst: *mut _z_arc_slice_t, src: *mut _z_arc_slice_t) -> z_result_t;
}
pub type z_element_size_f =
    ::core::option::Option<unsafe extern "C" fn(e: *mut ::core::ffi::c_void) -> usize>;
pub type z_element_clear_f =
    ::core::option::Option<unsafe extern "C" fn(e: *mut ::core::ffi::c_void)>;
pub type z_element_free_f =
    ::core::option::Option<unsafe extern "C" fn(e: *mut *mut ::core::ffi::c_void)>;
pub type z_element_copy_f = ::core::option::Option<
    unsafe extern "C" fn(dst: *mut ::core::ffi::c_void, src: *const ::core::ffi::c_void),
>;
pub type z_element_move_f = ::core::option::Option<
    unsafe extern "C" fn(dst: *mut ::core::ffi::c_void, src: *mut ::core::ffi::c_void),
>;
pub type z_element_clone_f = ::core::option::Option<
    unsafe extern "C" fn(e: *const ::core::ffi::c_void) -> *mut ::core::ffi::c_void,
>;
pub type z_element_eq_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const ::core::ffi::c_void,
        right: *const ::core::ffi::c_void,
    ) -> bool,
>;
pub type z_element_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const ::core::ffi::c_void,
        right: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
pub type z_element_hash_f =
    ::core::option::Option<unsafe extern "C" fn(e: *const ::core::ffi::c_void) -> usize>;
pub type _z_noop_t = ::core::ffi::c_void;
pub type _z_noop_eq_f = ::core::option::Option<
    unsafe extern "C" fn(left: *const _z_noop_t, right: *const _z_noop_t) -> bool,
>;
pub type _z_noop_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(left: *const _z_noop_t, right: *const _z_noop_t) -> ::core::ffi::c_int,
>;
#[doc = " A dynamically allocated vector. Elements are stored as pointers."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_vec_t {
    pub _capacity: usize,
    pub _len: usize,
    pub _val: *mut *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_vec_t"][::core::mem::size_of::<_z_vec_t>() - 24usize];
    ["Alignment of _z_vec_t"][::core::mem::align_of::<_z_vec_t>() - 8usize];
    ["Offset of field: _z_vec_t::_capacity"][::core::mem::offset_of!(_z_vec_t, _capacity) - 0usize];
    ["Offset of field: _z_vec_t::_len"][::core::mem::offset_of!(_z_vec_t, _len) - 8usize];
    ["Offset of field: _z_vec_t::_val"][::core::mem::offset_of!(_z_vec_t, _val) - 16usize];
};
unsafe extern "C" {
    pub fn _z_vec_make(capacity: usize) -> _z_vec_t;
}
unsafe extern "C" {
    pub fn _z_vec_copy(dst: *mut _z_vec_t, src: *const _z_vec_t, f: z_element_clone_f);
}
unsafe extern "C" {
    pub fn _z_vec_move(dst: *mut _z_vec_t, src: *mut _z_vec_t);
}
unsafe extern "C" {
    pub fn _z_vec_append(v: *mut _z_vec_t, e: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn _z_vec_set(
        sv: *mut _z_vec_t,
        pos: usize,
        e: *mut ::core::ffi::c_void,
        f: z_element_free_f,
    );
}
unsafe extern "C" {
    pub fn _z_vec_remove(sv: *mut _z_vec_t, pos: usize, f: z_element_free_f);
}
unsafe extern "C" {
    pub fn _z_vec_reset(v: *mut _z_vec_t, f: z_element_free_f);
}
unsafe extern "C" {
    pub fn _z_vec_clear(v: *mut _z_vec_t, f: z_element_free_f);
}
unsafe extern "C" {
    pub fn _z_vec_free(v: *mut *mut _z_vec_t, f: z_element_free_f);
}
unsafe extern "C" {
    pub fn _z_vec_release(v: *mut _z_vec_t);
}
#[doc = " A dynamically allocated vector. Elements are stored by value."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_svec_t {
    pub _capacity: usize,
    pub _len: usize,
    pub _val: *mut ::core::ffi::c_void,
    pub _aliased: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_svec_t"][::core::mem::size_of::<_z_svec_t>() - 32usize];
    ["Alignment of _z_svec_t"][::core::mem::align_of::<_z_svec_t>() - 8usize];
    ["Offset of field: _z_svec_t::_capacity"]
        [::core::mem::offset_of!(_z_svec_t, _capacity) - 0usize];
    ["Offset of field: _z_svec_t::_len"][::core::mem::offset_of!(_z_svec_t, _len) - 8usize];
    ["Offset of field: _z_svec_t::_val"][::core::mem::offset_of!(_z_svec_t, _val) - 16usize];
    ["Offset of field: _z_svec_t::_aliased"]
        [::core::mem::offset_of!(_z_svec_t, _aliased) - 24usize];
};
unsafe extern "C" {
    pub fn _z_svec_init(v: *mut _z_svec_t, offset: usize, element_size: usize);
}
unsafe extern "C" {
    pub fn _z_svec_make(capacity: usize, element_size: usize) -> _z_svec_t;
}
unsafe extern "C" {
    pub fn _z_svec_copy(
        dst: *mut _z_svec_t,
        src: *const _z_svec_t,
        copy: z_element_copy_f,
        element_size: usize,
        use_elem_f: bool,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_svec_move(dst: *mut _z_svec_t, src: *mut _z_svec_t);
}
unsafe extern "C" {
    pub fn _z_svec_expand(
        v: *mut _z_svec_t,
        move_: z_element_move_f,
        element_size: usize,
        use_elem_f: bool,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_svec_append(
        v: *mut _z_svec_t,
        e: *const ::core::ffi::c_void,
        m: z_element_move_f,
        element_size: usize,
        use_elem_f: bool,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_svec_set(
        sv: *mut _z_svec_t,
        pos: usize,
        e: *mut ::core::ffi::c_void,
        f: z_element_clear_f,
        element_size: usize,
    );
}
unsafe extern "C" {
    pub fn _z_svec_remove(
        sv: *mut _z_svec_t,
        pos: usize,
        f: z_element_clear_f,
        m: z_element_move_f,
        element_size: usize,
        use_elem_f: bool,
    );
}
unsafe extern "C" {
    pub fn _z_svec_reset(v: *mut _z_svec_t, f: z_element_clear_f, element_size: usize);
}
unsafe extern "C" {
    pub fn _z_svec_clear(v: *mut _z_svec_t, f: z_element_clear_f, element_size: usize);
}
unsafe extern "C" {
    pub fn _z_svec_free(v: *mut *mut _z_svec_t, f: z_element_clear_f, element_size: usize);
}
unsafe extern "C" {
    pub fn _z_svec_release(v: *mut _z_svec_t);
}
unsafe extern "C" {
    #[doc = " Offsets a ``uint8_t`` pointer by a given distance. Offsets can be both positive and negative values.\n\n Parameters:\n   ptr: The pointer to offset.\n   off: The offset distance to be applied.\n\n Returns:\n   Returns a ``const uint8_t`` pointer, pointing to the offset position."]
    pub fn _z_cptr_u8_offset(ptr: *const u8, off: isize) -> *const u8;
}
unsafe extern "C" {
    #[doc = " Offsets a ``char`` pointer by a given distance. Offsets can be both positive and negative values.\n\n Parameters:\n   ptr: The pointer to offset.\n   off: The offset distance to be applied.\n\n Returns:\n   Returns a ``const char`` pointer, pointing to the offset position."]
    pub fn _z_cptr_char_offset(
        ptr: *const ::core::ffi::c_char,
        off: isize,
    ) -> *const ::core::ffi::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_iosli_t {
    pub _r_pos: usize,
    pub _w_pos: usize,
    pub _capacity: usize,
    pub _buf: *mut u8,
    pub _is_alloc: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_iosli_t"][::core::mem::size_of::<_z_iosli_t>() - 40usize];
    ["Alignment of _z_iosli_t"][::core::mem::align_of::<_z_iosli_t>() - 8usize];
    ["Offset of field: _z_iosli_t::_r_pos"][::core::mem::offset_of!(_z_iosli_t, _r_pos) - 0usize];
    ["Offset of field: _z_iosli_t::_w_pos"][::core::mem::offset_of!(_z_iosli_t, _w_pos) - 8usize];
    ["Offset of field: _z_iosli_t::_capacity"]
        [::core::mem::offset_of!(_z_iosli_t, _capacity) - 16usize];
    ["Offset of field: _z_iosli_t::_buf"][::core::mem::offset_of!(_z_iosli_t, _buf) - 24usize];
    ["Offset of field: _z_iosli_t::_is_alloc"]
        [::core::mem::offset_of!(_z_iosli_t, _is_alloc) - 32usize];
};
unsafe extern "C" {
    pub fn _z_iosli_make(capacity: usize) -> _z_iosli_t;
}
unsafe extern "C" {
    pub fn _z_iosli_new(capacity: usize) -> *mut _z_iosli_t;
}
unsafe extern "C" {
    pub fn _z_iosli_wrap(buf: *const u8, length: usize, r_pos: usize, w_pos: usize) -> _z_iosli_t;
}
unsafe extern "C" {
    pub fn _z_iosli_steal(ios: *mut _z_iosli_t) -> _z_iosli_t;
}
unsafe extern "C" {
    pub fn _z_iosli_to_bytes(ios: *const _z_iosli_t) -> _z_slice_t;
}
unsafe extern "C" {
    pub fn _z_iosli_clear(ios: *mut _z_iosli_t);
}
unsafe extern "C" {
    pub fn _z_iosli_free(ios: *mut *mut _z_iosli_t);
}
unsafe extern "C" {
    pub fn _z_iosli_copy(dst: *mut _z_iosli_t, src: *const _z_iosli_t);
}
unsafe extern "C" {
    pub fn _z_iosli_clone(src: *const _z_iosli_t) -> *mut _z_iosli_t;
}
pub type _z_iosli_eq_f = ::core::option::Option<
    unsafe extern "C" fn(left: *const _z_iosli_t, right: *const _z_iosli_t) -> bool,
>;
pub type _z_iosli_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(left: *const _z_iosli_t, right: *const _z_iosli_t) -> ::core::ffi::c_int,
>;
#[doc = " A dynamically allocated vector. Elements are stored by value."]
pub type _z_iosli_svec_t = _z_svec_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_zbuf_t {
    pub _ios: _z_iosli_t,
    pub _slice: _z_slice_simple_rc_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_zbuf_t"][::core::mem::size_of::<_z_zbuf_t>() - 48usize];
    ["Alignment of _z_zbuf_t"][::core::mem::align_of::<_z_zbuf_t>() - 8usize];
    ["Offset of field: _z_zbuf_t::_ios"][::core::mem::offset_of!(_z_zbuf_t, _ios) - 0usize];
    ["Offset of field: _z_zbuf_t::_slice"][::core::mem::offset_of!(_z_zbuf_t, _slice) - 40usize];
};
unsafe extern "C" {
    pub fn _z_zbuf_make(capacity: usize) -> _z_zbuf_t;
}
unsafe extern "C" {
    pub fn _z_zbuf_view(zbf: *mut _z_zbuf_t, length: usize) -> _z_zbuf_t;
}
unsafe extern "C" {
    pub fn _z_slice_as_zbuf(slice: _z_slice_t) -> _z_zbuf_t;
}
unsafe extern "C" {
    pub fn _z_zbuf_copy_bytes(dst: *mut _z_zbuf_t, src: *const _z_zbuf_t);
}
unsafe extern "C" {
    pub fn _z_zbuf_copy(dst: *mut _z_zbuf_t, src: *const _z_zbuf_t);
}
unsafe extern "C" {
    pub fn _z_zbuf_read_bytes(zbf: *mut _z_zbuf_t, dest: *mut u8, offset: usize, length: usize);
}
unsafe extern "C" {
    pub fn _z_zbuf_compact(zbf: *mut _z_zbuf_t);
}
unsafe extern "C" {
    pub fn _z_zbuf_clear(zbf: *mut _z_zbuf_t);
}
unsafe extern "C" {
    pub fn _z_zbuf_free(zbf: *mut *mut _z_zbuf_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_wbuf_t {
    pub _ioss: _z_iosli_svec_t,
    pub _r_idx: usize,
    pub _w_idx: usize,
    pub _expansion_step: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_wbuf_t"][::core::mem::size_of::<_z_wbuf_t>() - 56usize];
    ["Alignment of _z_wbuf_t"][::core::mem::align_of::<_z_wbuf_t>() - 8usize];
    ["Offset of field: _z_wbuf_t::_ioss"][::core::mem::offset_of!(_z_wbuf_t, _ioss) - 0usize];
    ["Offset of field: _z_wbuf_t::_r_idx"][::core::mem::offset_of!(_z_wbuf_t, _r_idx) - 32usize];
    ["Offset of field: _z_wbuf_t::_w_idx"][::core::mem::offset_of!(_z_wbuf_t, _w_idx) - 40usize];
    ["Offset of field: _z_wbuf_t::_expansion_step"]
        [::core::mem::offset_of!(_z_wbuf_t, _expansion_step) - 48usize];
};
unsafe extern "C" {
    pub fn _z_wbuf_make(capacity: usize, is_expandable: bool) -> _z_wbuf_t;
}
unsafe extern "C" {
    pub fn _z_wbuf_capacity(wbf: *const _z_wbuf_t) -> usize;
}
unsafe extern "C" {
    pub fn _z_wbuf_len(wbf: *const _z_wbuf_t) -> usize;
}
unsafe extern "C" {
    pub fn _z_wbuf_space_left(wbf: *const _z_wbuf_t) -> usize;
}
unsafe extern "C" {
    pub fn _z_wbuf_write(wbf: *mut _z_wbuf_t, b: u8) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_wbuf_write_bytes(
        wbf: *mut _z_wbuf_t,
        bs: *const u8,
        offset: usize,
        length: usize,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_wbuf_wrap_bytes(
        wbf: *mut _z_wbuf_t,
        bs: *const u8,
        offset: usize,
        length: usize,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_wbuf_put(wbf: *mut _z_wbuf_t, b: u8, pos: usize);
}
unsafe extern "C" {
    pub fn _z_wbuf_get_rpos(wbf: *const _z_wbuf_t) -> usize;
}
unsafe extern "C" {
    pub fn _z_wbuf_get_wpos(wbf: *const _z_wbuf_t) -> usize;
}
unsafe extern "C" {
    pub fn _z_wbuf_set_rpos(wbf: *mut _z_wbuf_t, r_pos: usize);
}
unsafe extern "C" {
    pub fn _z_wbuf_set_wpos(wbf: *mut _z_wbuf_t, w_pos: usize);
}
unsafe extern "C" {
    pub fn _z_wbuf_len_iosli(wbf: *const _z_wbuf_t) -> usize;
}
unsafe extern "C" {
    pub fn _z_wbuf_to_zbuf(wbf: *const _z_wbuf_t) -> _z_zbuf_t;
}
unsafe extern "C" {
    pub fn _z_wbuf_moved_as_zbuf(wbf: *mut _z_wbuf_t) -> _z_zbuf_t;
}
unsafe extern "C" {
    pub fn _z_wbuf_siphon(dst: *mut _z_wbuf_t, src: *mut _z_wbuf_t, length: usize) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_wbuf_copy(dst: *mut _z_wbuf_t, src: *const _z_wbuf_t);
}
unsafe extern "C" {
    pub fn _z_wbuf_reset(wbf: *mut _z_wbuf_t);
}
unsafe extern "C" {
    pub fn _z_wbuf_clear(wbf: *mut _z_wbuf_t);
}
unsafe extern "C" {
    pub fn _z_wbuf_free(wbf: *mut *mut _z_wbuf_t);
}
pub type _z_arc_slice_eq_f = ::core::option::Option<
    unsafe extern "C" fn(left: *const _z_arc_slice_t, right: *const _z_arc_slice_t) -> bool,
>;
pub type _z_arc_slice_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_arc_slice_t,
        right: *const _z_arc_slice_t,
    ) -> ::core::ffi::c_int,
>;
#[doc = " A dynamically allocated vector. Elements are stored by value."]
pub type _z_arc_slice_svec_t = _z_svec_t;
#[doc = " A container for slices.\n\n Members:\n   _z_slice_vec_t _slices: contents of the container."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_bytes_t {
    pub _slices: _z_arc_slice_svec_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_bytes_t"][::core::mem::size_of::<_z_bytes_t>() - 32usize];
    ["Alignment of _z_bytes_t"][::core::mem::align_of::<_z_bytes_t>() - 8usize];
    ["Offset of field: _z_bytes_t::_slices"][::core::mem::offset_of!(_z_bytes_t, _slices) - 0usize];
};
unsafe extern "C" {
    pub fn _z_bytes_check(bytes: *const _z_bytes_t) -> bool;
}
unsafe extern "C" {
    pub fn _z_bytes_append_bytes(dst: *mut _z_bytes_t, src: *mut _z_bytes_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_bytes_append_slice(dst: *mut _z_bytes_t, s: *mut _z_arc_slice_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_bytes_copy(dst: *mut _z_bytes_t, src: *const _z_bytes_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_bytes_duplicate(src: *const _z_bytes_t) -> _z_bytes_t;
}
unsafe extern "C" {
    pub fn _z_bytes_move(dst: *mut _z_bytes_t, src: *mut _z_bytes_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_bytes_free(bs: *mut *mut _z_bytes_t);
}
unsafe extern "C" {
    pub fn _z_bytes_len(bs: *const _z_bytes_t) -> usize;
}
unsafe extern "C" {
    pub fn _z_bytes_is_empty(bs: *const _z_bytes_t) -> bool;
}
unsafe extern "C" {
    pub fn _z_bytes_to_slice(bytes: *const _z_bytes_t, s: *mut _z_slice_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_bytes_from_slice(b: *mut _z_bytes_t, s: *mut _z_slice_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_bytes_to_buf(bytes: *const _z_bytes_t, dst: *mut u8, len: usize) -> usize;
}
unsafe extern "C" {
    pub fn _z_bytes_from_buf(b: *mut _z_bytes_t, src: *const u8, len: usize) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_bytes_try_get_contiguous(bs: *const _z_bytes_t) -> _z_slice_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_bytes_reader_t {
    pub slice_idx: usize,
    pub in_slice_idx: usize,
    pub byte_idx: usize,
    pub bytes: *const _z_bytes_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_bytes_reader_t"][::core::mem::size_of::<_z_bytes_reader_t>() - 32usize];
    ["Alignment of _z_bytes_reader_t"][::core::mem::align_of::<_z_bytes_reader_t>() - 8usize];
    ["Offset of field: _z_bytes_reader_t::slice_idx"]
        [::core::mem::offset_of!(_z_bytes_reader_t, slice_idx) - 0usize];
    ["Offset of field: _z_bytes_reader_t::in_slice_idx"]
        [::core::mem::offset_of!(_z_bytes_reader_t, in_slice_idx) - 8usize];
    ["Offset of field: _z_bytes_reader_t::byte_idx"]
        [::core::mem::offset_of!(_z_bytes_reader_t, byte_idx) - 16usize];
    ["Offset of field: _z_bytes_reader_t::bytes"]
        [::core::mem::offset_of!(_z_bytes_reader_t, bytes) - 24usize];
};
unsafe extern "C" {
    pub fn _z_bytes_get_reader(bytes: *const _z_bytes_t) -> _z_bytes_reader_t;
}
unsafe extern "C" {
    pub fn _z_bytes_reader_seek(
        reader: *mut _z_bytes_reader_t,
        offset: i64,
        origin: ::core::ffi::c_int,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_bytes_reader_tell(reader: *const _z_bytes_reader_t) -> i64;
}
unsafe extern "C" {
    pub fn _z_bytes_reader_read_slices(
        reader: *mut _z_bytes_reader_t,
        len: usize,
        out: *mut _z_bytes_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_bytes_reader_read(reader: *mut _z_bytes_reader_t, buf: *mut u8, len: usize) -> usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_bytes_writer_t {
    pub cache: *mut _z_arc_slice_t,
    pub bytes: _z_bytes_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_bytes_writer_t"][::core::mem::size_of::<_z_bytes_writer_t>() - 40usize];
    ["Alignment of _z_bytes_writer_t"][::core::mem::align_of::<_z_bytes_writer_t>() - 8usize];
    ["Offset of field: _z_bytes_writer_t::cache"]
        [::core::mem::offset_of!(_z_bytes_writer_t, cache) - 0usize];
    ["Offset of field: _z_bytes_writer_t::bytes"]
        [::core::mem::offset_of!(_z_bytes_writer_t, bytes) - 8usize];
};
unsafe extern "C" {
    pub fn _z_bytes_writer_is_empty(writer: *const _z_bytes_writer_t) -> bool;
}
unsafe extern "C" {
    pub fn _z_bytes_writer_check(writer: *const _z_bytes_writer_t) -> bool;
}
unsafe extern "C" {
    pub fn _z_bytes_writer_from_bytes(bytes: *mut _z_bytes_t) -> _z_bytes_writer_t;
}
unsafe extern "C" {
    pub fn _z_bytes_writer_empty() -> _z_bytes_writer_t;
}
unsafe extern "C" {
    pub fn _z_bytes_writer_write_all(
        writer: *mut _z_bytes_writer_t,
        src: *const u8,
        len: usize,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_bytes_writer_append_z_bytes(
        writer: *mut _z_bytes_writer_t,
        bytes: *mut _z_bytes_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_bytes_writer_append_slice(
        writer: *mut _z_bytes_writer_t,
        bytes: *mut _z_arc_slice_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_bytes_writer_finish(writer: *mut _z_bytes_writer_t) -> _z_bytes_t;
}
unsafe extern "C" {
    pub fn _z_bytes_writer_clear(writer: *mut _z_bytes_writer_t);
}
unsafe extern "C" {
    pub fn _z_bytes_writer_move(
        dst: *mut _z_bytes_writer_t,
        src: *mut _z_bytes_writer_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_bytes_reader_remaining(reader: *const _z_bytes_reader_t) -> usize;
}
#[doc = " A single-linked list. Elements are stored as pointers.\n\n  Members:\n   void *lal: The pointer to the inner value.\n   struct z_list *tail: A pointer to the next element in the list."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_l_t {
    pub _val: *mut ::core::ffi::c_void,
    pub _next: *mut _z_l_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_l_t"][::core::mem::size_of::<_z_l_t>() - 16usize];
    ["Alignment of _z_l_t"][::core::mem::align_of::<_z_l_t>() - 8usize];
    ["Offset of field: _z_l_t::_val"][::core::mem::offset_of!(_z_l_t, _val) - 0usize];
    ["Offset of field: _z_l_t::_next"][::core::mem::offset_of!(_z_l_t, _next) - 8usize];
};
#[doc = " A single-linked list. Elements are stored as pointers.\n\n  Members:\n   void *lal: The pointer to the inner value.\n   struct z_list *tail: A pointer to the next element in the list."]
pub type _z_list_t = _z_l_t;
unsafe extern "C" {
    pub fn _z_list_len(xs: *const _z_list_t) -> usize;
}
unsafe extern "C" {
    pub fn _z_list_push(xs: *mut _z_list_t, x: *mut ::core::ffi::c_void) -> *mut _z_list_t;
}
unsafe extern "C" {
    pub fn _z_list_push_after(xs: *mut _z_list_t, x: *mut ::core::ffi::c_void) -> *mut _z_list_t;
}
unsafe extern "C" {
    pub fn _z_list_push_back(xs: *mut _z_list_t, x: *mut ::core::ffi::c_void) -> *mut _z_list_t;
}
unsafe extern "C" {
    pub fn _z_list_push_sorted(
        xs: *mut _z_list_t,
        c_f: z_element_cmp_f,
        x: *mut ::core::ffi::c_void,
    ) -> *mut _z_list_t;
}
unsafe extern "C" {
    pub fn _z_list_pop(
        xs: *mut _z_list_t,
        f_f: z_element_free_f,
        x: *mut *mut ::core::ffi::c_void,
    ) -> *mut _z_list_t;
}
unsafe extern "C" {
    pub fn _z_list_find(
        xs: *const _z_list_t,
        f_f: z_element_eq_f,
        e: *const ::core::ffi::c_void,
    ) -> *mut _z_list_t;
}
unsafe extern "C" {
    pub fn _z_list_drop_element(
        list: *mut _z_list_t,
        prev: *mut _z_list_t,
        f_f: z_element_free_f,
    ) -> *mut _z_list_t;
}
unsafe extern "C" {
    pub fn _z_list_drop_filter(
        xs: *mut _z_list_t,
        f_f: z_element_free_f,
        c_f: z_element_eq_f,
        left: *const ::core::ffi::c_void,
    ) -> *mut _z_list_t;
}
unsafe extern "C" {
    pub fn _z_list_clone(xs: *const _z_list_t, d_f: z_element_clone_f) -> *mut _z_list_t;
}
unsafe extern "C" {
    pub fn _z_list_free(xs: *mut *mut _z_list_t, f_f: z_element_free_f);
}
pub type _z_slist_t = ::core::ffi::c_void;
unsafe extern "C" {
    pub fn _z_slist_push_empty(node: *mut _z_slist_t, value_size: usize) -> *mut _z_slist_t;
}
unsafe extern "C" {
    pub fn _z_slist_push(
        node: *mut _z_slist_t,
        value: *const ::core::ffi::c_void,
        value_size: usize,
        d_f: z_element_copy_f,
        use_elem_f: bool,
    ) -> *mut _z_slist_t;
}
unsafe extern "C" {
    pub fn _z_slist_push_back(
        node: *mut _z_slist_t,
        value: *const ::core::ffi::c_void,
        value_size: usize,
        d_f: z_element_copy_f,
        use_elem_f: bool,
    ) -> *mut _z_slist_t;
}
unsafe extern "C" {
    pub fn _z_slist_value(node: *const _z_slist_t) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn _z_slist_next(node: *const _z_slist_t) -> *mut _z_slist_t;
}
unsafe extern "C" {
    pub fn _z_slist_len(node: *const _z_slist_t) -> usize;
}
unsafe extern "C" {
    pub fn _z_slist_pop(node: *mut _z_slist_t, f_f: z_element_clear_f) -> *mut _z_slist_t;
}
unsafe extern "C" {
    pub fn _z_slist_find(
        node: *const _z_slist_t,
        c_f: z_element_eq_f,
        target_val: *const ::core::ffi::c_void,
    ) -> *mut _z_slist_t;
}
unsafe extern "C" {
    pub fn _z_slist_drop_element(
        list: *mut _z_slist_t,
        prev: *mut _z_slist_t,
        f_f: z_element_clear_f,
    ) -> *mut _z_slist_t;
}
unsafe extern "C" {
    pub fn _z_slist_drop_filter(
        head: *mut _z_slist_t,
        f_f: z_element_clear_f,
        c_f: z_element_eq_f,
        target_val: *const ::core::ffi::c_void,
    ) -> *mut _z_slist_t;
}
unsafe extern "C" {
    pub fn _z_slist_clone(
        node: *const _z_slist_t,
        value_size: usize,
        d_f: z_element_copy_f,
        use_elem_f: bool,
    ) -> *mut _z_slist_t;
}
unsafe extern "C" {
    pub fn _z_slist_free(node: *mut *mut _z_slist_t, f: z_element_clear_f);
}
#[doc = " A hashmap entry with generic keys.\n\n Members:\n   void *_key: the key of the entry\n   void *_val: the value of the entry"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_hashmap_entry_t {
    pub _key: *mut ::core::ffi::c_void,
    pub _val: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_hashmap_entry_t"][::core::mem::size_of::<_z_hashmap_entry_t>() - 16usize];
    ["Alignment of _z_hashmap_entry_t"][::core::mem::align_of::<_z_hashmap_entry_t>() - 8usize];
    ["Offset of field: _z_hashmap_entry_t::_key"]
        [::core::mem::offset_of!(_z_hashmap_entry_t, _key) - 0usize];
    ["Offset of field: _z_hashmap_entry_t::_val"]
        [::core::mem::offset_of!(_z_hashmap_entry_t, _val) - 8usize];
};
#[doc = " A hashmap with generic keys.\n\n Members:\n    size_t _capacity: the number of buckets available in the hashmap\n   _z_list_t **_vals: the linked list containing the values\n   z_element_hash_f _f_hash: the hash function used to hash keys\n   z_element_eq_f _f_equals: the function used to compare keys for equality"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_hashmap_t {
    pub _capacity: usize,
    pub _vals: *mut *mut _z_list_t,
    pub _f_hash: z_element_hash_f,
    pub _f_equals: z_element_eq_f,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_hashmap_t"][::core::mem::size_of::<_z_hashmap_t>() - 32usize];
    ["Alignment of _z_hashmap_t"][::core::mem::align_of::<_z_hashmap_t>() - 8usize];
    ["Offset of field: _z_hashmap_t::_capacity"]
        [::core::mem::offset_of!(_z_hashmap_t, _capacity) - 0usize];
    ["Offset of field: _z_hashmap_t::_vals"][::core::mem::offset_of!(_z_hashmap_t, _vals) - 8usize];
    ["Offset of field: _z_hashmap_t::_f_hash"]
        [::core::mem::offset_of!(_z_hashmap_t, _f_hash) - 16usize];
    ["Offset of field: _z_hashmap_t::_f_equals"]
        [::core::mem::offset_of!(_z_hashmap_t, _f_equals) - 24usize];
};
#[doc = " Iterator for a generic key-value hashmap."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_hashmap_iterator_t {
    pub _entry: *mut _z_hashmap_entry_t,
    pub _map: *const _z_hashmap_t,
    pub _idx: usize,
    pub _list_ptr: *mut _z_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_hashmap_iterator_t"][::core::mem::size_of::<_z_hashmap_iterator_t>() - 32usize];
    ["Alignment of _z_hashmap_iterator_t"]
        [::core::mem::align_of::<_z_hashmap_iterator_t>() - 8usize];
    ["Offset of field: _z_hashmap_iterator_t::_entry"]
        [::core::mem::offset_of!(_z_hashmap_iterator_t, _entry) - 0usize];
    ["Offset of field: _z_hashmap_iterator_t::_map"]
        [::core::mem::offset_of!(_z_hashmap_iterator_t, _map) - 8usize];
    ["Offset of field: _z_hashmap_iterator_t::_idx"]
        [::core::mem::offset_of!(_z_hashmap_iterator_t, _idx) - 16usize];
    ["Offset of field: _z_hashmap_iterator_t::_list_ptr"]
        [::core::mem::offset_of!(_z_hashmap_iterator_t, _list_ptr) - 24usize];
};
unsafe extern "C" {
    pub fn _z_hashmap_init(
        map: *mut _z_hashmap_t,
        capacity: usize,
        f_hash: z_element_hash_f,
        f_equals: z_element_eq_f,
    );
}
unsafe extern "C" {
    pub fn _z_hashmap_make(
        capacity: usize,
        f_hash: z_element_hash_f,
        f_equals: z_element_eq_f,
    ) -> _z_hashmap_t;
}
unsafe extern "C" {
    pub fn _z_hashmap_insert(
        map: *mut _z_hashmap_t,
        key: *mut ::core::ffi::c_void,
        val: *mut ::core::ffi::c_void,
        f: z_element_free_f,
        replace: bool,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn _z_hashmap_get(
        map: *const _z_hashmap_t,
        key: *const ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn _z_hashmap_get_all(
        map: *const _z_hashmap_t,
        key: *const ::core::ffi::c_void,
    ) -> *mut _z_list_t;
}
unsafe extern "C" {
    pub fn _z_hashmap_remove(
        map: *mut _z_hashmap_t,
        key: *const ::core::ffi::c_void,
        f: z_element_free_f,
    );
}
unsafe extern "C" {
    pub fn _z_hashmap_capacity(map: *const _z_hashmap_t) -> usize;
}
unsafe extern "C" {
    pub fn _z_hashmap_len(map: *const _z_hashmap_t) -> usize;
}
unsafe extern "C" {
    pub fn _z_hashmap_is_empty(map: *const _z_hashmap_t) -> bool;
}
unsafe extern "C" {
    pub fn _z_hashmap_copy(
        dst: *mut _z_hashmap_t,
        src: *const _z_hashmap_t,
        f_c: z_element_clone_f,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_hashmap_clone(
        src: *const _z_hashmap_t,
        f_c: z_element_clone_f,
        f_f: z_element_free_f,
    ) -> _z_hashmap_t;
}
unsafe extern "C" {
    pub fn _z_hashmap_clear(map: *mut _z_hashmap_t, f: z_element_free_f);
}
unsafe extern "C" {
    pub fn _z_hashmap_free(map: *mut *mut _z_hashmap_t, f: z_element_free_f);
}
unsafe extern "C" {
    pub fn _z_hashmap_iterator_make(map: *const _z_hashmap_t) -> _z_hashmap_iterator_t;
}
unsafe extern "C" {
    pub fn _z_hashmap_iterator_next(iter: *mut _z_hashmap_iterator_t) -> bool;
}
unsafe extern "C" {
    pub fn _z_hashmap_iterator_key(iter: *const _z_hashmap_iterator_t) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn _z_hashmap_iterator_value(
        iter: *const _z_hashmap_iterator_t,
    ) -> *mut ::core::ffi::c_void;
}
#[doc = " A hashmap with generic keys.\n\n Members:\n    size_t _capacity: the number of buckets available in the hashmap\n   _z_list_t **_vals: the linked list containing the values\n   z_element_hash_f _f_hash: the hash function used to hash keys\n   z_element_eq_f _f_equals: the function used to compare keys for equality"]
pub type _z_int_void_map_t = _z_hashmap_t;
#[doc = " A hashmap entry with generic keys.\n\n Members:\n   void *_key: the key of the entry\n   void *_val: the value of the entry"]
pub type _z_int_void_map_entry_t = _z_hashmap_entry_t;
#[doc = " Iterator for a generic key-value hashmap."]
pub type _z_int_void_map_iterator_t = _z_hashmap_iterator_t;
pub type _z_str_t = *mut ::core::ffi::c_char;
unsafe extern "C" {
    pub fn _z_str_clone(src: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn _z_str_n_clone(src: *const ::core::ffi::c_char, len: usize) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn _z_str_clear(src: *mut ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn _z_str_free(src: *mut *mut ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn _z_str_eq(left: *const ::core::ffi::c_char, right: *const ::core::ffi::c_char) -> bool;
}
unsafe extern "C" {
    pub fn _z_str_cmp(
        left: *const ::core::ffi::c_char,
        right: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _z_str_size(src: *const ::core::ffi::c_char) -> usize;
}
unsafe extern "C" {
    pub fn _z_str_copy(dst: *mut ::core::ffi::c_char, src: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn _z_str_n_copy(
        dst: *mut ::core::ffi::c_char,
        src: *const ::core::ffi::c_char,
        size: usize,
    );
}
pub type _z_str_eq_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const ::core::ffi::c_char,
        right: *const ::core::ffi::c_char,
    ) -> bool,
>;
pub type _z_str_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const ::core::ffi::c_char,
        right: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int,
>;
#[doc = " A dynamically allocated vector. Elements are stored as pointers."]
pub type _z_str_vec_t = _z_vec_t;
#[doc = " A single-linked list. Elements are stored as pointers.\n\n  Members:\n   void *lal: The pointer to the inner value.\n   struct z_list *tail: A pointer to the next element in the list."]
pub type _z_str_list_t = _z_list_t;
#[doc = " A hashmap entry with generic keys.\n\n Members:\n   void *_key: the key of the entry\n   void *_val: the value of the entry"]
pub type _z_str_intmap_entry_t = _z_int_void_map_entry_t;
#[doc = " A hashmap with generic keys.\n\n Members:\n    size_t _capacity: the number of buckets available in the hashmap\n   _z_list_t **_vals: the linked list containing the values\n   z_element_hash_f _f_hash: the hash function used to hash keys\n   z_element_eq_f _f_equals: the function used to compare keys for equality"]
pub type _z_str_intmap_t = _z_int_void_map_t;
#[doc = " Iterator for a generic key-value hashmap."]
pub type _z_str_intmap_iterator_t = _z_int_void_map_iterator_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_str_intmapping_t {
    pub _str: *mut ::core::ffi::c_char,
    pub _key: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_str_intmapping_t"][::core::mem::size_of::<_z_str_intmapping_t>() - 16usize];
    ["Alignment of _z_str_intmapping_t"][::core::mem::align_of::<_z_str_intmapping_t>() - 8usize];
    ["Offset of field: _z_str_intmapping_t::_str"]
        [::core::mem::offset_of!(_z_str_intmapping_t, _str) - 0usize];
    ["Offset of field: _z_str_intmapping_t::_key"]
        [::core::mem::offset_of!(_z_str_intmapping_t, _key) - 8usize];
};
unsafe extern "C" {
    pub fn _z_str_intmap_strlen(
        s: *const _z_str_intmap_t,
        argc: u8,
        argv: *mut _z_str_intmapping_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _z_str_intmap_onto_str(
        dst: *mut ::core::ffi::c_char,
        dst_len: usize,
        s: *const _z_str_intmap_t,
        argc: u8,
        argv: *mut _z_str_intmapping_t,
    );
}
unsafe extern "C" {
    pub fn _z_str_intmap_to_str(
        s: *const _z_str_intmap_t,
        argc: u8,
        argv: *mut _z_str_intmapping_t,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn _z_str_intmap_from_str(
        strint: *mut _z_str_intmap_t,
        s: *const ::core::ffi::c_char,
        argc: u8,
        argv: *mut _z_str_intmapping_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_str_intmap_from_strn(
        strint: *mut _z_str_intmap_t,
        s: *const ::core::ffi::c_char,
        argc: u8,
        argv: *mut _z_str_intmapping_t,
        n: usize,
    ) -> z_result_t;
}
#[doc = " A string with no terminator.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_string_t {
    pub _slice: _z_slice_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_string_t"][::core::mem::size_of::<_z_string_t>() - 32usize];
    ["Alignment of _z_string_t"][::core::mem::align_of::<_z_string_t>() - 8usize];
    ["Offset of field: _z_string_t::_slice"][::core::mem::offset_of!(_z_string_t, _slice) - 0usize];
};
unsafe extern "C" {
    pub fn _z_string_copy_from_str(value: *const ::core::ffi::c_char) -> _z_string_t;
}
unsafe extern "C" {
    pub fn _z_string_copy_from_substr(value: *const ::core::ffi::c_char, len: usize)
    -> _z_string_t;
}
unsafe extern "C" {
    pub fn _z_string_copy_from_str_as_ptr(value: *const ::core::ffi::c_char) -> *mut _z_string_t;
}
unsafe extern "C" {
    pub fn _z_string_rchr(
        str_: *mut _z_string_t,
        filter: ::core::ffi::c_char,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn _z_string_pbrk(
        str_: *mut _z_string_t,
        filter: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn _z_string_copy(dst: *mut _z_string_t, src: *const _z_string_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_string_copy_substring(
        dst: *mut _z_string_t,
        src: *const _z_string_t,
        offset: usize,
        len: usize,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_string_move(dst: *mut _z_string_t, src: *mut _z_string_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_string_steal(str_: *mut _z_string_t) -> _z_string_t;
}
unsafe extern "C" {
    pub fn _z_string_move_str(dst: *mut _z_string_t, src: *mut ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn _z_string_free(s: *mut *mut _z_string_t);
}
unsafe extern "C" {
    pub fn _z_string_compare(
        left: *const _z_string_t,
        right: *const _z_string_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _z_string_equals(left: *const _z_string_t, right: *const _z_string_t) -> bool;
}
unsafe extern "C" {
    pub fn _z_string_convert_bytes_le(bs: *const _z_slice_t) -> _z_string_t;
}
unsafe extern "C" {
    pub fn _z_string_preallocate(len: usize) -> _z_string_t;
}
unsafe extern "C" {
    pub fn _z_str_from_string_clone(str_: *const _z_string_t) -> *mut ::core::ffi::c_char;
}
pub type _z_string_eq_f = ::core::option::Option<
    unsafe extern "C" fn(left: *const _z_string_t, right: *const _z_string_t) -> bool,
>;
pub type _z_string_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(left: *const _z_string_t, right: *const _z_string_t) -> ::core::ffi::c_int,
>;
#[doc = " A dynamically allocated vector. Elements are stored by value."]
pub type _z_string_svec_t = _z_svec_t;
#[doc = " A single-linked list. Elements are stored as pointers.\n\n  Members:\n   void *lal: The pointer to the inner value.\n   struct z_list *tail: A pointer to the next element in the list."]
pub type _z_string_list_t = _z_list_t;
#[doc = " A hashmap entry with generic keys.\n\n Members:\n   void *_key: the key of the entry\n   void *_val: the value of the entry"]
pub type _z_string_intmap_entry_t = _z_int_void_map_entry_t;
#[doc = " A hashmap with generic keys.\n\n Members:\n    size_t _capacity: the number of buckets available in the hashmap\n   _z_list_t **_vals: the linked list containing the values\n   z_element_hash_f _f_hash: the hash function used to hash keys\n   z_element_eq_f _f_equals: the function used to compare keys for equality"]
pub type _z_string_intmap_t = _z_int_void_map_t;
#[doc = " Iterator for a generic key-value hashmap."]
pub type _z_string_intmap_iterator_t = _z_int_void_map_iterator_t;
pub const z_what_t_Z_WHAT_ROUTER: z_what_t = 1;
pub const z_what_t_Z_WHAT_PEER: z_what_t = 2;
pub const z_what_t_Z_WHAT_CLIENT: z_what_t = 4;
pub const z_what_t_Z_WHAT_ROUTER_PEER: z_what_t = 3;
pub const z_what_t_Z_WHAT_ROUTER_CLIENT: z_what_t = 5;
pub const z_what_t_Z_WHAT_PEER_CLIENT: z_what_t = 6;
pub const z_what_t_Z_WHAT_ROUTER_PEER_CLIENT: z_what_t = 7;
#[doc = " What bitmask for scouting.\n\n Enumerators:\n   Z_WHAT_ROUTER: Router.\n   Z_WHAT_PEER: Peer.\n   Z_WHAT_CLIENT: Client."]
pub type z_what_t = ::core::ffi::c_uint;
pub const z_whatami_t_Z_WHATAMI_ROUTER: z_whatami_t = 1;
pub const z_whatami_t_Z_WHATAMI_PEER: z_whatami_t = 2;
pub const z_whatami_t_Z_WHATAMI_CLIENT: z_whatami_t = 4;
#[doc = " Whatami values, defined as a bitmask.\n\n Enumerators:\n   Z_WHATAMI_ROUTER: Bitmask to filter Zenoh routers.\n   Z_WHATAMI_PEER: Bitmask to filter for Zenoh peers.\n   Z_WHATAMI_CLIENT: Bitmask to filter for Zenoh clients."]
pub type z_whatami_t = ::core::ffi::c_uint;
pub const zp_keyexpr_canon_status_t_Z_KEYEXPR_CANON_SUCCESS: zp_keyexpr_canon_status_t = 0;
pub const zp_keyexpr_canon_status_t_Z_KEYEXPR_CANON_LONE_DOLLAR_STAR: zp_keyexpr_canon_status_t =
    -1;
pub const zp_keyexpr_canon_status_t_Z_KEYEXPR_CANON_SINGLE_STAR_AFTER_DOUBLE_STAR:
    zp_keyexpr_canon_status_t = -2;
pub const zp_keyexpr_canon_status_t_Z_KEYEXPR_CANON_DOUBLE_STAR_AFTER_DOUBLE_STAR:
    zp_keyexpr_canon_status_t = -3;
pub const zp_keyexpr_canon_status_t_Z_KEYEXPR_CANON_EMPTY_CHUNK: zp_keyexpr_canon_status_t = -4;
pub const zp_keyexpr_canon_status_t_Z_KEYEXPR_CANON_STARS_IN_CHUNK: zp_keyexpr_canon_status_t = -5;
pub const zp_keyexpr_canon_status_t_Z_KEYEXPR_CANON_DOLLAR_AFTER_DOLLAR_OR_STAR:
    zp_keyexpr_canon_status_t = -6;
pub const zp_keyexpr_canon_status_t_Z_KEYEXPR_CANON_CONTAINS_SHARP_OR_QMARK:
    zp_keyexpr_canon_status_t = -7;
pub const zp_keyexpr_canon_status_t_Z_KEYEXPR_CANON_CONTAINS_UNBOUND_DOLLAR:
    zp_keyexpr_canon_status_t = -8;
#[doc = " Status values for keyexpr canonization operation.\n Used as return value of canonization-related functions,\n like :c:func:`z_keyexpr_is_canon` or :c:func:`z_keyexpr_canonize`.\n\n Enumerators:\n   Z_KEYEXPR_CANON_SUCCESS: The key expression is canon.\n   Z_KEYEXPR_CANON_LONE_DOLLAR_STAR: The key contains a ``$*`` chunk, which must be replaced by ``*``.\n   Z_KEYEXPR_CANON_SINGLE_STAR_AFTER_DOUBLE_STAR: The key contains ``** / *``, which must be replaced by ``* / **``.\n   Z_KEYEXPR_CANON_DOUBLE_STAR_AFTER_DOUBLE_STAR: The key contains ``** / **``, which must be replaced by ``**``.\n   Z_KEYEXPR_CANON_EMPTY_CHUNK: The key contains empty chunks.\n   Z_KEYEXPR_CANON_STARS_IN_CHUNK: The key contains a ``*`` in a chunk without being escaped by a DSL, which is\n     forbidden.\n   Z_KEYEXPR_CANON_DOLLAR_AFTER_DOLLAR_OR_STAR: The key contains ``$*$`` or ``$$``, which is forbidden.\n   Z_KEYEXPR_CANON_CONTAINS_SHARP_OR_QMARK: The key contains ``#`` or ``?``, which is forbidden.\n   Z_KEYEXPR_CANON_CONTAINS_UNBOUND_DOLLAR: The key contains a ``$`` which is not bound to a DSL."]
pub type zp_keyexpr_canon_status_t = ::core::ffi::c_int;
pub const z_keyexpr_intersection_level_t_Z_KEYEXPR_INTERSECTION_LEVEL_DISJOINT:
    z_keyexpr_intersection_level_t = 0;
pub const z_keyexpr_intersection_level_t_Z_KEYEXPR_INTERSECTION_LEVEL_INTERSECTS:
    z_keyexpr_intersection_level_t = 1;
pub const z_keyexpr_intersection_level_t_Z_KEYEXPR_INTERSECTION_LEVEL_INCLUDES:
    z_keyexpr_intersection_level_t = 2;
pub const z_keyexpr_intersection_level_t_Z_KEYEXPR_INTERSECTION_LEVEL_EQUALS:
    z_keyexpr_intersection_level_t = 3;
#[doc = " Intersection level of two key expressions.\n\n Enumerators:\n   Z_KEYEXPR_INTERSECTION_LEVEL_DISJOINT: The two key expressions do not intersect.\n   Z_KEYEXPR_INTERSECTION_LEVEL_INTERSECTS: The two key expressions intersect, i.e. there exists at least one key\n     expression that is included by both.\n   Z_KEYEXPR_INTERSECTION_LEVEL_INCLUDES: The first key expression is the superset of the second one.\n   Z_KEYEXPR_INTERSECTION_LEVEL_EQUALS: The two key expressions are equal."]
pub type z_keyexpr_intersection_level_t = ::core::ffi::c_uint;
pub const z_sample_kind_t_Z_SAMPLE_KIND_PUT: z_sample_kind_t = 0;
pub const z_sample_kind_t_Z_SAMPLE_KIND_DELETE: z_sample_kind_t = 1;
#[doc = " Sample kind values.\n\n Enumerators:\n   Z_SAMPLE_KIND_PUT: The Sample was issued by a ``put`` operation.\n   Z_SAMPLE_KIND_DELETE: The Sample was issued by a ``delete`` operation."]
pub type z_sample_kind_t = ::core::ffi::c_uint;
pub const z_consolidation_mode_t_Z_CONSOLIDATION_MODE_AUTO: z_consolidation_mode_t = -1;
pub const z_consolidation_mode_t_Z_CONSOLIDATION_MODE_NONE: z_consolidation_mode_t = 0;
pub const z_consolidation_mode_t_Z_CONSOLIDATION_MODE_MONOTONIC: z_consolidation_mode_t = 1;
pub const z_consolidation_mode_t_Z_CONSOLIDATION_MODE_LATEST: z_consolidation_mode_t = 2;
#[doc = " Consolidation mode values.\n\n Enumerators:\n   Z_CONSOLIDATION_MODE_AUTO: Let Zenoh decide the best consolidation mode depending on the query selector.\n   Z_CONSOLIDATION_MODE_NONE: No consolidation is applied. Replies may come in any order and any number.\n   Z_CONSOLIDATION_MODE_MONOTONIC: It guarantees that any reply for a given key expression will be monotonic in time\n     w.r.t. the previous received replies for the same key expression. I.e., for the same key expression multiple\n     replies may be received. It is guaranteed that two replies received at t1 and t2 will have timestamp\n     ts2 > ts1. It optimizes latency.\n   Z_CONSOLIDATION_MODE_LATEST: It guarantees unicity of replies for the same key expression.\n     It optimizes bandwidth."]
pub type z_consolidation_mode_t = ::core::ffi::c_int;
pub const z_reliability_t_Z_RELIABILITY_BEST_EFFORT: z_reliability_t = 1;
pub const z_reliability_t_Z_RELIABILITY_RELIABLE: z_reliability_t = 0;
#[doc = " Reliability values.\n\n Enumerators:\n   Z_RELIABILITY_BEST_EFFORT: Defines reliability as ``BEST_EFFORT``\n   Z_RELIABILITY_RELIABLE: Defines reliability as ``RELIABLE``\n\n .. warning:: This API has been marked as unstable: it works as advertised, but it may be changed in a future release."]
pub type z_reliability_t = ::core::ffi::c_uint;
pub const z_congestion_control_t_Z_CONGESTION_CONTROL_BLOCK: z_congestion_control_t = 1;
pub const z_congestion_control_t_Z_CONGESTION_CONTROL_DROP: z_congestion_control_t = 0;
#[doc = " Congestion control values.\n\n Enumerators:\n   Z_CONGESTION_CONTROL_BLOCK: Defines congestion control as ``BLOCK``. Messages are not dropped in case of\n     congestion control.\n   Z_CONGESTION_CONTROL_DROP: Defines congestion control as ``DROP``. Messages are dropped in case\n     of congestion control."]
pub type z_congestion_control_t = ::core::ffi::c_uint;
pub const z_priority_t__Z_PRIORITY_CONTROL: z_priority_t = 0;
pub const z_priority_t_Z_PRIORITY_REAL_TIME: z_priority_t = 1;
pub const z_priority_t_Z_PRIORITY_INTERACTIVE_HIGH: z_priority_t = 2;
pub const z_priority_t_Z_PRIORITY_INTERACTIVE_LOW: z_priority_t = 3;
pub const z_priority_t_Z_PRIORITY_DATA_HIGH: z_priority_t = 4;
pub const z_priority_t_Z_PRIORITY_DATA: z_priority_t = 5;
pub const z_priority_t_Z_PRIORITY_DATA_LOW: z_priority_t = 6;
pub const z_priority_t_Z_PRIORITY_BACKGROUND: z_priority_t = 7;
#[doc = " Priority of Zenoh messages values.\n\n Enumerators:\n   _Z_PRIORITY_CONTROL: Priority for ``Control`` messages.\n   Z_PRIORITY_REAL_TIME: Priority for ``RealTime`` messages.\n   Z_PRIORITY_INTERACTIVE_HIGH: Highest priority for ``Interactive`` messages.\n   Z_PRIORITY_INTERACTIVE_LOW: Lowest priority for ``Interactive`` messages.\n   Z_PRIORITY_DATA_HIGH: Highest priority for ``Data`` messages.\n   Z_PRIORITY_DATA: Default priority for ``Data`` messages.\n   Z_PRIORITY_DATA_LOW: Lowest priority for ``Data`` messages.\n   Z_PRIORITY_BACKGROUND: Priority for ``Background traffic`` messages."]
pub type z_priority_t = ::core::ffi::c_uint;
pub const z_query_target_t_Z_QUERY_TARGET_BEST_MATCHING: z_query_target_t = 0;
pub const z_query_target_t_Z_QUERY_TARGET_ALL: z_query_target_t = 1;
pub const z_query_target_t_Z_QUERY_TARGET_ALL_COMPLETE: z_query_target_t = 2;
#[doc = " Query target values.\n\n Enumerators:\n   Z_QUERY_TARGET_BEST_MATCHING: The nearest complete queryable if any else all matching queryables.\n   Z_QUERY_TARGET_ALL: All matching queryables.\n   Z_QUERY_TARGET_ALL_COMPLETE: A set of complete queryables."]
pub type z_query_target_t = ::core::ffi::c_uint;
#[doc = " A zenoh encoding."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_encoding_t {
    pub schema: _z_string_t,
    pub id: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_encoding_t"][::core::mem::size_of::<_z_encoding_t>() - 40usize];
    ["Alignment of _z_encoding_t"][::core::mem::align_of::<_z_encoding_t>() - 8usize];
    ["Offset of field: _z_encoding_t::schema"]
        [::core::mem::offset_of!(_z_encoding_t, schema) - 0usize];
    ["Offset of field: _z_encoding_t::id"][::core::mem::offset_of!(_z_encoding_t, id) - 32usize];
};
unsafe extern "C" {
    pub fn _z_encoding_wrap(id: u16, schema: *const ::core::ffi::c_char) -> _z_encoding_t;
}
unsafe extern "C" {
    pub fn _z_encoding_make(
        encoding: *mut _z_encoding_t,
        id: u16,
        schema: *const ::core::ffi::c_char,
        len: usize,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_encoding_copy(dst: *mut _z_encoding_t, src: *const _z_encoding_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_encoding_move(dst: *mut _z_encoding_t, src: *mut _z_encoding_t) -> z_result_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_str_se_t {
    pub start: *const ::core::ffi::c_char,
    pub end: *const ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_str_se_t"][::core::mem::size_of::<_z_str_se_t>() - 16usize];
    ["Alignment of _z_str_se_t"][::core::mem::align_of::<_z_str_se_t>() - 8usize];
    ["Offset of field: _z_str_se_t::start"][::core::mem::offset_of!(_z_str_se_t, start) - 0usize];
    ["Offset of field: _z_str_se_t::end"][::core::mem::offset_of!(_z_str_se_t, end) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_splitstr_t {
    pub s: _z_str_se_t,
    pub delimiter: *const ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_splitstr_t"][::core::mem::size_of::<_z_splitstr_t>() - 24usize];
    ["Alignment of _z_splitstr_t"][::core::mem::align_of::<_z_splitstr_t>() - 8usize];
    ["Offset of field: _z_splitstr_t::s"][::core::mem::offset_of!(_z_splitstr_t, s) - 0usize];
    ["Offset of field: _z_splitstr_t::delimiter"]
        [::core::mem::offset_of!(_z_splitstr_t, delimiter) - 16usize];
};
unsafe extern "C" {
    #[doc = " Creates a `_z_str_se_t` from a null-terminated C string."]
    pub fn _z_bstrnew(start: *const ::core::ffi::c_char) -> _z_str_se_t;
}
unsafe extern "C" {
    #[doc = " The reverse equivalent of libc's `strstr`.\n\n Returns NULL if the needle is not found.\n If found, the return pointer will point to the end of the last occurring\n needle within the haystack."]
    pub fn _z_rstrstr(
        haystack_start: *const ::core::ffi::c_char,
        haystack_end: *const ::core::ffi::c_char,
        needle: *const ::core::ffi::c_char,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " A non-null-terminated haystack equivalent of libc's `strstr`.\n\n Returns NULL if the needle is not found.\n If found, the return pointer will point to the start of the first occurrence\n of the needle within the haystack."]
    pub fn _z_strstr(
        haystack_start: *const ::core::ffi::c_char,
        haystack_end: *const ::core::ffi::c_char,
        needle_start: *const ::core::ffi::c_char,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn _z_strstr_skipneedle(
        haystack_start: *const ::core::ffi::c_char,
        haystack_end: *const ::core::ffi::c_char,
        needle_start: *const ::core::ffi::c_char,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn _z_bstrstr_skipneedle(
        haystack: _z_str_se_t,
        needle: _z_str_se_t,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn _z_splitstr_is_empty(src: *const _z_splitstr_t) -> bool;
}
unsafe extern "C" {
    pub fn _z_splitstr_next(str_: *mut _z_splitstr_t) -> _z_str_se_t;
}
unsafe extern "C" {
    pub fn _z_splitstr_split_once(src: _z_splitstr_t, next: *mut _z_str_se_t) -> _z_str_se_t;
}
unsafe extern "C" {
    pub fn _z_splitstr_nextback(str_: *mut _z_splitstr_t) -> _z_str_se_t;
}
unsafe extern "C" {
    pub fn _z_strcnt(
        haystack_start: *const ::core::ffi::c_char,
        harstack_end: *const ::core::ffi::c_char,
        needle_start: *const ::core::ffi::c_char,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _z_str_startswith(
        s: *const ::core::ffi::c_char,
        needle: *const ::core::ffi::c_char,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _z_str_se_atoui(str_: *const _z_str_se_t, result: *mut u32) -> bool;
}
#[doc = " A variable-length encoding unsigned integer."]
pub type _z_zint_t = usize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_id_t {
    pub id: [u8; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_id_t"][::core::mem::size_of::<_z_id_t>() - 16usize];
    ["Alignment of _z_id_t"][::core::mem::align_of::<_z_id_t>() - 1usize];
    ["Offset of field: _z_id_t::id"][::core::mem::offset_of!(_z_id_t, id) - 0usize];
};
unsafe extern "C" {
    pub static empty_id: _z_id_t;
}
unsafe extern "C" {
    pub fn _z_id_len(id: _z_id_t) -> u8;
}
unsafe extern "C" {
    pub fn _z_id_cmp(left: *const _z_id_t, right: *const _z_id_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _z_id_hash(id: *const _z_id_t) -> usize;
}
pub type _z_id_eq_f = ::core::option::Option<
    unsafe extern "C" fn(left: *const _z_id_t, right: *const _z_id_t) -> bool,
>;
pub type _z_id_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(left: *const _z_id_t, right: *const _z_id_t) -> ::core::ffi::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_entity_global_id_t {
    pub zid: _z_id_t,
    pub eid: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_entity_global_id_t"][::core::mem::size_of::<_z_entity_global_id_t>() - 20usize];
    ["Alignment of _z_entity_global_id_t"]
        [::core::mem::align_of::<_z_entity_global_id_t>() - 4usize];
    ["Offset of field: _z_entity_global_id_t::zid"]
        [::core::mem::offset_of!(_z_entity_global_id_t, zid) - 0usize];
    ["Offset of field: _z_entity_global_id_t::eid"]
        [::core::mem::offset_of!(_z_entity_global_id_t, eid) - 16usize];
};
unsafe extern "C" {
    pub fn _z_entity_global_id_hash(id: *const _z_entity_global_id_t) -> usize;
}
pub type _z_entity_global_id_eq_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_entity_global_id_t,
        right: *const _z_entity_global_id_t,
    ) -> bool,
>;
pub type _z_entity_global_id_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_entity_global_id_t,
        right: *const _z_entity_global_id_t,
    ) -> ::core::ffi::c_int,
>;
#[doc = " NTP64 time."]
pub type _z_ntp64_t = u64;
#[doc = " A zenoh timestamp."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_timestamp_t {
    pub valid: bool,
    pub id: _z_id_t,
    pub time: _z_ntp64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_timestamp_t"][::core::mem::size_of::<_z_timestamp_t>() - 32usize];
    ["Alignment of _z_timestamp_t"][::core::mem::align_of::<_z_timestamp_t>() - 8usize];
    ["Offset of field: _z_timestamp_t::valid"]
        [::core::mem::offset_of!(_z_timestamp_t, valid) - 0usize];
    ["Offset of field: _z_timestamp_t::id"][::core::mem::offset_of!(_z_timestamp_t, id) - 1usize];
    ["Offset of field: _z_timestamp_t::time"]
        [::core::mem::offset_of!(_z_timestamp_t, time) - 24usize];
};
unsafe extern "C" {
    pub fn _z_timestamp_copy(dst: *mut _z_timestamp_t, src: *const _z_timestamp_t);
}
unsafe extern "C" {
    pub fn _z_timestamp_duplicate(tstamp: *const _z_timestamp_t) -> _z_timestamp_t;
}
unsafe extern "C" {
    pub fn _z_timestamp_clear(tstamp: *mut _z_timestamp_t);
}
unsafe extern "C" {
    pub fn _z_timestamp_move(dst: *mut _z_timestamp_t, src: *mut _z_timestamp_t);
}
unsafe extern "C" {
    pub fn _z_timestamp_cmp(
        left: *const _z_timestamp_t,
        right: *const _z_timestamp_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _z_timestamp_ntp64_from_time(seconds: u32, nanos: u32) -> _z_ntp64_t;
}
pub type _z_timestamp_eq_f = ::core::option::Option<
    unsafe extern "C" fn(left: *const _z_timestamp_t, right: *const _z_timestamp_t) -> bool,
>;
pub type _z_timestamp_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_timestamp_t,
        right: *const _z_timestamp_t,
    ) -> ::core::ffi::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_keyexpr_t {
    pub _id: u16,
    pub _mapping: usize,
    pub _suffix: _z_string_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_keyexpr_t"][::core::mem::size_of::<_z_keyexpr_t>() - 48usize];
    ["Alignment of _z_keyexpr_t"][::core::mem::align_of::<_z_keyexpr_t>() - 8usize];
    ["Offset of field: _z_keyexpr_t::_id"][::core::mem::offset_of!(_z_keyexpr_t, _id) - 0usize];
    ["Offset of field: _z_keyexpr_t::_mapping"]
        [::core::mem::offset_of!(_z_keyexpr_t, _mapping) - 8usize];
    ["Offset of field: _z_keyexpr_t::_suffix"]
        [::core::mem::offset_of!(_z_keyexpr_t, _suffix) - 16usize];
};
unsafe extern "C" {
    #[doc = " Create a resource key from a resource name.\n\n Parameters:\n     rname: The resource name. The caller keeps its ownership.\n\n Returns:\n     A :c:type:`_z_keyexpr_t` containing a new resource key."]
    pub fn _z_rname(rname: *const ::core::ffi::c_char) -> _z_keyexpr_t;
}
unsafe extern "C" {
    #[doc = " Create a resource key from a resource id and a suffix.\n\n Parameters:\n     id: The resource id.\n     suffix: The suffix.\n\n Returns:\n     A :c:type:`_z_keyexpr_t` containing a new resource key."]
    pub fn _z_rid_with_suffix(rid: u16, suffix: *const ::core::ffi::c_char) -> _z_keyexpr_t;
}
unsafe extern "C" {
    pub fn _z_rid_with_substr_suffix(
        rid: u16,
        suffix: *const ::core::ffi::c_char,
        suffix_len: usize,
    ) -> _z_keyexpr_t;
}
#[doc = " QoS settings of zenoh message."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_qos_t {
    pub _val: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_qos_t"][::core::mem::size_of::<_z_qos_t>() - 1usize];
    ["Alignment of _z_qos_t"][::core::mem::align_of::<_z_qos_t>() - 1usize];
    ["Offset of field: _z_qos_t::_val"][::core::mem::offset_of!(_z_qos_t, _val) - 0usize];
};
#[doc = " Represents a Zenoh value.\n\n Members:\n   _z_bytes_t payload: The payload of this zenoh value.\n   _z_encoding_t encoding: The encoding of the `payload`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_value_t {
    pub payload: _z_bytes_t,
    pub encoding: _z_encoding_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_value_t"][::core::mem::size_of::<_z_value_t>() - 72usize];
    ["Alignment of _z_value_t"][::core::mem::align_of::<_z_value_t>() - 8usize];
    ["Offset of field: _z_value_t::payload"][::core::mem::offset_of!(_z_value_t, payload) - 0usize];
    ["Offset of field: _z_value_t::encoding"]
        [::core::mem::offset_of!(_z_value_t, encoding) - 32usize];
};
unsafe extern "C" {
    pub fn _z_value_steal(value: *mut _z_value_t) -> _z_value_t;
}
unsafe extern "C" {
    pub fn _z_value_copy(dst: *mut _z_value_t, src: *const _z_value_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_value_move(dst: *mut _z_value_t, src: *mut _z_value_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_value_clear(src: *mut _z_value_t);
}
unsafe extern "C" {
    pub fn _z_value_free(hello: *mut *mut _z_value_t);
}
#[doc = " A hello message returned by a zenoh entity to a scout message sent with :c:func:`_z_scout`.\n\n Members:\n   _z_slice_t zid: The Zenoh ID of the scouted entity (empty if absent).\n   _z_string_vec_t locators: The locators of the scouted entity.\n   z_whatami_t whatami: The kind of zenoh entity."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_hello_t {
    pub _zid: _z_id_t,
    pub _locators: _z_string_svec_t,
    pub _whatami: z_whatami_t,
    pub _version: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_hello_t"][::core::mem::size_of::<_z_hello_t>() - 56usize];
    ["Alignment of _z_hello_t"][::core::mem::align_of::<_z_hello_t>() - 8usize];
    ["Offset of field: _z_hello_t::_zid"][::core::mem::offset_of!(_z_hello_t, _zid) - 0usize];
    ["Offset of field: _z_hello_t::_locators"]
        [::core::mem::offset_of!(_z_hello_t, _locators) - 16usize];
    ["Offset of field: _z_hello_t::_whatami"]
        [::core::mem::offset_of!(_z_hello_t, _whatami) - 48usize];
    ["Offset of field: _z_hello_t::_version"]
        [::core::mem::offset_of!(_z_hello_t, _version) - 52usize];
};
unsafe extern "C" {
    pub fn _z_hello_clear(src: *mut _z_hello_t);
}
unsafe extern "C" {
    pub fn _z_hello_free(hello: *mut *mut _z_hello_t);
}
unsafe extern "C" {
    pub fn _z_hello_copy(dst: *mut _z_hello_t, src: *const _z_hello_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_hello_move(dst: *mut _z_hello_t, src: *mut _z_hello_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_hello_check(hello: *const _z_hello_t) -> bool;
}
pub type _z_hello_eq_f = ::core::option::Option<
    unsafe extern "C" fn(left: *const _z_hello_t, right: *const _z_hello_t) -> bool,
>;
pub type _z_hello_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(left: *const _z_hello_t, right: *const _z_hello_t) -> ::core::ffi::c_int,
>;
pub type _z_hello_slist_t = _z_slist_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_target_complete_body_t {
    pub n: _z_zint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_target_complete_body_t"]
        [::core::mem::size_of::<_z_target_complete_body_t>() - 8usize];
    ["Alignment of _z_target_complete_body_t"]
        [::core::mem::align_of::<_z_target_complete_body_t>() - 8usize];
    ["Offset of field: _z_target_complete_body_t::n"]
        [::core::mem::offset_of!(_z_target_complete_body_t, n) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_source_info_t {
    pub _source_id: _z_entity_global_id_t,
    pub _source_sn: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_source_info_t"][::core::mem::size_of::<_z_source_info_t>() - 24usize];
    ["Alignment of _z_source_info_t"][::core::mem::align_of::<_z_source_info_t>() - 4usize];
    ["Offset of field: _z_source_info_t::_source_id"]
        [::core::mem::offset_of!(_z_source_info_t, _source_id) - 0usize];
    ["Offset of field: _z_source_info_t::_source_sn"]
        [::core::mem::offset_of!(_z_source_info_t, _source_sn) - 20usize];
};
unsafe extern "C" {
    pub fn _z_source_info_copy(
        dst: *mut _z_source_info_t,
        src: *const _z_source_info_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_source_info_move(
        dst: *mut _z_source_info_t,
        src: *mut _z_source_info_t,
    ) -> z_result_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_reply_context_t {
    pub _request_id: u32,
    pub _entity_id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_reply_context_t"][::core::mem::size_of::<_z_reply_context_t>() - 8usize];
    ["Alignment of _z_reply_context_t"][::core::mem::align_of::<_z_reply_context_t>() - 4usize];
    ["Offset of field: _z_reply_context_t::_request_id"]
        [::core::mem::offset_of!(_z_reply_context_t, _request_id) - 0usize];
    ["Offset of field: _z_reply_context_t::_entity_id"]
        [::core::mem::offset_of!(_z_reply_context_t, _entity_id) - 4usize];
};
unsafe extern "C" {
    pub fn _z_keyexpr_is_canon(
        start: *const ::core::ffi::c_char,
        len: usize,
    ) -> zp_keyexpr_canon_status_t;
}
unsafe extern "C" {
    pub fn _z_keyexpr_canonize(
        start: *mut ::core::ffi::c_char,
        len: *mut usize,
    ) -> zp_keyexpr_canon_status_t;
}
unsafe extern "C" {
    pub fn _z_keyexpr_suffix_includes(
        left: *const _z_keyexpr_t,
        right: *const _z_keyexpr_t,
    ) -> bool;
}
unsafe extern "C" {
    pub fn _z_keyexpr_suffix_intersects(
        left: *const _z_keyexpr_t,
        right: *const _z_keyexpr_t,
    ) -> bool;
}
unsafe extern "C" {
    pub fn _z_keyexpr_suffix_equals(left: *const _z_keyexpr_t, right: *const _z_keyexpr_t) -> bool;
}
unsafe extern "C" {
    pub fn _z_keyexpr_compare(
        first: *mut _z_keyexpr_t,
        second: *mut _z_keyexpr_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _z_keyexpr_from_string(dst: *mut _z_keyexpr_t, rid: u16, str_: *const _z_string_t);
}
unsafe extern "C" {
    pub fn _z_keyexpr_from_substr(
        dst: *mut _z_keyexpr_t,
        rid: u16,
        str_: *const ::core::ffi::c_char,
        len: usize,
    );
}
unsafe extern "C" {
    pub fn _z_keyexpr_size(p: *mut _z_keyexpr_t) -> usize;
}
unsafe extern "C" {
    pub fn _z_keyexpr_copy(dst: *mut _z_keyexpr_t, src: *const _z_keyexpr_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_keyexpr_duplicate(src: *const _z_keyexpr_t) -> _z_keyexpr_t;
}
unsafe extern "C" {
    pub fn _z_keyexpr_clone(src: *const _z_keyexpr_t) -> *mut _z_keyexpr_t;
}
unsafe extern "C" {
    #[doc = " Returns either keyexpr defined by id + mapping with null suffix if id is non-zero,\n or keyexpr defined by its suffix only, with 0 id and no mapping. This is to be used only when forwarding\n keyexpr in user api to properly separate declared keyexpr from its suffix."]
    pub fn _z_keyexpr_alias_from_user_defined(dst: *mut _z_keyexpr_t, src: *const _z_keyexpr_t);
}
unsafe extern "C" {
    pub fn _z_keyexpr_remove_wilds(
        base_key: *mut _z_keyexpr_t,
        wild_loc: *mut *mut ::core::ffi::c_char,
        wild_suffix_size: *mut usize,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_keyexpr_equals(left: *const _z_keyexpr_t, right: *const _z_keyexpr_t) -> bool;
}
unsafe extern "C" {
    pub fn _z_keyexpr_move(dst: *mut _z_keyexpr_t, src: *mut _z_keyexpr_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_keyexpr_free(rk: *mut *mut _z_keyexpr_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_decl_kexpr_t {
    pub _id: u16,
    pub _keyexpr: _z_keyexpr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_decl_kexpr_t"][::core::mem::size_of::<_z_decl_kexpr_t>() - 56usize];
    ["Alignment of _z_decl_kexpr_t"][::core::mem::align_of::<_z_decl_kexpr_t>() - 8usize];
    ["Offset of field: _z_decl_kexpr_t::_id"]
        [::core::mem::offset_of!(_z_decl_kexpr_t, _id) - 0usize];
    ["Offset of field: _z_decl_kexpr_t::_keyexpr"]
        [::core::mem::offset_of!(_z_decl_kexpr_t, _keyexpr) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_undecl_kexpr_t {
    pub _id: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_undecl_kexpr_t"][::core::mem::size_of::<_z_undecl_kexpr_t>() - 2usize];
    ["Alignment of _z_undecl_kexpr_t"][::core::mem::align_of::<_z_undecl_kexpr_t>() - 2usize];
    ["Offset of field: _z_undecl_kexpr_t::_id"]
        [::core::mem::offset_of!(_z_undecl_kexpr_t, _id) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_decl_subscriber_t {
    pub _keyexpr: _z_keyexpr_t,
    pub _id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_decl_subscriber_t"][::core::mem::size_of::<_z_decl_subscriber_t>() - 56usize];
    ["Alignment of _z_decl_subscriber_t"][::core::mem::align_of::<_z_decl_subscriber_t>() - 8usize];
    ["Offset of field: _z_decl_subscriber_t::_keyexpr"]
        [::core::mem::offset_of!(_z_decl_subscriber_t, _keyexpr) - 0usize];
    ["Offset of field: _z_decl_subscriber_t::_id"]
        [::core::mem::offset_of!(_z_decl_subscriber_t, _id) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_undecl_subscriber_t {
    pub _id: u32,
    pub _ext_keyexpr: _z_keyexpr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_undecl_subscriber_t"][::core::mem::size_of::<_z_undecl_subscriber_t>() - 56usize];
    ["Alignment of _z_undecl_subscriber_t"]
        [::core::mem::align_of::<_z_undecl_subscriber_t>() - 8usize];
    ["Offset of field: _z_undecl_subscriber_t::_id"]
        [::core::mem::offset_of!(_z_undecl_subscriber_t, _id) - 0usize];
    ["Offset of field: _z_undecl_subscriber_t::_ext_keyexpr"]
        [::core::mem::offset_of!(_z_undecl_subscriber_t, _ext_keyexpr) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_decl_queryable_t {
    pub _keyexpr: _z_keyexpr_t,
    pub _id: u32,
    pub _ext_queryable_info: _z_decl_queryable_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_decl_queryable_t__bindgen_ty_1 {
    pub _complete: bool,
    pub _distance: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_decl_queryable_t__bindgen_ty_1"]
        [::core::mem::size_of::<_z_decl_queryable_t__bindgen_ty_1>() - 4usize];
    ["Alignment of _z_decl_queryable_t__bindgen_ty_1"]
        [::core::mem::align_of::<_z_decl_queryable_t__bindgen_ty_1>() - 2usize];
    ["Offset of field: _z_decl_queryable_t__bindgen_ty_1::_complete"]
        [::core::mem::offset_of!(_z_decl_queryable_t__bindgen_ty_1, _complete) - 0usize];
    ["Offset of field: _z_decl_queryable_t__bindgen_ty_1::_distance"]
        [::core::mem::offset_of!(_z_decl_queryable_t__bindgen_ty_1, _distance) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_decl_queryable_t"][::core::mem::size_of::<_z_decl_queryable_t>() - 56usize];
    ["Alignment of _z_decl_queryable_t"][::core::mem::align_of::<_z_decl_queryable_t>() - 8usize];
    ["Offset of field: _z_decl_queryable_t::_keyexpr"]
        [::core::mem::offset_of!(_z_decl_queryable_t, _keyexpr) - 0usize];
    ["Offset of field: _z_decl_queryable_t::_id"]
        [::core::mem::offset_of!(_z_decl_queryable_t, _id) - 48usize];
    ["Offset of field: _z_decl_queryable_t::_ext_queryable_info"]
        [::core::mem::offset_of!(_z_decl_queryable_t, _ext_queryable_info) - 52usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_undecl_queryable_t {
    pub _id: u32,
    pub _ext_keyexpr: _z_keyexpr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_undecl_queryable_t"][::core::mem::size_of::<_z_undecl_queryable_t>() - 56usize];
    ["Alignment of _z_undecl_queryable_t"]
        [::core::mem::align_of::<_z_undecl_queryable_t>() - 8usize];
    ["Offset of field: _z_undecl_queryable_t::_id"]
        [::core::mem::offset_of!(_z_undecl_queryable_t, _id) - 0usize];
    ["Offset of field: _z_undecl_queryable_t::_ext_keyexpr"]
        [::core::mem::offset_of!(_z_undecl_queryable_t, _ext_keyexpr) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_decl_token_t {
    pub _keyexpr: _z_keyexpr_t,
    pub _id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_decl_token_t"][::core::mem::size_of::<_z_decl_token_t>() - 56usize];
    ["Alignment of _z_decl_token_t"][::core::mem::align_of::<_z_decl_token_t>() - 8usize];
    ["Offset of field: _z_decl_token_t::_keyexpr"]
        [::core::mem::offset_of!(_z_decl_token_t, _keyexpr) - 0usize];
    ["Offset of field: _z_decl_token_t::_id"]
        [::core::mem::offset_of!(_z_decl_token_t, _id) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_undecl_token_t {
    pub _id: u32,
    pub _ext_keyexpr: _z_keyexpr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_undecl_token_t"][::core::mem::size_of::<_z_undecl_token_t>() - 56usize];
    ["Alignment of _z_undecl_token_t"][::core::mem::align_of::<_z_undecl_token_t>() - 8usize];
    ["Offset of field: _z_undecl_token_t::_id"]
        [::core::mem::offset_of!(_z_undecl_token_t, _id) - 0usize];
    ["Offset of field: _z_undecl_token_t::_ext_keyexpr"]
        [::core::mem::offset_of!(_z_undecl_token_t, _ext_keyexpr) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_decl_final_t {
    pub _placeholder: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_decl_final_t"][::core::mem::size_of::<_z_decl_final_t>() - 1usize];
    ["Alignment of _z_decl_final_t"][::core::mem::align_of::<_z_decl_final_t>() - 1usize];
    ["Offset of field: _z_decl_final_t::_placeholder"]
        [::core::mem::offset_of!(_z_decl_final_t, _placeholder) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_declaration_t {
    pub _tag: _z_declaration_t__bindgen_ty_1,
    pub _body: _z_declaration_t__bindgen_ty_2,
}
pub const _z_declaration_t__Z_DECL_KEXPR: _z_declaration_t__bindgen_ty_1 = 0;
pub const _z_declaration_t__Z_UNDECL_KEXPR: _z_declaration_t__bindgen_ty_1 = 1;
pub const _z_declaration_t__Z_DECL_SUBSCRIBER: _z_declaration_t__bindgen_ty_1 = 2;
pub const _z_declaration_t__Z_UNDECL_SUBSCRIBER: _z_declaration_t__bindgen_ty_1 = 3;
pub const _z_declaration_t__Z_DECL_QUERYABLE: _z_declaration_t__bindgen_ty_1 = 4;
pub const _z_declaration_t__Z_UNDECL_QUERYABLE: _z_declaration_t__bindgen_ty_1 = 5;
pub const _z_declaration_t__Z_DECL_TOKEN: _z_declaration_t__bindgen_ty_1 = 6;
pub const _z_declaration_t__Z_UNDECL_TOKEN: _z_declaration_t__bindgen_ty_1 = 7;
pub const _z_declaration_t__Z_DECL_FINAL: _z_declaration_t__bindgen_ty_1 = 8;
pub type _z_declaration_t__bindgen_ty_1 = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _z_declaration_t__bindgen_ty_2 {
    pub _decl_kexpr: _z_decl_kexpr_t,
    pub _undecl_kexpr: _z_undecl_kexpr_t,
    pub _decl_subscriber: _z_decl_subscriber_t,
    pub _undecl_subscriber: _z_undecl_subscriber_t,
    pub _decl_queryable: _z_decl_queryable_t,
    pub _undecl_queryable: _z_undecl_queryable_t,
    pub _decl_token: _z_decl_token_t,
    pub _undecl_token: _z_undecl_token_t,
    pub _decl_final: _z_decl_final_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_declaration_t__bindgen_ty_2"]
        [::core::mem::size_of::<_z_declaration_t__bindgen_ty_2>() - 56usize];
    ["Alignment of _z_declaration_t__bindgen_ty_2"]
        [::core::mem::align_of::<_z_declaration_t__bindgen_ty_2>() - 8usize];
    ["Offset of field: _z_declaration_t__bindgen_ty_2::_decl_kexpr"]
        [::core::mem::offset_of!(_z_declaration_t__bindgen_ty_2, _decl_kexpr) - 0usize];
    ["Offset of field: _z_declaration_t__bindgen_ty_2::_undecl_kexpr"]
        [::core::mem::offset_of!(_z_declaration_t__bindgen_ty_2, _undecl_kexpr) - 0usize];
    ["Offset of field: _z_declaration_t__bindgen_ty_2::_decl_subscriber"]
        [::core::mem::offset_of!(_z_declaration_t__bindgen_ty_2, _decl_subscriber) - 0usize];
    ["Offset of field: _z_declaration_t__bindgen_ty_2::_undecl_subscriber"]
        [::core::mem::offset_of!(_z_declaration_t__bindgen_ty_2, _undecl_subscriber) - 0usize];
    ["Offset of field: _z_declaration_t__bindgen_ty_2::_decl_queryable"]
        [::core::mem::offset_of!(_z_declaration_t__bindgen_ty_2, _decl_queryable) - 0usize];
    ["Offset of field: _z_declaration_t__bindgen_ty_2::_undecl_queryable"]
        [::core::mem::offset_of!(_z_declaration_t__bindgen_ty_2, _undecl_queryable) - 0usize];
    ["Offset of field: _z_declaration_t__bindgen_ty_2::_decl_token"]
        [::core::mem::offset_of!(_z_declaration_t__bindgen_ty_2, _decl_token) - 0usize];
    ["Offset of field: _z_declaration_t__bindgen_ty_2::_undecl_token"]
        [::core::mem::offset_of!(_z_declaration_t__bindgen_ty_2, _undecl_token) - 0usize];
    ["Offset of field: _z_declaration_t__bindgen_ty_2::_decl_final"]
        [::core::mem::offset_of!(_z_declaration_t__bindgen_ty_2, _decl_final) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_declaration_t"][::core::mem::size_of::<_z_declaration_t>() - 64usize];
    ["Alignment of _z_declaration_t"][::core::mem::align_of::<_z_declaration_t>() - 8usize];
    ["Offset of field: _z_declaration_t::_tag"]
        [::core::mem::offset_of!(_z_declaration_t, _tag) - 0usize];
    ["Offset of field: _z_declaration_t::_body"]
        [::core::mem::offset_of!(_z_declaration_t, _body) - 8usize];
};
unsafe extern "C" {
    pub fn _z_declaration_clear(decl: *mut _z_declaration_t);
}
unsafe extern "C" {
    pub fn _z_make_decl_keyexpr(id: u16, key: *mut _z_keyexpr_t) -> _z_declaration_t;
}
unsafe extern "C" {
    pub fn _z_make_undecl_keyexpr(id: u16) -> _z_declaration_t;
}
unsafe extern "C" {
    pub fn _z_make_decl_subscriber(key: *mut _z_keyexpr_t, id: u32) -> _z_declaration_t;
}
unsafe extern "C" {
    pub fn _z_make_undecl_subscriber(id: u32, key: *const _z_keyexpr_t) -> _z_declaration_t;
}
unsafe extern "C" {
    pub fn _z_make_decl_queryable(
        key: *mut _z_keyexpr_t,
        id: u32,
        complete: bool,
        distance: u16,
    ) -> _z_declaration_t;
}
unsafe extern "C" {
    pub fn _z_make_undecl_queryable(id: u32, key: *const _z_keyexpr_t) -> _z_declaration_t;
}
unsafe extern "C" {
    pub fn _z_make_decl_token(key: *mut _z_keyexpr_t, id: u32) -> _z_declaration_t;
}
unsafe extern "C" {
    pub fn _z_make_undecl_token(id: u32, key: *const _z_keyexpr_t) -> _z_declaration_t;
}
unsafe extern "C" {
    pub fn _z_make_decl_final() -> _z_declaration_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_interest_t {
    pub _keyexpr: _z_keyexpr_t,
    pub _id: u32,
    pub flags: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_interest_t"][::core::mem::size_of::<_z_interest_t>() - 56usize];
    ["Alignment of _z_interest_t"][::core::mem::align_of::<_z_interest_t>() - 8usize];
    ["Offset of field: _z_interest_t::_keyexpr"]
        [::core::mem::offset_of!(_z_interest_t, _keyexpr) - 0usize];
    ["Offset of field: _z_interest_t::_id"][::core::mem::offset_of!(_z_interest_t, _id) - 48usize];
    ["Offset of field: _z_interest_t::flags"]
        [::core::mem::offset_of!(_z_interest_t, flags) - 52usize];
};
unsafe extern "C" {
    pub fn _z_interest_clear(decl: *mut _z_interest_t);
}
unsafe extern "C" {
    pub fn _z_make_interest(key: *mut _z_keyexpr_t, id: u32, flags: u8) -> _z_interest_t;
}
unsafe extern "C" {
    pub fn _z_make_interest_final(id: u32) -> _z_interest_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_msg_err_t {
    pub _encoding: _z_encoding_t,
    pub _ext_source_info: _z_source_info_t,
    pub _payload: _z_bytes_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_msg_err_t"][::core::mem::size_of::<_z_msg_err_t>() - 96usize];
    ["Alignment of _z_msg_err_t"][::core::mem::align_of::<_z_msg_err_t>() - 8usize];
    ["Offset of field: _z_msg_err_t::_encoding"]
        [::core::mem::offset_of!(_z_msg_err_t, _encoding) - 0usize];
    ["Offset of field: _z_msg_err_t::_ext_source_info"]
        [::core::mem::offset_of!(_z_msg_err_t, _ext_source_info) - 40usize];
    ["Offset of field: _z_msg_err_t::_payload"]
        [::core::mem::offset_of!(_z_msg_err_t, _payload) - 64usize];
};
unsafe extern "C" {
    pub fn _z_msg_err_clear(err: *mut _z_msg_err_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_m_push_commons_t {
    pub _timestamp: _z_timestamp_t,
    pub _source_info: _z_source_info_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_m_push_commons_t"][::core::mem::size_of::<_z_m_push_commons_t>() - 56usize];
    ["Alignment of _z_m_push_commons_t"][::core::mem::align_of::<_z_m_push_commons_t>() - 8usize];
    ["Offset of field: _z_m_push_commons_t::_timestamp"]
        [::core::mem::offset_of!(_z_m_push_commons_t, _timestamp) - 0usize];
    ["Offset of field: _z_m_push_commons_t::_source_info"]
        [::core::mem::offset_of!(_z_m_push_commons_t, _source_info) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_msg_del_t {
    pub _commons: _z_m_push_commons_t,
    pub _attachment: _z_bytes_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_msg_del_t"][::core::mem::size_of::<_z_msg_del_t>() - 88usize];
    ["Alignment of _z_msg_del_t"][::core::mem::align_of::<_z_msg_del_t>() - 8usize];
    ["Offset of field: _z_msg_del_t::_commons"]
        [::core::mem::offset_of!(_z_msg_del_t, _commons) - 0usize];
    ["Offset of field: _z_msg_del_t::_attachment"]
        [::core::mem::offset_of!(_z_msg_del_t, _attachment) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_msg_put_t {
    pub _commons: _z_m_push_commons_t,
    pub _payload: _z_bytes_t,
    pub _encoding: _z_encoding_t,
    pub _attachment: _z_bytes_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_msg_put_t"][::core::mem::size_of::<_z_msg_put_t>() - 160usize];
    ["Alignment of _z_msg_put_t"][::core::mem::align_of::<_z_msg_put_t>() - 8usize];
    ["Offset of field: _z_msg_put_t::_commons"]
        [::core::mem::offset_of!(_z_msg_put_t, _commons) - 0usize];
    ["Offset of field: _z_msg_put_t::_payload"]
        [::core::mem::offset_of!(_z_msg_put_t, _payload) - 56usize];
    ["Offset of field: _z_msg_put_t::_encoding"]
        [::core::mem::offset_of!(_z_msg_put_t, _encoding) - 88usize];
    ["Offset of field: _z_msg_put_t::_attachment"]
        [::core::mem::offset_of!(_z_msg_put_t, _attachment) - 128usize];
};
unsafe extern "C" {
    pub fn _z_msg_put_clear(arg1: *mut _z_msg_put_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_msg_query_t {
    pub _parameters: _z_slice_t,
    pub _ext_info: _z_source_info_t,
    pub _ext_value: _z_value_t,
    pub _consolidation: z_consolidation_mode_t,
    pub _ext_attachment: _z_bytes_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_msg_query_t"][::core::mem::size_of::<_z_msg_query_t>() - 168usize];
    ["Alignment of _z_msg_query_t"][::core::mem::align_of::<_z_msg_query_t>() - 8usize];
    ["Offset of field: _z_msg_query_t::_parameters"]
        [::core::mem::offset_of!(_z_msg_query_t, _parameters) - 0usize];
    ["Offset of field: _z_msg_query_t::_ext_info"]
        [::core::mem::offset_of!(_z_msg_query_t, _ext_info) - 32usize];
    ["Offset of field: _z_msg_query_t::_ext_value"]
        [::core::mem::offset_of!(_z_msg_query_t, _ext_value) - 56usize];
    ["Offset of field: _z_msg_query_t::_consolidation"]
        [::core::mem::offset_of!(_z_msg_query_t, _consolidation) - 128usize];
    ["Offset of field: _z_msg_query_t::_ext_attachment"]
        [::core::mem::offset_of!(_z_msg_query_t, _ext_attachment) - 136usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_msg_query_reqexts_t {
    pub info: bool,
    pub body: bool,
    pub attachment: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_msg_query_reqexts_t"][::core::mem::size_of::<_z_msg_query_reqexts_t>() - 3usize];
    ["Alignment of _z_msg_query_reqexts_t"]
        [::core::mem::align_of::<_z_msg_query_reqexts_t>() - 1usize];
    ["Offset of field: _z_msg_query_reqexts_t::info"]
        [::core::mem::offset_of!(_z_msg_query_reqexts_t, info) - 0usize];
    ["Offset of field: _z_msg_query_reqexts_t::body"]
        [::core::mem::offset_of!(_z_msg_query_reqexts_t, body) - 1usize];
    ["Offset of field: _z_msg_query_reqexts_t::attachment"]
        [::core::mem::offset_of!(_z_msg_query_reqexts_t, attachment) - 2usize];
};
unsafe extern "C" {
    pub fn _z_msg_query_required_extensions(msg: *const _z_msg_query_t) -> _z_msg_query_reqexts_t;
}
unsafe extern "C" {
    pub fn _z_msg_query_clear(msg: *mut _z_msg_query_t);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_reply_body_t {
    pub _is_put: bool,
    pub _body: _z_reply_body_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _z_reply_body_t__bindgen_ty_1 {
    pub _del: _z_msg_del_t,
    pub _put: _z_msg_put_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_reply_body_t__bindgen_ty_1"]
        [::core::mem::size_of::<_z_reply_body_t__bindgen_ty_1>() - 160usize];
    ["Alignment of _z_reply_body_t__bindgen_ty_1"]
        [::core::mem::align_of::<_z_reply_body_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: _z_reply_body_t__bindgen_ty_1::_del"]
        [::core::mem::offset_of!(_z_reply_body_t__bindgen_ty_1, _del) - 0usize];
    ["Offset of field: _z_reply_body_t__bindgen_ty_1::_put"]
        [::core::mem::offset_of!(_z_reply_body_t__bindgen_ty_1, _put) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_reply_body_t"][::core::mem::size_of::<_z_reply_body_t>() - 168usize];
    ["Alignment of _z_reply_body_t"][::core::mem::align_of::<_z_reply_body_t>() - 8usize];
    ["Offset of field: _z_reply_body_t::_is_put"]
        [::core::mem::offset_of!(_z_reply_body_t, _is_put) - 0usize];
    ["Offset of field: _z_reply_body_t::_body"]
        [::core::mem::offset_of!(_z_reply_body_t, _body) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_msg_reply_t {
    pub _consolidation: z_consolidation_mode_t,
    pub _body: _z_reply_body_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_msg_reply_t"][::core::mem::size_of::<_z_msg_reply_t>() - 176usize];
    ["Alignment of _z_msg_reply_t"][::core::mem::align_of::<_z_msg_reply_t>() - 8usize];
    ["Offset of field: _z_msg_reply_t::_consolidation"]
        [::core::mem::offset_of!(_z_msg_reply_t, _consolidation) - 0usize];
    ["Offset of field: _z_msg_reply_t::_body"]
        [::core::mem::offset_of!(_z_msg_reply_t, _body) - 8usize];
};
unsafe extern "C" {
    pub fn _z_msg_reply_clear(msg: *mut _z_msg_reply_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_msg_ext_unit_t {
    pub __dummy: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_msg_ext_unit_t"][::core::mem::size_of::<_z_msg_ext_unit_t>() - 1usize];
    ["Alignment of _z_msg_ext_unit_t"][::core::mem::align_of::<_z_msg_ext_unit_t>() - 1usize];
    ["Offset of field: _z_msg_ext_unit_t::__dummy"]
        [::core::mem::offset_of!(_z_msg_ext_unit_t, __dummy) - 0usize];
};
unsafe extern "C" {
    pub fn _z_msg_ext_clear_unit(ext: *mut _z_msg_ext_unit_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_msg_ext_zint_t {
    pub _val: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_msg_ext_zint_t"][::core::mem::size_of::<_z_msg_ext_zint_t>() - 8usize];
    ["Alignment of _z_msg_ext_zint_t"][::core::mem::align_of::<_z_msg_ext_zint_t>() - 8usize];
    ["Offset of field: _z_msg_ext_zint_t::_val"]
        [::core::mem::offset_of!(_z_msg_ext_zint_t, _val) - 0usize];
};
unsafe extern "C" {
    pub fn _z_msg_ext_clear_zint(ext: *mut _z_msg_ext_zint_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_msg_ext_zbuf_t {
    pub _val: _z_slice_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_msg_ext_zbuf_t"][::core::mem::size_of::<_z_msg_ext_zbuf_t>() - 32usize];
    ["Alignment of _z_msg_ext_zbuf_t"][::core::mem::align_of::<_z_msg_ext_zbuf_t>() - 8usize];
    ["Offset of field: _z_msg_ext_zbuf_t::_val"]
        [::core::mem::offset_of!(_z_msg_ext_zbuf_t, _val) - 0usize];
};
unsafe extern "C" {
    pub fn _z_msg_ext_clear_zbuf(ext: *mut _z_msg_ext_zbuf_t);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _z_msg_ext_body_t {
    pub _unit: _z_msg_ext_unit_t,
    pub _zint: _z_msg_ext_zint_t,
    pub _zbuf: _z_msg_ext_zbuf_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_msg_ext_body_t"][::core::mem::size_of::<_z_msg_ext_body_t>() - 32usize];
    ["Alignment of _z_msg_ext_body_t"][::core::mem::align_of::<_z_msg_ext_body_t>() - 8usize];
    ["Offset of field: _z_msg_ext_body_t::_unit"]
        [::core::mem::offset_of!(_z_msg_ext_body_t, _unit) - 0usize];
    ["Offset of field: _z_msg_ext_body_t::_zint"]
        [::core::mem::offset_of!(_z_msg_ext_body_t, _zint) - 0usize];
    ["Offset of field: _z_msg_ext_body_t::_zbuf"]
        [::core::mem::offset_of!(_z_msg_ext_body_t, _zbuf) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_msg_ext_t {
    pub _body: _z_msg_ext_body_t,
    pub _header: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_msg_ext_t"][::core::mem::size_of::<_z_msg_ext_t>() - 40usize];
    ["Alignment of _z_msg_ext_t"][::core::mem::align_of::<_z_msg_ext_t>() - 8usize];
    ["Offset of field: _z_msg_ext_t::_body"][::core::mem::offset_of!(_z_msg_ext_t, _body) - 0usize];
    ["Offset of field: _z_msg_ext_t::_header"]
        [::core::mem::offset_of!(_z_msg_ext_t, _header) - 32usize];
};
unsafe extern "C" {
    pub fn _z_msg_ext_clear(ext: *mut _z_msg_ext_t);
}
unsafe extern "C" {
    pub fn _z_msg_ext_make_unit(id: u8) -> _z_msg_ext_t;
}
unsafe extern "C" {
    pub fn _z_msg_ext_make_zint(id: u8, zid: _z_zint_t) -> _z_msg_ext_t;
}
unsafe extern "C" {
    pub fn _z_msg_ext_make_zbuf(id: u8, zbuf: _z_slice_t) -> _z_msg_ext_t;
}
unsafe extern "C" {
    pub fn _z_msg_ext_copy(clone: *mut _z_msg_ext_t, ext: *const _z_msg_ext_t);
}
unsafe extern "C" {
    pub fn _z_msg_ext_copy_unit(clone: *mut _z_msg_ext_unit_t, ext: *const _z_msg_ext_unit_t);
}
unsafe extern "C" {
    pub fn _z_msg_ext_copy_zint(clone: *mut _z_msg_ext_zint_t, ext: *const _z_msg_ext_zint_t);
}
unsafe extern "C" {
    pub fn _z_msg_ext_copy_zbuf(clone: *mut _z_msg_ext_zbuf_t, ext: *const _z_msg_ext_zbuf_t);
}
pub type _z_msg_ext_eq_f = ::core::option::Option<
    unsafe extern "C" fn(left: *const _z_msg_ext_t, right: *const _z_msg_ext_t) -> bool,
>;
pub type _z_msg_ext_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_msg_ext_t,
        right: *const _z_msg_ext_t,
    ) -> ::core::ffi::c_int,
>;
#[doc = " A dynamically allocated vector. Elements are stored as pointers."]
pub type _z_msg_ext_vec_t = _z_vec_t;
#[doc = " QoS settings of zenoh message."]
pub type _z_n_qos_t = _z_qos_t;
unsafe extern "C" {
    pub static _Z_N_QOS_DEFAULT: _z_qos_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_n_msg_request_t {
    pub _rid: _z_zint_t,
    pub _key: _z_keyexpr_t,
    pub _ext_timestamp: _z_timestamp_t,
    pub _ext_qos: _z_n_qos_t,
    pub _ext_target: z_query_target_t,
    pub _ext_budget: u32,
    pub _ext_timeout_ms: u64,
    pub _tag: _z_n_msg_request_t__bindgen_ty_1,
    pub _body: _z_n_msg_request_t__bindgen_ty_2,
}
pub const _z_n_msg_request_t__Z_REQUEST_QUERY: _z_n_msg_request_t__bindgen_ty_1 = 0;
pub const _z_n_msg_request_t__Z_REQUEST_PUT: _z_n_msg_request_t__bindgen_ty_1 = 1;
pub const _z_n_msg_request_t__Z_REQUEST_DEL: _z_n_msg_request_t__bindgen_ty_1 = 2;
pub type _z_n_msg_request_t__bindgen_ty_1 = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _z_n_msg_request_t__bindgen_ty_2 {
    pub _query: _z_msg_query_t,
    pub _put: _z_msg_put_t,
    pub _del: _z_msg_del_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_n_msg_request_t__bindgen_ty_2"]
        [::core::mem::size_of::<_z_n_msg_request_t__bindgen_ty_2>() - 168usize];
    ["Alignment of _z_n_msg_request_t__bindgen_ty_2"]
        [::core::mem::align_of::<_z_n_msg_request_t__bindgen_ty_2>() - 8usize];
    ["Offset of field: _z_n_msg_request_t__bindgen_ty_2::_query"]
        [::core::mem::offset_of!(_z_n_msg_request_t__bindgen_ty_2, _query) - 0usize];
    ["Offset of field: _z_n_msg_request_t__bindgen_ty_2::_put"]
        [::core::mem::offset_of!(_z_n_msg_request_t__bindgen_ty_2, _put) - 0usize];
    ["Offset of field: _z_n_msg_request_t__bindgen_ty_2::_del"]
        [::core::mem::offset_of!(_z_n_msg_request_t__bindgen_ty_2, _del) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_n_msg_request_t"][::core::mem::size_of::<_z_n_msg_request_t>() - 288usize];
    ["Alignment of _z_n_msg_request_t"][::core::mem::align_of::<_z_n_msg_request_t>() - 8usize];
    ["Offset of field: _z_n_msg_request_t::_rid"]
        [::core::mem::offset_of!(_z_n_msg_request_t, _rid) - 0usize];
    ["Offset of field: _z_n_msg_request_t::_key"]
        [::core::mem::offset_of!(_z_n_msg_request_t, _key) - 8usize];
    ["Offset of field: _z_n_msg_request_t::_ext_timestamp"]
        [::core::mem::offset_of!(_z_n_msg_request_t, _ext_timestamp) - 56usize];
    ["Offset of field: _z_n_msg_request_t::_ext_qos"]
        [::core::mem::offset_of!(_z_n_msg_request_t, _ext_qos) - 88usize];
    ["Offset of field: _z_n_msg_request_t::_ext_target"]
        [::core::mem::offset_of!(_z_n_msg_request_t, _ext_target) - 92usize];
    ["Offset of field: _z_n_msg_request_t::_ext_budget"]
        [::core::mem::offset_of!(_z_n_msg_request_t, _ext_budget) - 96usize];
    ["Offset of field: _z_n_msg_request_t::_ext_timeout_ms"]
        [::core::mem::offset_of!(_z_n_msg_request_t, _ext_timeout_ms) - 104usize];
    ["Offset of field: _z_n_msg_request_t::_tag"]
        [::core::mem::offset_of!(_z_n_msg_request_t, _tag) - 112usize];
    ["Offset of field: _z_n_msg_request_t::_body"]
        [::core::mem::offset_of!(_z_n_msg_request_t, _body) - 120usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_n_msg_request_exts_t {
    pub ext_qos: bool,
    pub ext_tstamp: bool,
    pub ext_target: bool,
    pub ext_budget: bool,
    pub ext_timeout_ms: bool,
    pub n: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_n_msg_request_exts_t"][::core::mem::size_of::<_z_n_msg_request_exts_t>() - 6usize];
    ["Alignment of _z_n_msg_request_exts_t"]
        [::core::mem::align_of::<_z_n_msg_request_exts_t>() - 1usize];
    ["Offset of field: _z_n_msg_request_exts_t::ext_qos"]
        [::core::mem::offset_of!(_z_n_msg_request_exts_t, ext_qos) - 0usize];
    ["Offset of field: _z_n_msg_request_exts_t::ext_tstamp"]
        [::core::mem::offset_of!(_z_n_msg_request_exts_t, ext_tstamp) - 1usize];
    ["Offset of field: _z_n_msg_request_exts_t::ext_target"]
        [::core::mem::offset_of!(_z_n_msg_request_exts_t, ext_target) - 2usize];
    ["Offset of field: _z_n_msg_request_exts_t::ext_budget"]
        [::core::mem::offset_of!(_z_n_msg_request_exts_t, ext_budget) - 3usize];
    ["Offset of field: _z_n_msg_request_exts_t::ext_timeout_ms"]
        [::core::mem::offset_of!(_z_n_msg_request_exts_t, ext_timeout_ms) - 4usize];
    ["Offset of field: _z_n_msg_request_exts_t::n"]
        [::core::mem::offset_of!(_z_n_msg_request_exts_t, n) - 5usize];
};
unsafe extern "C" {
    pub fn _z_n_msg_request_needed_exts(msg: *const _z_n_msg_request_t) -> _z_n_msg_request_exts_t;
}
unsafe extern "C" {
    pub fn _z_n_msg_request_clear(msg: *mut _z_n_msg_request_t);
}
pub type _z_push_body_t = _z_reply_body_t;
unsafe extern "C" {
    pub fn _z_push_body_steal(msg: *mut _z_push_body_t) -> _z_push_body_t;
}
unsafe extern "C" {
    pub fn _z_push_body_clear(msg: *mut _z_push_body_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_n_msg_response_final_t {
    pub _request_id: _z_zint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_n_msg_response_final_t"]
        [::core::mem::size_of::<_z_n_msg_response_final_t>() - 8usize];
    ["Alignment of _z_n_msg_response_final_t"]
        [::core::mem::align_of::<_z_n_msg_response_final_t>() - 8usize];
    ["Offset of field: _z_n_msg_response_final_t::_request_id"]
        [::core::mem::offset_of!(_z_n_msg_response_final_t, _request_id) - 0usize];
};
unsafe extern "C" {
    pub fn _z_n_msg_response_final_clear(msg: *mut _z_n_msg_response_final_t);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_n_msg_push_t {
    pub _key: _z_keyexpr_t,
    pub _timestamp: _z_timestamp_t,
    pub _qos: _z_n_qos_t,
    pub _body: _z_push_body_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_n_msg_push_t"][::core::mem::size_of::<_z_n_msg_push_t>() - 256usize];
    ["Alignment of _z_n_msg_push_t"][::core::mem::align_of::<_z_n_msg_push_t>() - 8usize];
    ["Offset of field: _z_n_msg_push_t::_key"]
        [::core::mem::offset_of!(_z_n_msg_push_t, _key) - 0usize];
    ["Offset of field: _z_n_msg_push_t::_timestamp"]
        [::core::mem::offset_of!(_z_n_msg_push_t, _timestamp) - 48usize];
    ["Offset of field: _z_n_msg_push_t::_qos"]
        [::core::mem::offset_of!(_z_n_msg_push_t, _qos) - 80usize];
    ["Offset of field: _z_n_msg_push_t::_body"]
        [::core::mem::offset_of!(_z_n_msg_push_t, _body) - 88usize];
};
unsafe extern "C" {
    pub fn _z_n_msg_push_clear(msg: *mut _z_n_msg_push_t);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_n_msg_response_t {
    pub _ext_timestamp: _z_timestamp_t,
    pub _request_id: _z_zint_t,
    pub _key: _z_keyexpr_t,
    pub _ext_qos: _z_n_qos_t,
    pub _ext_responder: _z_n_msg_response_t__bindgen_ty_1,
    pub _tag: _z_n_msg_response_t__bindgen_ty_2,
    pub _body: _z_n_msg_response_t__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_n_msg_response_t__bindgen_ty_1 {
    pub _zid: _z_id_t,
    pub _eid: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_n_msg_response_t__bindgen_ty_1"]
        [::core::mem::size_of::<_z_n_msg_response_t__bindgen_ty_1>() - 20usize];
    ["Alignment of _z_n_msg_response_t__bindgen_ty_1"]
        [::core::mem::align_of::<_z_n_msg_response_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: _z_n_msg_response_t__bindgen_ty_1::_zid"]
        [::core::mem::offset_of!(_z_n_msg_response_t__bindgen_ty_1, _zid) - 0usize];
    ["Offset of field: _z_n_msg_response_t__bindgen_ty_1::_eid"]
        [::core::mem::offset_of!(_z_n_msg_response_t__bindgen_ty_1, _eid) - 16usize];
};
pub const _z_n_msg_response_t__Z_RESPONSE_BODY_REPLY: _z_n_msg_response_t__bindgen_ty_2 = 0;
pub const _z_n_msg_response_t__Z_RESPONSE_BODY_ERR: _z_n_msg_response_t__bindgen_ty_2 = 1;
pub type _z_n_msg_response_t__bindgen_ty_2 = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _z_n_msg_response_t__bindgen_ty_3 {
    pub _reply: _z_msg_reply_t,
    pub _err: _z_msg_err_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_n_msg_response_t__bindgen_ty_3"]
        [::core::mem::size_of::<_z_n_msg_response_t__bindgen_ty_3>() - 176usize];
    ["Alignment of _z_n_msg_response_t__bindgen_ty_3"]
        [::core::mem::align_of::<_z_n_msg_response_t__bindgen_ty_3>() - 8usize];
    ["Offset of field: _z_n_msg_response_t__bindgen_ty_3::_reply"]
        [::core::mem::offset_of!(_z_n_msg_response_t__bindgen_ty_3, _reply) - 0usize];
    ["Offset of field: _z_n_msg_response_t__bindgen_ty_3::_err"]
        [::core::mem::offset_of!(_z_n_msg_response_t__bindgen_ty_3, _err) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_n_msg_response_t"][::core::mem::size_of::<_z_n_msg_response_t>() - 296usize];
    ["Alignment of _z_n_msg_response_t"][::core::mem::align_of::<_z_n_msg_response_t>() - 8usize];
    ["Offset of field: _z_n_msg_response_t::_ext_timestamp"]
        [::core::mem::offset_of!(_z_n_msg_response_t, _ext_timestamp) - 0usize];
    ["Offset of field: _z_n_msg_response_t::_request_id"]
        [::core::mem::offset_of!(_z_n_msg_response_t, _request_id) - 32usize];
    ["Offset of field: _z_n_msg_response_t::_key"]
        [::core::mem::offset_of!(_z_n_msg_response_t, _key) - 40usize];
    ["Offset of field: _z_n_msg_response_t::_ext_qos"]
        [::core::mem::offset_of!(_z_n_msg_response_t, _ext_qos) - 88usize];
    ["Offset of field: _z_n_msg_response_t::_ext_responder"]
        [::core::mem::offset_of!(_z_n_msg_response_t, _ext_responder) - 92usize];
    ["Offset of field: _z_n_msg_response_t::_tag"]
        [::core::mem::offset_of!(_z_n_msg_response_t, _tag) - 112usize];
    ["Offset of field: _z_n_msg_response_t::_body"]
        [::core::mem::offset_of!(_z_n_msg_response_t, _body) - 120usize];
};
unsafe extern "C" {
    pub fn _z_n_msg_response_clear(msg: *mut _z_n_msg_response_t);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_n_msg_declare_t {
    pub _decl: _z_declaration_t,
    pub _ext_timestamp: _z_timestamp_t,
    pub _ext_qos: _z_n_qos_t,
    pub _interest_id: u32,
    pub has_interest_id: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_n_msg_declare_t"][::core::mem::size_of::<_z_n_msg_declare_t>() - 112usize];
    ["Alignment of _z_n_msg_declare_t"][::core::mem::align_of::<_z_n_msg_declare_t>() - 8usize];
    ["Offset of field: _z_n_msg_declare_t::_decl"]
        [::core::mem::offset_of!(_z_n_msg_declare_t, _decl) - 0usize];
    ["Offset of field: _z_n_msg_declare_t::_ext_timestamp"]
        [::core::mem::offset_of!(_z_n_msg_declare_t, _ext_timestamp) - 64usize];
    ["Offset of field: _z_n_msg_declare_t::_ext_qos"]
        [::core::mem::offset_of!(_z_n_msg_declare_t, _ext_qos) - 96usize];
    ["Offset of field: _z_n_msg_declare_t::_interest_id"]
        [::core::mem::offset_of!(_z_n_msg_declare_t, _interest_id) - 100usize];
    ["Offset of field: _z_n_msg_declare_t::has_interest_id"]
        [::core::mem::offset_of!(_z_n_msg_declare_t, has_interest_id) - 104usize];
};
#[doc = " Flags:\n - C: Current       If C==1 then interest concerns current declarations\n - F: Future        If F==1 then interest concerns future declarations\n - Z: Extension     If Z==1 then Zenoh extensions are present\n If C==0 and F==0, then interest is final\n\n 7 6 5 4 3 2 1 0\n +-+-+-+-+-+-+-+-+\n |Z|F|C|INTEREST |\n +-+-+-+---------+\n ~    id:z32     ~\n +---------------+\n |A|M|N|R|T|Q|S|K|  (*) if interest is not final\n +---------------+\n ~ key_scope:z16 ~  if interest is not final && R==1\n +---------------+\n ~  key_suffix   ~  if interest is not final && R==1 && N==1 -- <u8;z16>\n +---------------+\n ~  [int_exts]   ~  if Z==1\n +---------------+\n\n (*) - if K==1 then the interest refers to key expressions\n     - if S==1 then the interest refers to subscribers\n     - if Q==1 then the interest refers to queryables\n     - if T==1 then the interest refers to tokens\n     - if R==1 then the interest is restricted to the matching key expression, else it is for all key expressions.\n     - if N==1 then the key expr has name/suffix. If R==0 then N should be set to 0.\n     - if M==1 then key expr mapping is the one declared by the sender, else it is the one declared by the receiver.\n               If R==0 then M should be set to 0.\n     - if A==1 then the replies SHOULD be aggregated\n ```"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_n_msg_interest_t {
    pub _interest: _z_interest_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_n_msg_interest_t"][::core::mem::size_of::<_z_n_msg_interest_t>() - 56usize];
    ["Alignment of _z_n_msg_interest_t"][::core::mem::align_of::<_z_n_msg_interest_t>() - 8usize];
    ["Offset of field: _z_n_msg_interest_t::_interest"]
        [::core::mem::offset_of!(_z_n_msg_interest_t, _interest) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _z_network_body_t {
    pub _declare: _z_n_msg_declare_t,
    pub _push: _z_n_msg_push_t,
    pub _request: _z_n_msg_request_t,
    pub _response: _z_n_msg_response_t,
    pub _response_final: _z_n_msg_response_final_t,
    pub _interest: _z_n_msg_interest_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_network_body_t"][::core::mem::size_of::<_z_network_body_t>() - 296usize];
    ["Alignment of _z_network_body_t"][::core::mem::align_of::<_z_network_body_t>() - 8usize];
    ["Offset of field: _z_network_body_t::_declare"]
        [::core::mem::offset_of!(_z_network_body_t, _declare) - 0usize];
    ["Offset of field: _z_network_body_t::_push"]
        [::core::mem::offset_of!(_z_network_body_t, _push) - 0usize];
    ["Offset of field: _z_network_body_t::_request"]
        [::core::mem::offset_of!(_z_network_body_t, _request) - 0usize];
    ["Offset of field: _z_network_body_t::_response"]
        [::core::mem::offset_of!(_z_network_body_t, _response) - 0usize];
    ["Offset of field: _z_network_body_t::_response_final"]
        [::core::mem::offset_of!(_z_network_body_t, _response_final) - 0usize];
    ["Offset of field: _z_network_body_t::_interest"]
        [::core::mem::offset_of!(_z_network_body_t, _interest) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_network_message_t {
    pub _tag: _z_network_message_t__bindgen_ty_1,
    pub _body: _z_network_body_t,
    pub _reliability: z_reliability_t,
}
pub const _z_network_message_t__Z_N_DECLARE: _z_network_message_t__bindgen_ty_1 = 0;
pub const _z_network_message_t__Z_N_PUSH: _z_network_message_t__bindgen_ty_1 = 1;
pub const _z_network_message_t__Z_N_REQUEST: _z_network_message_t__bindgen_ty_1 = 2;
pub const _z_network_message_t__Z_N_RESPONSE: _z_network_message_t__bindgen_ty_1 = 3;
pub const _z_network_message_t__Z_N_RESPONSE_FINAL: _z_network_message_t__bindgen_ty_1 = 4;
pub const _z_network_message_t__Z_N_INTEREST: _z_network_message_t__bindgen_ty_1 = 5;
pub type _z_network_message_t__bindgen_ty_1 = ::core::ffi::c_uint;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_network_message_t"][::core::mem::size_of::<_z_network_message_t>() - 312usize];
    ["Alignment of _z_network_message_t"][::core::mem::align_of::<_z_network_message_t>() - 8usize];
    ["Offset of field: _z_network_message_t::_tag"]
        [::core::mem::offset_of!(_z_network_message_t, _tag) - 0usize];
    ["Offset of field: _z_network_message_t::_body"]
        [::core::mem::offset_of!(_z_network_message_t, _body) - 8usize];
    ["Offset of field: _z_network_message_t::_reliability"]
        [::core::mem::offset_of!(_z_network_message_t, _reliability) - 304usize];
};
pub type _z_zenoh_message_t = _z_network_message_t;
unsafe extern "C" {
    pub fn _z_n_msg_clear(m: *mut _z_network_message_t);
}
unsafe extern "C" {
    pub fn _z_n_msg_free(m: *mut *mut _z_network_message_t);
}
unsafe extern "C" {
    pub fn _z_n_msg_copy(
        dst: *mut _z_network_message_t,
        src: *const _z_network_message_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_n_msg_clone(src: *const _z_network_message_t) -> *mut _z_network_message_t;
}
pub type _z_network_message_eq_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_network_message_t,
        right: *const _z_network_message_t,
    ) -> bool,
>;
pub type _z_network_message_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_network_message_t,
        right: *const _z_network_message_t,
    ) -> ::core::ffi::c_int,
>;
#[doc = " A dynamically allocated vector. Elements are stored by value."]
pub type _z_network_message_svec_t = _z_svec_t;
pub type _z_network_message_slist_t = _z_slist_t;
unsafe extern "C" {
    pub fn _z_n_msg_make_response_final(msg: *mut _z_network_message_t, rid: _z_zint_t);
}
unsafe extern "C" {
    pub fn _z_n_msg_make_declare(
        msg: *mut _z_network_message_t,
        declaration: _z_declaration_t,
        has_interest_id: bool,
        interest_id: u32,
    );
}
unsafe extern "C" {
    pub fn _z_n_msg_make_query(
        msg: *mut _z_zenoh_message_t,
        key: *const _z_keyexpr_t,
        parameters: *const _z_slice_t,
        qid: _z_zint_t,
        reliability: z_reliability_t,
        consolidation: z_consolidation_mode_t,
        payload: *const _z_bytes_t,
        encoding: *const _z_encoding_t,
        timeout_ms: u64,
        attachment: *const _z_bytes_t,
        qos: _z_n_qos_t,
        source_info: *const _z_source_info_t,
    );
}
unsafe extern "C" {
    pub fn _z_n_msg_make_push_put(
        dst: *mut _z_network_message_t,
        key: *const _z_keyexpr_t,
        payload: *const _z_bytes_t,
        encoding: *const _z_encoding_t,
        qos: _z_n_qos_t,
        timestamp: *const _z_timestamp_t,
        attachment: *const _z_bytes_t,
        reliability: z_reliability_t,
        source_info: *const _z_source_info_t,
    );
}
unsafe extern "C" {
    pub fn _z_n_msg_make_push_del(
        dst: *mut _z_network_message_t,
        key: *const _z_keyexpr_t,
        qos: _z_n_qos_t,
        timestamp: *const _z_timestamp_t,
        reliability: z_reliability_t,
        source_info: *const _z_source_info_t,
    );
}
unsafe extern "C" {
    pub fn _z_n_msg_make_reply_ok_put(
        dst: *mut _z_network_message_t,
        zid: *const _z_id_t,
        rid: _z_zint_t,
        key: *const _z_keyexpr_t,
        reliability: z_reliability_t,
        consolidation: z_consolidation_mode_t,
        qos: _z_n_qos_t,
        timestamp: *const _z_timestamp_t,
        source_info: *const _z_source_info_t,
        payload: *const _z_bytes_t,
        encoding: *const _z_encoding_t,
        attachment: *const _z_bytes_t,
    );
}
unsafe extern "C" {
    pub fn _z_n_msg_make_reply_ok_del(
        dst: *mut _z_network_message_t,
        zid: *const _z_id_t,
        rid: _z_zint_t,
        key: *const _z_keyexpr_t,
        reliability: z_reliability_t,
        consolidation: z_consolidation_mode_t,
        qos: _z_n_qos_t,
        timestamp: *const _z_timestamp_t,
        source_info: *const _z_source_info_t,
        attachment: *const _z_bytes_t,
    );
}
unsafe extern "C" {
    pub fn _z_n_msg_make_reply_err(
        dst: *mut _z_network_message_t,
        zid: *const _z_id_t,
        rid: _z_zint_t,
        reliability: z_reliability_t,
        qos: _z_n_qos_t,
        payload: *const _z_bytes_t,
        encoding: *const _z_encoding_t,
        source_info: *const _z_source_info_t,
    );
}
unsafe extern "C" {
    pub fn _z_n_msg_make_interest(msg: *mut _z_network_message_t, interest: _z_interest_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_locator_t {
    pub _metadata: _z_str_intmap_t,
    pub _protocol: _z_string_t,
    pub _address: _z_string_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_locator_t"][::core::mem::size_of::<_z_locator_t>() - 96usize];
    ["Alignment of _z_locator_t"][::core::mem::align_of::<_z_locator_t>() - 8usize];
    ["Offset of field: _z_locator_t::_metadata"]
        [::core::mem::offset_of!(_z_locator_t, _metadata) - 0usize];
    ["Offset of field: _z_locator_t::_protocol"]
        [::core::mem::offset_of!(_z_locator_t, _protocol) - 32usize];
    ["Offset of field: _z_locator_t::_address"]
        [::core::mem::offset_of!(_z_locator_t, _address) - 64usize];
};
unsafe extern "C" {
    pub fn _z_locator_eq(left: *const _z_locator_t, right: *const _z_locator_t) -> bool;
}
unsafe extern "C" {
    pub fn _z_locator_init(locator: *mut _z_locator_t);
}
unsafe extern "C" {
    pub fn _z_locator_to_string(loc: *const _z_locator_t) -> _z_string_t;
}
unsafe extern "C" {
    pub fn _z_locator_from_string(lc: *mut _z_locator_t, s: *const _z_string_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_locator_size(lc: *mut _z_locator_t) -> usize;
}
unsafe extern "C" {
    pub fn _z_locator_clear(lc: *mut _z_locator_t);
}
pub type _z_locator_eq_f = ::core::option::Option<
    unsafe extern "C" fn(left: *const _z_locator_t, right: *const _z_locator_t) -> bool,
>;
pub type _z_locator_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_locator_t,
        right: *const _z_locator_t,
    ) -> ::core::ffi::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_locator_array_t {
    pub _len: usize,
    pub _val: *mut _z_locator_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_locator_array_t"][::core::mem::size_of::<_z_locator_array_t>() - 16usize];
    ["Alignment of _z_locator_array_t"][::core::mem::align_of::<_z_locator_array_t>() - 8usize];
    ["Offset of field: _z_locator_array_t::_len"]
        [::core::mem::offset_of!(_z_locator_array_t, _len) - 0usize];
    ["Offset of field: _z_locator_array_t::_val"]
        [::core::mem::offset_of!(_z_locator_array_t, _val) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_endpoint_t {
    pub _locator: _z_locator_t,
    pub _config: _z_str_intmap_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_endpoint_t"][::core::mem::size_of::<_z_endpoint_t>() - 128usize];
    ["Alignment of _z_endpoint_t"][::core::mem::align_of::<_z_endpoint_t>() - 8usize];
    ["Offset of field: _z_endpoint_t::_locator"]
        [::core::mem::offset_of!(_z_endpoint_t, _locator) - 0usize];
    ["Offset of field: _z_endpoint_t::_config"]
        [::core::mem::offset_of!(_z_endpoint_t, _config) - 96usize];
};
unsafe extern "C" {
    pub fn _z_endpoint_to_string(e: *const _z_endpoint_t) -> _z_string_t;
}
unsafe extern "C" {
    pub fn _z_endpoint_from_string(ep: *mut _z_endpoint_t, s: *const _z_string_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_endpoint_clear(ep: *mut _z_endpoint_t);
}
unsafe extern "C" {
    pub fn _z_endpoint_free(ep: *mut *mut _z_endpoint_t);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_tcp_socket_t {
    pub _sock: _z_sys_net_socket_t,
    pub _rep: _z_sys_net_endpoint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_tcp_socket_t"][::core::mem::size_of::<_z_tcp_socket_t>() - 16usize];
    ["Alignment of _z_tcp_socket_t"][::core::mem::align_of::<_z_tcp_socket_t>() - 8usize];
    ["Offset of field: _z_tcp_socket_t::_sock"]
        [::core::mem::offset_of!(_z_tcp_socket_t, _sock) - 0usize];
    ["Offset of field: _z_tcp_socket_t::_rep"]
        [::core::mem::offset_of!(_z_tcp_socket_t, _rep) - 8usize];
};
unsafe extern "C" {
    pub fn _z_create_endpoint_tcp(
        ep: *mut _z_sys_net_endpoint_t,
        s_address: *const ::core::ffi::c_char,
        s_port: *const ::core::ffi::c_char,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_free_endpoint_tcp(ep: *mut _z_sys_net_endpoint_t);
}
unsafe extern "C" {
    pub fn _z_open_tcp(
        sock: *mut _z_sys_net_socket_t,
        rep: _z_sys_net_endpoint_t,
        tout: u32,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_listen_tcp(sock: *mut _z_sys_net_socket_t, rep: _z_sys_net_endpoint_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_close_tcp(sock: *mut _z_sys_net_socket_t);
}
unsafe extern "C" {
    pub fn _z_read_exact_tcp(sock: _z_sys_net_socket_t, ptr: *mut u8, len: usize) -> usize;
}
unsafe extern "C" {
    pub fn _z_read_tcp(sock: _z_sys_net_socket_t, ptr: *mut u8, len: usize) -> usize;
}
unsafe extern "C" {
    pub fn _z_send_tcp(sock: _z_sys_net_socket_t, ptr: *const u8, len: usize) -> usize;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_udp_socket_t {
    pub _sock: _z_sys_net_socket_t,
    pub _msock: _z_sys_net_socket_t,
    pub _rep: _z_sys_net_endpoint_t,
    pub _lep: _z_sys_net_endpoint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_udp_socket_t"][::core::mem::size_of::<_z_udp_socket_t>() - 24usize];
    ["Alignment of _z_udp_socket_t"][::core::mem::align_of::<_z_udp_socket_t>() - 8usize];
    ["Offset of field: _z_udp_socket_t::_sock"]
        [::core::mem::offset_of!(_z_udp_socket_t, _sock) - 0usize];
    ["Offset of field: _z_udp_socket_t::_msock"]
        [::core::mem::offset_of!(_z_udp_socket_t, _msock) - 4usize];
    ["Offset of field: _z_udp_socket_t::_rep"]
        [::core::mem::offset_of!(_z_udp_socket_t, _rep) - 8usize];
    ["Offset of field: _z_udp_socket_t::_lep"]
        [::core::mem::offset_of!(_z_udp_socket_t, _lep) - 16usize];
};
unsafe extern "C" {
    pub fn _z_create_endpoint_udp(
        ep: *mut _z_sys_net_endpoint_t,
        s_address: *const ::core::ffi::c_char,
        s_port: *const ::core::ffi::c_char,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_free_endpoint_udp(ep: *mut _z_sys_net_endpoint_t);
}
unsafe extern "C" {
    pub fn _z_open_udp_unicast(
        sock: *mut _z_sys_net_socket_t,
        rep: _z_sys_net_endpoint_t,
        tout: u32,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_listen_udp_unicast(
        sock: *mut _z_sys_net_socket_t,
        rep: _z_sys_net_endpoint_t,
        tout: u32,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_close_udp_unicast(sock: *mut _z_sys_net_socket_t);
}
unsafe extern "C" {
    pub fn _z_read_exact_udp_unicast(sock: _z_sys_net_socket_t, ptr: *mut u8, len: usize) -> usize;
}
unsafe extern "C" {
    pub fn _z_read_udp_unicast(sock: _z_sys_net_socket_t, ptr: *mut u8, len: usize) -> usize;
}
unsafe extern "C" {
    pub fn _z_send_udp_unicast(
        sock: _z_sys_net_socket_t,
        ptr: *const u8,
        len: usize,
        rep: _z_sys_net_endpoint_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _z_open_udp_multicast(
        sock: *mut _z_sys_net_socket_t,
        rep: _z_sys_net_endpoint_t,
        lep: *mut _z_sys_net_endpoint_t,
        tout: u32,
        iface: *const ::core::ffi::c_char,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_listen_udp_multicast(
        sock: *mut _z_sys_net_socket_t,
        rep: _z_sys_net_endpoint_t,
        tout: u32,
        iface: *const ::core::ffi::c_char,
        join: *const ::core::ffi::c_char,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_close_udp_multicast(
        sockrecv: *mut _z_sys_net_socket_t,
        socksend: *mut _z_sys_net_socket_t,
        rep: _z_sys_net_endpoint_t,
        lep: _z_sys_net_endpoint_t,
    );
}
unsafe extern "C" {
    pub fn _z_read_exact_udp_multicast(
        sock: _z_sys_net_socket_t,
        ptr: *mut u8,
        len: usize,
        lep: _z_sys_net_endpoint_t,
        ep: *mut _z_slice_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _z_read_udp_multicast(
        sock: _z_sys_net_socket_t,
        ptr: *mut u8,
        len: usize,
        lep: _z_sys_net_endpoint_t,
        ep: *mut _z_slice_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _z_send_udp_multicast(
        sock: _z_sys_net_socket_t,
        ptr: *const u8,
        len: usize,
        rep: _z_sys_net_endpoint_t,
    ) -> usize;
}
pub const _z_link_cap_transport_t_Z_LINK_CAP_TRANSPORT_UNICAST: _z_link_cap_transport_t = 0;
pub const _z_link_cap_transport_t_Z_LINK_CAP_TRANSPORT_MULTICAST: _z_link_cap_transport_t = 1;
pub const _z_link_cap_transport_t_Z_LINK_CAP_TRANSPORT_RAWETH: _z_link_cap_transport_t = 2;
#[doc = " Link transport capability enum.\n\n Enumerators:\n     Z_LINK_CAP_TRANSPORT_UNICAST: Link has unicast capabilities.\n     Z_LINK_CAP_TRANSPORT_MULTICAST: Link has multicast capabilities."]
pub type _z_link_cap_transport_t = ::core::ffi::c_uint;
pub const _z_link_cap_flow_t_Z_LINK_CAP_FLOW_DATAGRAM: _z_link_cap_flow_t = 0;
pub const _z_link_cap_flow_t_Z_LINK_CAP_FLOW_STREAM: _z_link_cap_flow_t = 1;
#[doc = " Link flow capability enum.\n\n Enumerators:\n     Z_LINK_CAP_FLOW_STREAM: Link use datagrams.\n     Z_LINK_CAP_FLOW_DATAGRAM: Link use byte stream."]
pub type _z_link_cap_flow_t = ::core::ffi::c_uint;
#[doc = " Link capabilities, stored as a register-like object.\n\n Fields:\n     transport: 2 bits, see _z_link_cap_transport_t enum.\n     flow: 1 bit, see _z_link_cap_flow_t enum.\n     reliable: 1 bit, 1 if the link is reliable (network definition)\n     reserved: 4 bits, reserved for future use"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_link_capabilities_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_link_capabilities_t"][::core::mem::size_of::<_z_link_capabilities_t>() - 1usize];
    ["Alignment of _z_link_capabilities_t"]
        [::core::mem::align_of::<_z_link_capabilities_t>() - 1usize];
};
impl _z_link_capabilities_t {
    #[inline]
    pub fn _transport(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set__transport(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _transport_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set__transport_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _flow(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set__flow(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _flow_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set__flow_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _is_reliable(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set__is_reliable(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _is_reliable_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set__is_reliable_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn _reserved(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set__reserved(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn _reserved_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                4u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set__reserved_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        _transport: u8,
        _flow: u8,
        _is_reliable: u8,
        _reserved: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let _transport: u8 = unsafe { ::core::mem::transmute(_transport) };
            _transport as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let _flow: u8 = unsafe { ::core::mem::transmute(_flow) };
            _flow as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let _is_reliable: u8 = unsafe { ::core::mem::transmute(_is_reliable) };
            _is_reliable as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let _reserved: u8 = unsafe { ::core::mem::transmute(_reserved) };
            _reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type _z_f_link_open =
    ::core::option::Option<unsafe extern "C" fn(self_: *mut _z_link_t) -> z_result_t>;
pub type _z_f_link_listen =
    ::core::option::Option<unsafe extern "C" fn(self_: *mut _z_link_t) -> z_result_t>;
pub type _z_f_link_close = ::core::option::Option<unsafe extern "C" fn(self_: *mut _z_link_t)>;
pub type _z_f_link_write = ::core::option::Option<
    unsafe extern "C" fn(
        self_: *const _z_link_t,
        ptr: *const u8,
        len: usize,
        socket: *mut _z_sys_net_socket_t,
    ) -> usize,
>;
pub type _z_f_link_write_all = ::core::option::Option<
    unsafe extern "C" fn(self_: *const _z_link_t, ptr: *const u8, len: usize) -> usize,
>;
pub type _z_f_link_read = ::core::option::Option<
    unsafe extern "C" fn(
        self_: *const _z_link_t,
        ptr: *mut u8,
        len: usize,
        addr: *mut _z_slice_t,
    ) -> usize,
>;
pub type _z_f_link_read_exact = ::core::option::Option<
    unsafe extern "C" fn(
        self_: *const _z_link_t,
        ptr: *mut u8,
        len: usize,
        addr: *mut _z_slice_t,
        socket: *mut _z_sys_net_socket_t,
    ) -> usize,
>;
pub type _z_f_link_read_socket = ::core::option::Option<
    unsafe extern "C" fn(socket: _z_sys_net_socket_t, ptr: *mut u8, len: usize) -> usize,
>;
pub type _z_f_link_free = ::core::option::Option<unsafe extern "C" fn(self_: *mut _z_link_t)>;
pub const _z_link_type_e__Z_LINK_TYPE_TCP: _z_link_type_e = 0;
pub const _z_link_type_e__Z_LINK_TYPE_UDP: _z_link_type_e = 1;
pub const _z_link_type_e__Z_LINK_TYPE_BT: _z_link_type_e = 2;
pub const _z_link_type_e__Z_LINK_TYPE_SERIAL: _z_link_type_e = 3;
pub const _z_link_type_e__Z_LINK_TYPE_WS: _z_link_type_e = 4;
pub const _z_link_type_e__Z_LINK_TYPE_RAWETH: _z_link_type_e = 5;
pub type _z_link_type_e = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_link_t {
    pub _endpoint: _z_endpoint_t,
    pub _type: ::core::ffi::c_int,
    pub _socket: _z_link_t__bindgen_ty_1,
    pub _open_f: _z_f_link_open,
    pub _listen_f: _z_f_link_listen,
    pub _close_f: _z_f_link_close,
    pub _write_f: _z_f_link_write,
    pub _write_all_f: _z_f_link_write_all,
    pub _read_f: _z_f_link_read,
    pub _read_exact_f: _z_f_link_read_exact,
    pub _read_socket_f: _z_f_link_read_socket,
    pub _free_f: _z_f_link_free,
    pub _mtu: u16,
    pub _cap: _z_link_capabilities_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _z_link_t__bindgen_ty_1 {
    pub _tcp: _z_tcp_socket_t,
    pub _udp: _z_udp_socket_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_link_t__bindgen_ty_1"]
        [::core::mem::size_of::<_z_link_t__bindgen_ty_1>() - 24usize];
    ["Alignment of _z_link_t__bindgen_ty_1"]
        [::core::mem::align_of::<_z_link_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: _z_link_t__bindgen_ty_1::_tcp"]
        [::core::mem::offset_of!(_z_link_t__bindgen_ty_1, _tcp) - 0usize];
    ["Offset of field: _z_link_t__bindgen_ty_1::_udp"]
        [::core::mem::offset_of!(_z_link_t__bindgen_ty_1, _udp) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_link_t"][::core::mem::size_of::<_z_link_t>() - 240usize];
    ["Alignment of _z_link_t"][::core::mem::align_of::<_z_link_t>() - 8usize];
    ["Offset of field: _z_link_t::_endpoint"]
        [::core::mem::offset_of!(_z_link_t, _endpoint) - 0usize];
    ["Offset of field: _z_link_t::_type"][::core::mem::offset_of!(_z_link_t, _type) - 128usize];
    ["Offset of field: _z_link_t::_socket"][::core::mem::offset_of!(_z_link_t, _socket) - 136usize];
    ["Offset of field: _z_link_t::_open_f"][::core::mem::offset_of!(_z_link_t, _open_f) - 160usize];
    ["Offset of field: _z_link_t::_listen_f"]
        [::core::mem::offset_of!(_z_link_t, _listen_f) - 168usize];
    ["Offset of field: _z_link_t::_close_f"]
        [::core::mem::offset_of!(_z_link_t, _close_f) - 176usize];
    ["Offset of field: _z_link_t::_write_f"]
        [::core::mem::offset_of!(_z_link_t, _write_f) - 184usize];
    ["Offset of field: _z_link_t::_write_all_f"]
        [::core::mem::offset_of!(_z_link_t, _write_all_f) - 192usize];
    ["Offset of field: _z_link_t::_read_f"][::core::mem::offset_of!(_z_link_t, _read_f) - 200usize];
    ["Offset of field: _z_link_t::_read_exact_f"]
        [::core::mem::offset_of!(_z_link_t, _read_exact_f) - 208usize];
    ["Offset of field: _z_link_t::_read_socket_f"]
        [::core::mem::offset_of!(_z_link_t, _read_socket_f) - 216usize];
    ["Offset of field: _z_link_t::_free_f"][::core::mem::offset_of!(_z_link_t, _free_f) - 224usize];
    ["Offset of field: _z_link_t::_mtu"][::core::mem::offset_of!(_z_link_t, _mtu) - 232usize];
    ["Offset of field: _z_link_t::_cap"][::core::mem::offset_of!(_z_link_t, _cap) - 234usize];
};
unsafe extern "C" {
    pub fn _z_link_clear(zl: *mut _z_link_t);
}
unsafe extern "C" {
    pub fn _z_link_free(zl: *mut *mut _z_link_t);
}
unsafe extern "C" {
    pub fn _z_open_socket(
        locator: *const _z_string_t,
        socket: *mut _z_sys_net_socket_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_open_link(zl: *mut _z_link_t, locator: *const _z_string_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_listen_link(zl: *mut _z_link_t, locator: *const _z_string_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_link_send_wbuf(
        zl: *const _z_link_t,
        wbf: *const _z_wbuf_t,
        socket: *mut _z_sys_net_socket_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_link_recv_zbuf(
        zl: *const _z_link_t,
        zbf: *mut _z_zbuf_t,
        addr: *mut _z_slice_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _z_link_recv_exact_zbuf(
        zl: *const _z_link_t,
        zbf: *mut _z_zbuf_t,
        len: usize,
        addr: *mut _z_slice_t,
        socket: *mut _z_sys_net_socket_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _z_link_socket_recv_zbuf(
        link: *const _z_link_t,
        zbf: *mut _z_zbuf_t,
        socket: _z_sys_net_socket_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _z_link_get_socket(link: *const _z_link_t) -> *const _z_sys_net_socket_t;
}
unsafe extern "C" {
    pub fn _z_endpoint_tcp_valid(ep: *mut _z_endpoint_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_new_peer_tcp(
        endpoint: *mut _z_endpoint_t,
        socket: *mut _z_sys_net_socket_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_new_link_tcp(zl: *mut _z_link_t, ep: *mut _z_endpoint_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_endpoint_udp_unicast_valid(ep: *mut _z_endpoint_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_new_link_udp_unicast(zl: *mut _z_link_t, ep: _z_endpoint_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_endpoint_udp_multicast_valid(ep: *mut _z_endpoint_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_new_link_udp_multicast(zl: *mut _z_link_t, ep: _z_endpoint_t) -> z_result_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_s_msg_scout_t {
    pub _zid: _z_id_t,
    pub _what: z_what_t,
    pub _version: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_s_msg_scout_t"][::core::mem::size_of::<_z_s_msg_scout_t>() - 24usize];
    ["Alignment of _z_s_msg_scout_t"][::core::mem::align_of::<_z_s_msg_scout_t>() - 4usize];
    ["Offset of field: _z_s_msg_scout_t::_zid"]
        [::core::mem::offset_of!(_z_s_msg_scout_t, _zid) - 0usize];
    ["Offset of field: _z_s_msg_scout_t::_what"]
        [::core::mem::offset_of!(_z_s_msg_scout_t, _what) - 16usize];
    ["Offset of field: _z_s_msg_scout_t::_version"]
        [::core::mem::offset_of!(_z_s_msg_scout_t, _version) - 20usize];
};
unsafe extern "C" {
    pub fn _z_s_msg_scout_clear(msg: *mut _z_s_msg_scout_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_s_msg_hello_t {
    pub _zid: _z_id_t,
    pub _locators: _z_locator_array_t,
    pub _whatami: z_whatami_t,
    pub _version: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_s_msg_hello_t"][::core::mem::size_of::<_z_s_msg_hello_t>() - 40usize];
    ["Alignment of _z_s_msg_hello_t"][::core::mem::align_of::<_z_s_msg_hello_t>() - 8usize];
    ["Offset of field: _z_s_msg_hello_t::_zid"]
        [::core::mem::offset_of!(_z_s_msg_hello_t, _zid) - 0usize];
    ["Offset of field: _z_s_msg_hello_t::_locators"]
        [::core::mem::offset_of!(_z_s_msg_hello_t, _locators) - 16usize];
    ["Offset of field: _z_s_msg_hello_t::_whatami"]
        [::core::mem::offset_of!(_z_s_msg_hello_t, _whatami) - 32usize];
    ["Offset of field: _z_s_msg_hello_t::_version"]
        [::core::mem::offset_of!(_z_s_msg_hello_t, _version) - 36usize];
};
unsafe extern "C" {
    pub fn _z_s_msg_hello_clear(msg: *mut _z_s_msg_hello_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_coundit_sn_t {
    pub _reliable: _z_zint_t,
    pub _best_effort: _z_zint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_coundit_sn_t"][::core::mem::size_of::<_z_coundit_sn_t>() - 16usize];
    ["Alignment of _z_coundit_sn_t"][::core::mem::align_of::<_z_coundit_sn_t>() - 8usize];
    ["Offset of field: _z_coundit_sn_t::_reliable"]
        [::core::mem::offset_of!(_z_coundit_sn_t, _reliable) - 0usize];
    ["Offset of field: _z_coundit_sn_t::_best_effort"]
        [::core::mem::offset_of!(_z_coundit_sn_t, _best_effort) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_conduit_sn_list_t {
    pub _val: _z_conduit_sn_list_t__bindgen_ty_1,
    pub _is_qos: bool,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _z_conduit_sn_list_t__bindgen_ty_1 {
    pub _plain: _z_coundit_sn_t,
    pub _qos: [_z_coundit_sn_t; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_conduit_sn_list_t__bindgen_ty_1"]
        [::core::mem::size_of::<_z_conduit_sn_list_t__bindgen_ty_1>() - 128usize];
    ["Alignment of _z_conduit_sn_list_t__bindgen_ty_1"]
        [::core::mem::align_of::<_z_conduit_sn_list_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: _z_conduit_sn_list_t__bindgen_ty_1::_plain"]
        [::core::mem::offset_of!(_z_conduit_sn_list_t__bindgen_ty_1, _plain) - 0usize];
    ["Offset of field: _z_conduit_sn_list_t__bindgen_ty_1::_qos"]
        [::core::mem::offset_of!(_z_conduit_sn_list_t__bindgen_ty_1, _qos) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_conduit_sn_list_t"][::core::mem::size_of::<_z_conduit_sn_list_t>() - 136usize];
    ["Alignment of _z_conduit_sn_list_t"][::core::mem::align_of::<_z_conduit_sn_list_t>() - 8usize];
    ["Offset of field: _z_conduit_sn_list_t::_val"]
        [::core::mem::offset_of!(_z_conduit_sn_list_t, _val) - 0usize];
    ["Offset of field: _z_conduit_sn_list_t::_is_qos"]
        [::core::mem::offset_of!(_z_conduit_sn_list_t, _is_qos) - 128usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_t_msg_join_t {
    pub _zid: _z_id_t,
    pub _lease: _z_zint_t,
    pub _next_sn: _z_conduit_sn_list_t,
    pub _batch_size: u16,
    pub _whatami: z_whatami_t,
    pub _req_id_res: u8,
    pub _seq_num_res: u8,
    pub _version: u8,
    pub _patch: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_t_msg_join_t"][::core::mem::size_of::<_z_t_msg_join_t>() - 176usize];
    ["Alignment of _z_t_msg_join_t"][::core::mem::align_of::<_z_t_msg_join_t>() - 8usize];
    ["Offset of field: _z_t_msg_join_t::_zid"]
        [::core::mem::offset_of!(_z_t_msg_join_t, _zid) - 0usize];
    ["Offset of field: _z_t_msg_join_t::_lease"]
        [::core::mem::offset_of!(_z_t_msg_join_t, _lease) - 16usize];
    ["Offset of field: _z_t_msg_join_t::_next_sn"]
        [::core::mem::offset_of!(_z_t_msg_join_t, _next_sn) - 24usize];
    ["Offset of field: _z_t_msg_join_t::_batch_size"]
        [::core::mem::offset_of!(_z_t_msg_join_t, _batch_size) - 160usize];
    ["Offset of field: _z_t_msg_join_t::_whatami"]
        [::core::mem::offset_of!(_z_t_msg_join_t, _whatami) - 164usize];
    ["Offset of field: _z_t_msg_join_t::_req_id_res"]
        [::core::mem::offset_of!(_z_t_msg_join_t, _req_id_res) - 168usize];
    ["Offset of field: _z_t_msg_join_t::_seq_num_res"]
        [::core::mem::offset_of!(_z_t_msg_join_t, _seq_num_res) - 169usize];
    ["Offset of field: _z_t_msg_join_t::_version"]
        [::core::mem::offset_of!(_z_t_msg_join_t, _version) - 170usize];
    ["Offset of field: _z_t_msg_join_t::_patch"]
        [::core::mem::offset_of!(_z_t_msg_join_t, _patch) - 171usize];
};
unsafe extern "C" {
    pub fn _z_t_msg_join_clear(msg: *mut _z_t_msg_join_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_t_msg_init_t {
    pub _zid: _z_id_t,
    pub _cookie: _z_slice_t,
    pub _batch_size: u16,
    pub _whatami: z_whatami_t,
    pub _req_id_res: u8,
    pub _seq_num_res: u8,
    pub _version: u8,
    pub _patch: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_t_msg_init_t"][::core::mem::size_of::<_z_t_msg_init_t>() - 64usize];
    ["Alignment of _z_t_msg_init_t"][::core::mem::align_of::<_z_t_msg_init_t>() - 8usize];
    ["Offset of field: _z_t_msg_init_t::_zid"]
        [::core::mem::offset_of!(_z_t_msg_init_t, _zid) - 0usize];
    ["Offset of field: _z_t_msg_init_t::_cookie"]
        [::core::mem::offset_of!(_z_t_msg_init_t, _cookie) - 16usize];
    ["Offset of field: _z_t_msg_init_t::_batch_size"]
        [::core::mem::offset_of!(_z_t_msg_init_t, _batch_size) - 48usize];
    ["Offset of field: _z_t_msg_init_t::_whatami"]
        [::core::mem::offset_of!(_z_t_msg_init_t, _whatami) - 52usize];
    ["Offset of field: _z_t_msg_init_t::_req_id_res"]
        [::core::mem::offset_of!(_z_t_msg_init_t, _req_id_res) - 56usize];
    ["Offset of field: _z_t_msg_init_t::_seq_num_res"]
        [::core::mem::offset_of!(_z_t_msg_init_t, _seq_num_res) - 57usize];
    ["Offset of field: _z_t_msg_init_t::_version"]
        [::core::mem::offset_of!(_z_t_msg_init_t, _version) - 58usize];
    ["Offset of field: _z_t_msg_init_t::_patch"]
        [::core::mem::offset_of!(_z_t_msg_init_t, _patch) - 59usize];
};
unsafe extern "C" {
    pub fn _z_t_msg_init_clear(msg: *mut _z_t_msg_init_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_t_msg_open_t {
    pub _lease: _z_zint_t,
    pub _initial_sn: _z_zint_t,
    pub _cookie: _z_slice_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_t_msg_open_t"][::core::mem::size_of::<_z_t_msg_open_t>() - 48usize];
    ["Alignment of _z_t_msg_open_t"][::core::mem::align_of::<_z_t_msg_open_t>() - 8usize];
    ["Offset of field: _z_t_msg_open_t::_lease"]
        [::core::mem::offset_of!(_z_t_msg_open_t, _lease) - 0usize];
    ["Offset of field: _z_t_msg_open_t::_initial_sn"]
        [::core::mem::offset_of!(_z_t_msg_open_t, _initial_sn) - 8usize];
    ["Offset of field: _z_t_msg_open_t::_cookie"]
        [::core::mem::offset_of!(_z_t_msg_open_t, _cookie) - 16usize];
};
unsafe extern "C" {
    pub fn _z_t_msg_open_clear(msg: *mut _z_t_msg_open_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_t_msg_close_t {
    pub _reason: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_t_msg_close_t"][::core::mem::size_of::<_z_t_msg_close_t>() - 1usize];
    ["Alignment of _z_t_msg_close_t"][::core::mem::align_of::<_z_t_msg_close_t>() - 1usize];
    ["Offset of field: _z_t_msg_close_t::_reason"]
        [::core::mem::offset_of!(_z_t_msg_close_t, _reason) - 0usize];
};
unsafe extern "C" {
    pub fn _z_t_msg_close_clear(msg: *mut _z_t_msg_close_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_t_msg_keep_alive_t {
    pub __dummy: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_t_msg_keep_alive_t"][::core::mem::size_of::<_z_t_msg_keep_alive_t>() - 1usize];
    ["Alignment of _z_t_msg_keep_alive_t"]
        [::core::mem::align_of::<_z_t_msg_keep_alive_t>() - 1usize];
    ["Offset of field: _z_t_msg_keep_alive_t::__dummy"]
        [::core::mem::offset_of!(_z_t_msg_keep_alive_t, __dummy) - 0usize];
};
unsafe extern "C" {
    pub fn _z_t_msg_keep_alive_clear(msg: *mut _z_t_msg_keep_alive_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_t_msg_frame_t {
    pub _payload: *mut _z_zbuf_t,
    pub _sn: _z_zint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_t_msg_frame_t"][::core::mem::size_of::<_z_t_msg_frame_t>() - 16usize];
    ["Alignment of _z_t_msg_frame_t"][::core::mem::align_of::<_z_t_msg_frame_t>() - 8usize];
    ["Offset of field: _z_t_msg_frame_t::_payload"]
        [::core::mem::offset_of!(_z_t_msg_frame_t, _payload) - 0usize];
    ["Offset of field: _z_t_msg_frame_t::_sn"]
        [::core::mem::offset_of!(_z_t_msg_frame_t, _sn) - 8usize];
};
unsafe extern "C" {
    pub fn _z_t_msg_frame_clear(msg: *mut _z_t_msg_frame_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_t_msg_fragment_t {
    pub _payload: _z_slice_t,
    pub _sn: _z_zint_t,
    pub first: bool,
    pub drop: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_t_msg_fragment_t"][::core::mem::size_of::<_z_t_msg_fragment_t>() - 48usize];
    ["Alignment of _z_t_msg_fragment_t"][::core::mem::align_of::<_z_t_msg_fragment_t>() - 8usize];
    ["Offset of field: _z_t_msg_fragment_t::_payload"]
        [::core::mem::offset_of!(_z_t_msg_fragment_t, _payload) - 0usize];
    ["Offset of field: _z_t_msg_fragment_t::_sn"]
        [::core::mem::offset_of!(_z_t_msg_fragment_t, _sn) - 32usize];
    ["Offset of field: _z_t_msg_fragment_t::first"]
        [::core::mem::offset_of!(_z_t_msg_fragment_t, first) - 40usize];
    ["Offset of field: _z_t_msg_fragment_t::drop"]
        [::core::mem::offset_of!(_z_t_msg_fragment_t, drop) - 41usize];
};
unsafe extern "C" {
    pub fn _z_t_msg_fragment_clear(msg: *mut _z_t_msg_fragment_t);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _z_transport_body_t {
    pub _join: _z_t_msg_join_t,
    pub _init: _z_t_msg_init_t,
    pub _open: _z_t_msg_open_t,
    pub _close: _z_t_msg_close_t,
    pub _keep_alive: _z_t_msg_keep_alive_t,
    pub _frame: _z_t_msg_frame_t,
    pub _fragment: _z_t_msg_fragment_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_transport_body_t"][::core::mem::size_of::<_z_transport_body_t>() - 176usize];
    ["Alignment of _z_transport_body_t"][::core::mem::align_of::<_z_transport_body_t>() - 8usize];
    ["Offset of field: _z_transport_body_t::_join"]
        [::core::mem::offset_of!(_z_transport_body_t, _join) - 0usize];
    ["Offset of field: _z_transport_body_t::_init"]
        [::core::mem::offset_of!(_z_transport_body_t, _init) - 0usize];
    ["Offset of field: _z_transport_body_t::_open"]
        [::core::mem::offset_of!(_z_transport_body_t, _open) - 0usize];
    ["Offset of field: _z_transport_body_t::_close"]
        [::core::mem::offset_of!(_z_transport_body_t, _close) - 0usize];
    ["Offset of field: _z_transport_body_t::_keep_alive"]
        [::core::mem::offset_of!(_z_transport_body_t, _keep_alive) - 0usize];
    ["Offset of field: _z_transport_body_t::_frame"]
        [::core::mem::offset_of!(_z_transport_body_t, _frame) - 0usize];
    ["Offset of field: _z_transport_body_t::_fragment"]
        [::core::mem::offset_of!(_z_transport_body_t, _fragment) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_transport_message_t {
    pub _body: _z_transport_body_t,
    pub _header: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_transport_message_t"][::core::mem::size_of::<_z_transport_message_t>() - 184usize];
    ["Alignment of _z_transport_message_t"]
        [::core::mem::align_of::<_z_transport_message_t>() - 8usize];
    ["Offset of field: _z_transport_message_t::_body"]
        [::core::mem::offset_of!(_z_transport_message_t, _body) - 0usize];
    ["Offset of field: _z_transport_message_t::_header"]
        [::core::mem::offset_of!(_z_transport_message_t, _header) - 176usize];
};
unsafe extern "C" {
    pub fn _z_t_msg_clear(msg: *mut _z_transport_message_t);
}
unsafe extern "C" {
    pub fn _z_t_msg_get_reliability(msg: *mut _z_transport_message_t) -> z_reliability_t;
}
unsafe extern "C" {
    pub fn _z_t_msg_make_join(
        whatami: z_whatami_t,
        lease: _z_zint_t,
        zid: _z_id_t,
        next_sn: _z_conduit_sn_list_t,
    ) -> _z_transport_message_t;
}
unsafe extern "C" {
    pub fn _z_t_msg_make_init_syn(whatami: z_whatami_t, zid: _z_id_t) -> _z_transport_message_t;
}
unsafe extern "C" {
    pub fn _z_t_msg_make_init_ack(
        whatami: z_whatami_t,
        zid: _z_id_t,
        cookie: _z_slice_t,
    ) -> _z_transport_message_t;
}
unsafe extern "C" {
    pub fn _z_t_msg_make_open_syn(
        lease: _z_zint_t,
        initial_sn: _z_zint_t,
        cookie: _z_slice_t,
    ) -> _z_transport_message_t;
}
unsafe extern "C" {
    pub fn _z_t_msg_make_open_ack(
        lease: _z_zint_t,
        initial_sn: _z_zint_t,
    ) -> _z_transport_message_t;
}
unsafe extern "C" {
    pub fn _z_t_msg_make_close(reason: u8, link_only: bool) -> _z_transport_message_t;
}
unsafe extern "C" {
    pub fn _z_t_msg_make_keep_alive() -> _z_transport_message_t;
}
unsafe extern "C" {
    pub fn _z_t_msg_make_frame(
        sn: _z_zint_t,
        payload: *mut _z_zbuf_t,
        reliability: z_reliability_t,
    ) -> _z_transport_message_t;
}
unsafe extern "C" {
    pub fn _z_t_msg_make_frame_header(
        sn: _z_zint_t,
        reliability: z_reliability_t,
    ) -> _z_transport_message_t;
}
unsafe extern "C" {
    pub fn _z_t_msg_make_fragment_header(
        sn: _z_zint_t,
        reliability: z_reliability_t,
        is_last: bool,
        first: bool,
        drop: bool,
    ) -> _z_transport_message_t;
}
unsafe extern "C" {
    pub fn _z_t_msg_make_fragment(
        sn: _z_zint_t,
        messages: _z_slice_t,
        reliability: z_reliability_t,
        is_last: bool,
        first: bool,
        drop: bool,
    ) -> _z_transport_message_t;
}
unsafe extern "C" {
    pub fn _z_t_msg_copy(clone: *mut _z_transport_message_t, msg: *mut _z_transport_message_t);
}
unsafe extern "C" {
    pub fn _z_t_msg_copy_join(clone: *mut _z_t_msg_join_t, msg: *mut _z_t_msg_join_t);
}
unsafe extern "C" {
    pub fn _z_t_msg_copy_init(clone: *mut _z_t_msg_init_t, msg: *mut _z_t_msg_init_t);
}
unsafe extern "C" {
    pub fn _z_t_msg_copy_open(clone: *mut _z_t_msg_open_t, msg: *mut _z_t_msg_open_t);
}
unsafe extern "C" {
    pub fn _z_t_msg_copy_close(clone: *mut _z_t_msg_close_t, msg: *mut _z_t_msg_close_t);
}
unsafe extern "C" {
    pub fn _z_t_msg_copy_keep_alive(
        clone: *mut _z_t_msg_keep_alive_t,
        msg: *mut _z_t_msg_keep_alive_t,
    );
}
unsafe extern "C" {
    pub fn _z_t_msg_copy_frame(clone: *mut _z_t_msg_frame_t, msg: *mut _z_t_msg_frame_t);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _z_scouting_body_t {
    pub _scout: _z_s_msg_scout_t,
    pub _hello: _z_s_msg_hello_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_scouting_body_t"][::core::mem::size_of::<_z_scouting_body_t>() - 40usize];
    ["Alignment of _z_scouting_body_t"][::core::mem::align_of::<_z_scouting_body_t>() - 8usize];
    ["Offset of field: _z_scouting_body_t::_scout"]
        [::core::mem::offset_of!(_z_scouting_body_t, _scout) - 0usize];
    ["Offset of field: _z_scouting_body_t::_hello"]
        [::core::mem::offset_of!(_z_scouting_body_t, _hello) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_scouting_message_t {
    pub _body: _z_scouting_body_t,
    pub _header: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_scouting_message_t"][::core::mem::size_of::<_z_scouting_message_t>() - 48usize];
    ["Alignment of _z_scouting_message_t"]
        [::core::mem::align_of::<_z_scouting_message_t>() - 8usize];
    ["Offset of field: _z_scouting_message_t::_body"]
        [::core::mem::offset_of!(_z_scouting_message_t, _body) - 0usize];
    ["Offset of field: _z_scouting_message_t::_header"]
        [::core::mem::offset_of!(_z_scouting_message_t, _header) - 40usize];
};
unsafe extern "C" {
    pub fn _z_s_msg_clear(msg: *mut _z_scouting_message_t);
}
unsafe extern "C" {
    pub fn _z_s_msg_make_scout(what: z_what_t, zid: _z_id_t) -> _z_scouting_message_t;
}
unsafe extern "C" {
    pub fn _z_s_msg_make_hello(
        whatami: z_whatami_t,
        zid: _z_id_t,
        locators: _z_locator_array_t,
    ) -> _z_scouting_message_t;
}
unsafe extern "C" {
    pub fn _z_s_msg_copy(clone: *mut _z_scouting_message_t, msg: *mut _z_scouting_message_t);
}
unsafe extern "C" {
    pub fn _z_s_msg_copy_scout(clone: *mut _z_s_msg_scout_t, msg: *mut _z_s_msg_scout_t);
}
unsafe extern "C" {
    pub fn _z_s_msg_copy_hello(clone: *mut _z_s_msg_hello_t, msg: *mut _z_s_msg_hello_t);
}
pub const _z_dbuf_state_e__Z_DBUF_STATE_NULL: _z_dbuf_state_e = 0;
pub const _z_dbuf_state_e__Z_DBUF_STATE_INIT: _z_dbuf_state_e = 1;
pub const _z_dbuf_state_e__Z_DBUF_STATE_OVERFLOW: _z_dbuf_state_e = 2;
pub type _z_dbuf_state_e = ::core::ffi::c_uint;
pub const _z_batching_state_e__Z_BATCHING_IDLE: _z_batching_state_e = 0;
pub const _z_batching_state_e__Z_BATCHING_ACTIVE: _z_batching_state_e = 1;
pub type _z_batching_state_e = ::core::ffi::c_uint;
pub type _z_resource_slist_t = _z_slist_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_transport_peer_common_t {
    pub _remote_zid: _z_id_t,
    pub _received: bool,
    pub _remote_resources: *mut _z_resource_slist_t,
    pub _state_reliable: u8,
    pub _state_best_effort: u8,
    pub _dbuf_reliable: _z_wbuf_t,
    pub _dbuf_best_effort: _z_wbuf_t,
    pub _patch: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_transport_peer_common_t"]
        [::core::mem::size_of::<_z_transport_peer_common_t>() - 160usize];
    ["Alignment of _z_transport_peer_common_t"]
        [::core::mem::align_of::<_z_transport_peer_common_t>() - 8usize];
    ["Offset of field: _z_transport_peer_common_t::_remote_zid"]
        [::core::mem::offset_of!(_z_transport_peer_common_t, _remote_zid) - 0usize];
    ["Offset of field: _z_transport_peer_common_t::_received"]
        [::core::mem::offset_of!(_z_transport_peer_common_t, _received) - 16usize];
    ["Offset of field: _z_transport_peer_common_t::_remote_resources"]
        [::core::mem::offset_of!(_z_transport_peer_common_t, _remote_resources) - 24usize];
    ["Offset of field: _z_transport_peer_common_t::_state_reliable"]
        [::core::mem::offset_of!(_z_transport_peer_common_t, _state_reliable) - 32usize];
    ["Offset of field: _z_transport_peer_common_t::_state_best_effort"]
        [::core::mem::offset_of!(_z_transport_peer_common_t, _state_best_effort) - 33usize];
    ["Offset of field: _z_transport_peer_common_t::_dbuf_reliable"]
        [::core::mem::offset_of!(_z_transport_peer_common_t, _dbuf_reliable) - 40usize];
    ["Offset of field: _z_transport_peer_common_t::_dbuf_best_effort"]
        [::core::mem::offset_of!(_z_transport_peer_common_t, _dbuf_best_effort) - 96usize];
    ["Offset of field: _z_transport_peer_common_t::_patch"]
        [::core::mem::offset_of!(_z_transport_peer_common_t, _patch) - 152usize];
};
unsafe extern "C" {
    pub fn _z_transport_peer_common_clear(src: *mut _z_transport_peer_common_t);
}
unsafe extern "C" {
    pub fn _z_transport_peer_common_copy(
        dst: *mut _z_transport_peer_common_t,
        src: *const _z_transport_peer_common_t,
    );
}
unsafe extern "C" {
    pub fn _z_transport_peer_common_eq(
        left: *const _z_transport_peer_common_t,
        right: *const _z_transport_peer_common_t,
    ) -> bool;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_transport_peer_multicast_t {
    pub common: _z_transport_peer_common_t,
    pub _remote_addr: _z_slice_t,
    pub _sn_rx_sns: _z_conduit_sn_list_t,
    pub _sn_res: _z_zint_t,
    pub _lease: _z_zint_t,
    pub _next_lease: _z_zint_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_transport_peer_multicast_t"]
        [::core::mem::size_of::<_z_transport_peer_multicast_t>() - 352usize];
    ["Alignment of _z_transport_peer_multicast_t"]
        [::core::mem::align_of::<_z_transport_peer_multicast_t>() - 8usize];
    ["Offset of field: _z_transport_peer_multicast_t::common"]
        [::core::mem::offset_of!(_z_transport_peer_multicast_t, common) - 0usize];
    ["Offset of field: _z_transport_peer_multicast_t::_remote_addr"]
        [::core::mem::offset_of!(_z_transport_peer_multicast_t, _remote_addr) - 160usize];
    ["Offset of field: _z_transport_peer_multicast_t::_sn_rx_sns"]
        [::core::mem::offset_of!(_z_transport_peer_multicast_t, _sn_rx_sns) - 192usize];
    ["Offset of field: _z_transport_peer_multicast_t::_sn_res"]
        [::core::mem::offset_of!(_z_transport_peer_multicast_t, _sn_res) - 328usize];
    ["Offset of field: _z_transport_peer_multicast_t::_lease"]
        [::core::mem::offset_of!(_z_transport_peer_multicast_t, _lease) - 336usize];
    ["Offset of field: _z_transport_peer_multicast_t::_next_lease"]
        [::core::mem::offset_of!(_z_transport_peer_multicast_t, _next_lease) - 344usize];
};
unsafe extern "C" {
    pub fn _z_transport_peer_multicast_size(src: *const _z_transport_peer_multicast_t) -> usize;
}
unsafe extern "C" {
    pub fn _z_transport_peer_multicast_clear(src: *mut _z_transport_peer_multicast_t);
}
unsafe extern "C" {
    pub fn _z_transport_peer_multicast_copy(
        dst: *mut _z_transport_peer_multicast_t,
        src: *const _z_transport_peer_multicast_t,
    );
}
unsafe extern "C" {
    pub fn _z_transport_peer_multicast_eq(
        left: *const _z_transport_peer_multicast_t,
        right: *const _z_transport_peer_multicast_t,
    ) -> bool;
}
pub type _z_transport_peer_multicast_eq_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_transport_peer_multicast_t,
        right: *const _z_transport_peer_multicast_t,
    ) -> bool,
>;
pub type _z_transport_peer_multicast_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_transport_peer_multicast_t,
        right: *const _z_transport_peer_multicast_t,
    ) -> ::core::ffi::c_int,
>;
pub type _z_transport_peer_multicast_slist_t = _z_slist_t;
pub const _z_unicast_peer_flow_state_e__Z_FLOW_STATE_INACTIVE: _z_unicast_peer_flow_state_e = 0;
pub const _z_unicast_peer_flow_state_e__Z_FLOW_STATE_PENDING_SIZE: _z_unicast_peer_flow_state_e = 1;
pub const _z_unicast_peer_flow_state_e__Z_FLOW_STATE_PENDING_DATA: _z_unicast_peer_flow_state_e = 2;
pub const _z_unicast_peer_flow_state_e__Z_FLOW_STATE_READY: _z_unicast_peer_flow_state_e = 3;
pub type _z_unicast_peer_flow_state_e = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_transport_peer_unicast_t {
    pub common: _z_transport_peer_common_t,
    pub _socket: _z_sys_net_socket_t,
    pub _sn_rx_reliable: _z_zint_t,
    pub _sn_rx_best_effort: _z_zint_t,
    pub _pending: bool,
    pub flow_state: u8,
    pub flow_curr_size: u16,
    pub flow_buff: _z_zbuf_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_transport_peer_unicast_t"]
        [::core::mem::size_of::<_z_transport_peer_unicast_t>() - 240usize];
    ["Alignment of _z_transport_peer_unicast_t"]
        [::core::mem::align_of::<_z_transport_peer_unicast_t>() - 8usize];
    ["Offset of field: _z_transport_peer_unicast_t::common"]
        [::core::mem::offset_of!(_z_transport_peer_unicast_t, common) - 0usize];
    ["Offset of field: _z_transport_peer_unicast_t::_socket"]
        [::core::mem::offset_of!(_z_transport_peer_unicast_t, _socket) - 160usize];
    ["Offset of field: _z_transport_peer_unicast_t::_sn_rx_reliable"]
        [::core::mem::offset_of!(_z_transport_peer_unicast_t, _sn_rx_reliable) - 168usize];
    ["Offset of field: _z_transport_peer_unicast_t::_sn_rx_best_effort"]
        [::core::mem::offset_of!(_z_transport_peer_unicast_t, _sn_rx_best_effort) - 176usize];
    ["Offset of field: _z_transport_peer_unicast_t::_pending"]
        [::core::mem::offset_of!(_z_transport_peer_unicast_t, _pending) - 184usize];
    ["Offset of field: _z_transport_peer_unicast_t::flow_state"]
        [::core::mem::offset_of!(_z_transport_peer_unicast_t, flow_state) - 185usize];
    ["Offset of field: _z_transport_peer_unicast_t::flow_curr_size"]
        [::core::mem::offset_of!(_z_transport_peer_unicast_t, flow_curr_size) - 186usize];
    ["Offset of field: _z_transport_peer_unicast_t::flow_buff"]
        [::core::mem::offset_of!(_z_transport_peer_unicast_t, flow_buff) - 192usize];
};
unsafe extern "C" {
    pub fn _z_transport_peer_unicast_clear(src: *mut _z_transport_peer_unicast_t);
}
unsafe extern "C" {
    pub fn _z_transport_peer_unicast_copy(
        dst: *mut _z_transport_peer_unicast_t,
        src: *const _z_transport_peer_unicast_t,
    );
}
unsafe extern "C" {
    pub fn _z_transport_peer_unicast_size(src: *const _z_transport_peer_unicast_t) -> usize;
}
unsafe extern "C" {
    pub fn _z_transport_peer_unicast_eq(
        left: *const _z_transport_peer_unicast_t,
        right: *const _z_transport_peer_unicast_t,
    ) -> bool;
}
pub type _z_transport_peer_unicast_eq_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_transport_peer_unicast_t,
        right: *const _z_transport_peer_unicast_t,
    ) -> bool,
>;
pub type _z_transport_peer_unicast_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_transport_peer_unicast_t,
        right: *const _z_transport_peer_unicast_t,
    ) -> ::core::ffi::c_int,
>;
pub type _z_transport_peer_unicast_slist_t = _z_slist_t;
pub type _z_session_rc_ref_t = _z_session_rc_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_transport_common_t {
    pub _session: *mut _z_session_rc_ref_t,
    pub _link: _z_link_t,
    pub _wbuf: _z_wbuf_t,
    pub _zbuf: _z_zbuf_t,
    pub _sn_res: _z_zint_t,
    pub _sn_tx_reliable: _z_zint_t,
    pub _sn_tx_best_effort: _z_zint_t,
    pub _lease: _z_zint_t,
    pub _transmitted: bool,
    pub _mutex_rx: _z_mutex_t,
    pub _mutex_tx: _z_mutex_t,
    pub _mutex_peer: _z_mutex_rec_t,
    pub _read_task: *mut _z_task_t,
    pub _lease_task: *mut _z_task_t,
    pub _accept_task_running: *mut bool,
    pub _read_task_running: bool,
    pub _lease_task_running: bool,
    pub _batch_state: u8,
    pub _batch_count: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_transport_common_t"][::core::mem::size_of::<_z_transport_common_t>() - 624usize];
    ["Alignment of _z_transport_common_t"]
        [::core::mem::align_of::<_z_transport_common_t>() - 8usize];
    ["Offset of field: _z_transport_common_t::_session"]
        [::core::mem::offset_of!(_z_transport_common_t, _session) - 0usize];
    ["Offset of field: _z_transport_common_t::_link"]
        [::core::mem::offset_of!(_z_transport_common_t, _link) - 8usize];
    ["Offset of field: _z_transport_common_t::_wbuf"]
        [::core::mem::offset_of!(_z_transport_common_t, _wbuf) - 248usize];
    ["Offset of field: _z_transport_common_t::_zbuf"]
        [::core::mem::offset_of!(_z_transport_common_t, _zbuf) - 304usize];
    ["Offset of field: _z_transport_common_t::_sn_res"]
        [::core::mem::offset_of!(_z_transport_common_t, _sn_res) - 352usize];
    ["Offset of field: _z_transport_common_t::_sn_tx_reliable"]
        [::core::mem::offset_of!(_z_transport_common_t, _sn_tx_reliable) - 360usize];
    ["Offset of field: _z_transport_common_t::_sn_tx_best_effort"]
        [::core::mem::offset_of!(_z_transport_common_t, _sn_tx_best_effort) - 368usize];
    ["Offset of field: _z_transport_common_t::_lease"]
        [::core::mem::offset_of!(_z_transport_common_t, _lease) - 376usize];
    ["Offset of field: _z_transport_common_t::_transmitted"]
        [::core::mem::offset_of!(_z_transport_common_t, _transmitted) - 384usize];
    ["Offset of field: _z_transport_common_t::_mutex_rx"]
        [::core::mem::offset_of!(_z_transport_common_t, _mutex_rx) - 392usize];
    ["Offset of field: _z_transport_common_t::_mutex_tx"]
        [::core::mem::offset_of!(_z_transport_common_t, _mutex_tx) - 456usize];
    ["Offset of field: _z_transport_common_t::_mutex_peer"]
        [::core::mem::offset_of!(_z_transport_common_t, _mutex_peer) - 520usize];
    ["Offset of field: _z_transport_common_t::_read_task"]
        [::core::mem::offset_of!(_z_transport_common_t, _read_task) - 584usize];
    ["Offset of field: _z_transport_common_t::_lease_task"]
        [::core::mem::offset_of!(_z_transport_common_t, _lease_task) - 592usize];
    ["Offset of field: _z_transport_common_t::_accept_task_running"]
        [::core::mem::offset_of!(_z_transport_common_t, _accept_task_running) - 600usize];
    ["Offset of field: _z_transport_common_t::_read_task_running"]
        [::core::mem::offset_of!(_z_transport_common_t, _read_task_running) - 608usize];
    ["Offset of field: _z_transport_common_t::_lease_task_running"]
        [::core::mem::offset_of!(_z_transport_common_t, _lease_task_running) - 609usize];
    ["Offset of field: _z_transport_common_t::_batch_state"]
        [::core::mem::offset_of!(_z_transport_common_t, _batch_state) - 610usize];
    ["Offset of field: _z_transport_common_t::_batch_count"]
        [::core::mem::offset_of!(_z_transport_common_t, _batch_count) - 616usize];
};
pub type _zp_f_send_tmsg = ::core::option::Option<
    unsafe extern "C" fn(
        self_: *mut _z_transport_common_t,
        t_msg: *const _z_transport_message_t,
    ) -> z_result_t,
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_transport_unicast_t {
    pub _common: _z_transport_common_t,
    pub _peers: *mut _z_transport_peer_unicast_slist_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_transport_unicast_t"][::core::mem::size_of::<_z_transport_unicast_t>() - 632usize];
    ["Alignment of _z_transport_unicast_t"]
        [::core::mem::align_of::<_z_transport_unicast_t>() - 8usize];
    ["Offset of field: _z_transport_unicast_t::_common"]
        [::core::mem::offset_of!(_z_transport_unicast_t, _common) - 0usize];
    ["Offset of field: _z_transport_unicast_t::_peers"]
        [::core::mem::offset_of!(_z_transport_unicast_t, _peers) - 624usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_transport_multicast_t {
    pub _common: _z_transport_common_t,
    pub _peers: *mut _z_transport_peer_multicast_slist_t,
    pub _send_f: _zp_f_send_tmsg,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_transport_multicast_t"]
        [::core::mem::size_of::<_z_transport_multicast_t>() - 640usize];
    ["Alignment of _z_transport_multicast_t"]
        [::core::mem::align_of::<_z_transport_multicast_t>() - 8usize];
    ["Offset of field: _z_transport_multicast_t::_common"]
        [::core::mem::offset_of!(_z_transport_multicast_t, _common) - 0usize];
    ["Offset of field: _z_transport_multicast_t::_peers"]
        [::core::mem::offset_of!(_z_transport_multicast_t, _peers) - 624usize];
    ["Offset of field: _z_transport_multicast_t::_send_f"]
        [::core::mem::offset_of!(_z_transport_multicast_t, _send_f) - 632usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_transport_t {
    pub _transport: _z_transport_t__bindgen_ty_1,
    pub _type: _z_transport_t__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _z_transport_t__bindgen_ty_1 {
    pub _unicast: _z_transport_unicast_t,
    pub _multicast: _z_transport_multicast_t,
    pub _raweth: _z_transport_multicast_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_transport_t__bindgen_ty_1"]
        [::core::mem::size_of::<_z_transport_t__bindgen_ty_1>() - 640usize];
    ["Alignment of _z_transport_t__bindgen_ty_1"]
        [::core::mem::align_of::<_z_transport_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: _z_transport_t__bindgen_ty_1::_unicast"]
        [::core::mem::offset_of!(_z_transport_t__bindgen_ty_1, _unicast) - 0usize];
    ["Offset of field: _z_transport_t__bindgen_ty_1::_multicast"]
        [::core::mem::offset_of!(_z_transport_t__bindgen_ty_1, _multicast) - 0usize];
    ["Offset of field: _z_transport_t__bindgen_ty_1::_raweth"]
        [::core::mem::offset_of!(_z_transport_t__bindgen_ty_1, _raweth) - 0usize];
};
pub const _z_transport_t__Z_TRANSPORT_UNICAST_TYPE: _z_transport_t__bindgen_ty_2 = 0;
pub const _z_transport_t__Z_TRANSPORT_MULTICAST_TYPE: _z_transport_t__bindgen_ty_2 = 1;
pub const _z_transport_t__Z_TRANSPORT_RAWETH_TYPE: _z_transport_t__bindgen_ty_2 = 2;
pub const _z_transport_t__Z_TRANSPORT_NONE: _z_transport_t__bindgen_ty_2 = 3;
pub type _z_transport_t__bindgen_ty_2 = ::core::ffi::c_uint;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_transport_t"][::core::mem::size_of::<_z_transport_t>() - 648usize];
    ["Alignment of _z_transport_t"][::core::mem::align_of::<_z_transport_t>() - 8usize];
    ["Offset of field: _z_transport_t::_transport"]
        [::core::mem::offset_of!(_z_transport_t, _transport) - 0usize];
    ["Offset of field: _z_transport_t::_type"]
        [::core::mem::offset_of!(_z_transport_t, _type) - 640usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_transport_unicast_establish_param_t {
    pub _remote_zid: _z_id_t,
    pub _batch_size: u16,
    pub _initial_sn_rx: _z_zint_t,
    pub _initial_sn_tx: _z_zint_t,
    pub _lease: _z_zint_t,
    pub _whatami: z_whatami_t,
    pub _key_id_res: u8,
    pub _req_id_res: u8,
    pub _seq_num_res: u8,
    pub _is_qos: bool,
    pub _patch: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_transport_unicast_establish_param_t"]
        [::core::mem::size_of::<_z_transport_unicast_establish_param_t>() - 64usize];
    ["Alignment of _z_transport_unicast_establish_param_t"]
        [::core::mem::align_of::<_z_transport_unicast_establish_param_t>() - 8usize];
    ["Offset of field: _z_transport_unicast_establish_param_t::_remote_zid"]
        [::core::mem::offset_of!(_z_transport_unicast_establish_param_t, _remote_zid) - 0usize];
    ["Offset of field: _z_transport_unicast_establish_param_t::_batch_size"]
        [::core::mem::offset_of!(_z_transport_unicast_establish_param_t, _batch_size) - 16usize];
    ["Offset of field: _z_transport_unicast_establish_param_t::_initial_sn_rx"]
        [::core::mem::offset_of!(_z_transport_unicast_establish_param_t, _initial_sn_rx) - 24usize];
    ["Offset of field: _z_transport_unicast_establish_param_t::_initial_sn_tx"]
        [::core::mem::offset_of!(_z_transport_unicast_establish_param_t, _initial_sn_tx) - 32usize];
    ["Offset of field: _z_transport_unicast_establish_param_t::_lease"]
        [::core::mem::offset_of!(_z_transport_unicast_establish_param_t, _lease) - 40usize];
    ["Offset of field: _z_transport_unicast_establish_param_t::_whatami"]
        [::core::mem::offset_of!(_z_transport_unicast_establish_param_t, _whatami) - 48usize];
    ["Offset of field: _z_transport_unicast_establish_param_t::_key_id_res"]
        [::core::mem::offset_of!(_z_transport_unicast_establish_param_t, _key_id_res) - 52usize];
    ["Offset of field: _z_transport_unicast_establish_param_t::_req_id_res"]
        [::core::mem::offset_of!(_z_transport_unicast_establish_param_t, _req_id_res) - 53usize];
    ["Offset of field: _z_transport_unicast_establish_param_t::_seq_num_res"]
        [::core::mem::offset_of!(_z_transport_unicast_establish_param_t, _seq_num_res) - 54usize];
    ["Offset of field: _z_transport_unicast_establish_param_t::_is_qos"]
        [::core::mem::offset_of!(_z_transport_unicast_establish_param_t, _is_qos) - 55usize];
    ["Offset of field: _z_transport_unicast_establish_param_t::_patch"]
        [::core::mem::offset_of!(_z_transport_unicast_establish_param_t, _patch) - 56usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _z_transport_multicast_establish_param_t {
    pub _initial_sn_tx: _z_conduit_sn_list_t,
    pub _seq_num_res: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_transport_multicast_establish_param_t"]
        [::core::mem::size_of::<_z_transport_multicast_establish_param_t>() - 144usize];
    ["Alignment of _z_transport_multicast_establish_param_t"]
        [::core::mem::align_of::<_z_transport_multicast_establish_param_t>() - 8usize];
    ["Offset of field: _z_transport_multicast_establish_param_t::_initial_sn_tx"][::core::mem::offset_of!(
        _z_transport_multicast_establish_param_t,
        _initial_sn_tx
    ) - 0usize];
    ["Offset of field: _z_transport_multicast_establish_param_t::_seq_num_res"][::core::mem::offset_of!(
        _z_transport_multicast_establish_param_t,
        _seq_num_res
    ) - 136usize];
};
unsafe extern "C" {
    pub fn _z_transport_peer_unicast_add(
        ztu: *mut _z_transport_unicast_t,
        param: *mut _z_transport_unicast_establish_param_t,
        socket: _z_sys_net_socket_t,
        output_peer: *mut *mut _z_transport_peer_unicast_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_transport_get_common(zt: *mut _z_transport_t) -> *mut _z_transport_common_t;
}
unsafe extern "C" {
    pub fn _z_transport_close(zt: *mut _z_transport_t, reason: u8) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_transport_clear(zt: *mut _z_transport_t);
}
unsafe extern "C" {
    pub fn _z_transport_free(zt: *mut *mut _z_transport_t);
}
unsafe extern "C" {
    pub fn _z_transport_start_batching(zt: *mut _z_transport_t) -> bool;
}
unsafe extern "C" {
    pub fn _z_transport_stop_batching(zt: *mut _z_transport_t);
}
pub const _z_peer_op_e__Z_PEER_OP_OPEN: _z_peer_op_e = 0;
pub const _z_peer_op_e__Z_PEER_OP_LISTEN: _z_peer_op_e = 1;
pub type _z_peer_op_e = ::core::ffi::c_uint;
unsafe extern "C" {
    pub fn _z_new_transport(
        zt: *mut _z_transport_t,
        bs: *const _z_id_t,
        locator: *const _z_string_t,
        mode: z_whatami_t,
        peer_op: ::core::ffi::c_int,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_new_peer(
        zt: *mut _z_transport_t,
        session_id: *const _z_id_t,
        locator: *const _z_string_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_free_transport(zt: *mut *mut _z_transport_t);
}
#[doc = " The callback signature of the cleanup functions."]
pub type _z_drop_handler_t =
    ::core::option::Option<unsafe extern "C" fn(arg: *mut ::core::ffi::c_void)>;
pub const _z_subscriber_kind_t__Z_SUBSCRIBER_KIND_SUBSCRIBER: _z_subscriber_kind_t = 0;
pub const _z_subscriber_kind_t__Z_SUBSCRIBER_KIND_LIVELINESS_SUBSCRIBER: _z_subscriber_kind_t = 1;
pub type _z_subscriber_kind_t = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_resource_t {
    pub _key: _z_keyexpr_t,
    pub _id: u16,
    pub _refcount: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_resource_t"][::core::mem::size_of::<_z_resource_t>() - 56usize];
    ["Alignment of _z_resource_t"][::core::mem::align_of::<_z_resource_t>() - 8usize];
    ["Offset of field: _z_resource_t::_key"][::core::mem::offset_of!(_z_resource_t, _key) - 0usize];
    ["Offset of field: _z_resource_t::_id"][::core::mem::offset_of!(_z_resource_t, _id) - 48usize];
    ["Offset of field: _z_resource_t::_refcount"]
        [::core::mem::offset_of!(_z_resource_t, _refcount) - 50usize];
};
unsafe extern "C" {
    pub fn _z_resource_eq(one: *const _z_resource_t, two: *const _z_resource_t) -> bool;
}
unsafe extern "C" {
    pub fn _z_resource_clear(res: *mut _z_resource_t);
}
unsafe extern "C" {
    pub fn _z_resource_copy(dst: *mut _z_resource_t, src: *const _z_resource_t);
}
unsafe extern "C" {
    pub fn _z_resource_free(res: *mut *mut _z_resource_t);
}
unsafe extern "C" {
    pub fn _z_resource_size(p: *mut _z_resource_t) -> usize;
}
pub type _z_resource_eq_f = ::core::option::Option<
    unsafe extern "C" fn(left: *const _z_resource_t, right: *const _z_resource_t) -> bool,
>;
pub type _z_resource_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_resource_t,
        right: *const _z_resource_t,
    ) -> ::core::ffi::c_int,
>;
pub type _z_keyexpr_eq_f = ::core::option::Option<
    unsafe extern "C" fn(left: *const _z_keyexpr_t, right: *const _z_keyexpr_t) -> bool,
>;
pub type _z_keyexpr_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_keyexpr_t,
        right: *const _z_keyexpr_t,
    ) -> ::core::ffi::c_int,
>;
#[doc = " A hashmap entry with generic keys.\n\n Members:\n   void *_key: the key of the entry\n   void *_val: the value of the entry"]
pub type _z_keyexpr_intmap_entry_t = _z_int_void_map_entry_t;
#[doc = " A hashmap with generic keys.\n\n Members:\n    size_t _capacity: the number of buckets available in the hashmap\n   _z_list_t **_vals: the linked list containing the values\n   z_element_hash_f _f_hash: the hash function used to hash keys\n   z_element_eq_f _f_equals: the function used to compare keys for equality"]
pub type _z_keyexpr_intmap_t = _z_int_void_map_t;
#[doc = " Iterator for a generic key-value hashmap."]
pub type _z_keyexpr_intmap_iterator_t = _z_int_void_map_iterator_t;
#[doc = " The callback signature of the functions handling data messages."]
pub type _z_closure_sample_callback_t = ::core::option::Option<
    unsafe extern "C" fn(sample: *mut _z_sample_t, arg: *mut ::core::ffi::c_void),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_subscription_t {
    pub _key: _z_keyexpr_t,
    pub _declared_key: _z_keyexpr_t,
    pub _key_id: u16,
    pub _id: u32,
    pub _callback: _z_closure_sample_callback_t,
    pub _dropper: _z_drop_handler_t,
    pub _arg: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_subscription_t"][::core::mem::size_of::<_z_subscription_t>() - 128usize];
    ["Alignment of _z_subscription_t"][::core::mem::align_of::<_z_subscription_t>() - 8usize];
    ["Offset of field: _z_subscription_t::_key"]
        [::core::mem::offset_of!(_z_subscription_t, _key) - 0usize];
    ["Offset of field: _z_subscription_t::_declared_key"]
        [::core::mem::offset_of!(_z_subscription_t, _declared_key) - 48usize];
    ["Offset of field: _z_subscription_t::_key_id"]
        [::core::mem::offset_of!(_z_subscription_t, _key_id) - 96usize];
    ["Offset of field: _z_subscription_t::_id"]
        [::core::mem::offset_of!(_z_subscription_t, _id) - 100usize];
    ["Offset of field: _z_subscription_t::_callback"]
        [::core::mem::offset_of!(_z_subscription_t, _callback) - 104usize];
    ["Offset of field: _z_subscription_t::_dropper"]
        [::core::mem::offset_of!(_z_subscription_t, _dropper) - 112usize];
    ["Offset of field: _z_subscription_t::_arg"]
        [::core::mem::offset_of!(_z_subscription_t, _arg) - 120usize];
};
unsafe extern "C" {
    pub fn _z_subscription_eq(one: *const _z_subscription_t, two: *const _z_subscription_t)
    -> bool;
}
unsafe extern "C" {
    pub fn _z_subscription_clear(sub: *mut _z_subscription_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_subscription_rc_t {
    pub _val: *mut _z_subscription_t,
    pub _cnt: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_subscription_rc_t"][::core::mem::size_of::<_z_subscription_rc_t>() - 16usize];
    ["Alignment of _z_subscription_rc_t"][::core::mem::align_of::<_z_subscription_rc_t>() - 8usize];
    ["Offset of field: _z_subscription_rc_t::_val"]
        [::core::mem::offset_of!(_z_subscription_rc_t, _val) - 0usize];
    ["Offset of field: _z_subscription_rc_t::_cnt"]
        [::core::mem::offset_of!(_z_subscription_rc_t, _cnt) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_subscription_weak_t {
    pub _val: *mut _z_subscription_t,
    pub _cnt: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_subscription_weak_t"][::core::mem::size_of::<_z_subscription_weak_t>() - 16usize];
    ["Alignment of _z_subscription_weak_t"]
        [::core::mem::align_of::<_z_subscription_weak_t>() - 8usize];
    ["Offset of field: _z_subscription_weak_t::_val"]
        [::core::mem::offset_of!(_z_subscription_weak_t, _val) - 0usize];
    ["Offset of field: _z_subscription_weak_t::_cnt"]
        [::core::mem::offset_of!(_z_subscription_weak_t, _cnt) - 8usize];
};
pub type _z_subscriber_eq_f = ::core::option::Option<
    unsafe extern "C" fn(left: *const _z_subscription_t, right: *const _z_subscription_t) -> bool,
>;
pub type _z_subscriber_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_subscription_t,
        right: *const _z_subscription_t,
    ) -> ::core::ffi::c_int,
>;
pub type _z_subscription_rc_eq_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_subscription_rc_t,
        right: *const _z_subscription_rc_t,
    ) -> bool,
>;
pub type _z_subscription_rc_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_subscription_rc_t,
        right: *const _z_subscription_rc_t,
    ) -> ::core::ffi::c_int,
>;
pub type _z_subscription_rc_slist_t = _z_slist_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_publication_t {
    pub _key: _z_keyexpr_t,
    pub _id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_publication_t"][::core::mem::size_of::<_z_publication_t>() - 56usize];
    ["Alignment of _z_publication_t"][::core::mem::align_of::<_z_publication_t>() - 8usize];
    ["Offset of field: _z_publication_t::_key"]
        [::core::mem::offset_of!(_z_publication_t, _key) - 0usize];
    ["Offset of field: _z_publication_t::_id"]
        [::core::mem::offset_of!(_z_publication_t, _id) - 48usize];
};
#[doc = " The callback signature of the functions handling query messages."]
pub type _z_closure_query_callback_t = ::core::option::Option<
    unsafe extern "C" fn(query: *mut _z_query_rc_t, arg: *mut ::core::ffi::c_void),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_session_queryable_t {
    pub _key: _z_keyexpr_t,
    pub _declared_key: _z_keyexpr_t,
    pub _id: u32,
    pub _callback: _z_closure_query_callback_t,
    pub _dropper: _z_drop_handler_t,
    pub _arg: *mut ::core::ffi::c_void,
    pub _complete: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_session_queryable_t"][::core::mem::size_of::<_z_session_queryable_t>() - 136usize];
    ["Alignment of _z_session_queryable_t"]
        [::core::mem::align_of::<_z_session_queryable_t>() - 8usize];
    ["Offset of field: _z_session_queryable_t::_key"]
        [::core::mem::offset_of!(_z_session_queryable_t, _key) - 0usize];
    ["Offset of field: _z_session_queryable_t::_declared_key"]
        [::core::mem::offset_of!(_z_session_queryable_t, _declared_key) - 48usize];
    ["Offset of field: _z_session_queryable_t::_id"]
        [::core::mem::offset_of!(_z_session_queryable_t, _id) - 96usize];
    ["Offset of field: _z_session_queryable_t::_callback"]
        [::core::mem::offset_of!(_z_session_queryable_t, _callback) - 104usize];
    ["Offset of field: _z_session_queryable_t::_dropper"]
        [::core::mem::offset_of!(_z_session_queryable_t, _dropper) - 112usize];
    ["Offset of field: _z_session_queryable_t::_arg"]
        [::core::mem::offset_of!(_z_session_queryable_t, _arg) - 120usize];
    ["Offset of field: _z_session_queryable_t::_complete"]
        [::core::mem::offset_of!(_z_session_queryable_t, _complete) - 128usize];
};
unsafe extern "C" {
    pub fn _z_session_queryable_eq(
        one: *const _z_session_queryable_t,
        two: *const _z_session_queryable_t,
    ) -> bool;
}
unsafe extern "C" {
    pub fn _z_session_queryable_clear(res: *mut _z_session_queryable_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_session_queryable_rc_t {
    pub _val: *mut _z_session_queryable_t,
    pub _cnt: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_session_queryable_rc_t"]
        [::core::mem::size_of::<_z_session_queryable_rc_t>() - 16usize];
    ["Alignment of _z_session_queryable_rc_t"]
        [::core::mem::align_of::<_z_session_queryable_rc_t>() - 8usize];
    ["Offset of field: _z_session_queryable_rc_t::_val"]
        [::core::mem::offset_of!(_z_session_queryable_rc_t, _val) - 0usize];
    ["Offset of field: _z_session_queryable_rc_t::_cnt"]
        [::core::mem::offset_of!(_z_session_queryable_rc_t, _cnt) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_session_queryable_weak_t {
    pub _val: *mut _z_session_queryable_t,
    pub _cnt: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_session_queryable_weak_t"]
        [::core::mem::size_of::<_z_session_queryable_weak_t>() - 16usize];
    ["Alignment of _z_session_queryable_weak_t"]
        [::core::mem::align_of::<_z_session_queryable_weak_t>() - 8usize];
    ["Offset of field: _z_session_queryable_weak_t::_val"]
        [::core::mem::offset_of!(_z_session_queryable_weak_t, _val) - 0usize];
    ["Offset of field: _z_session_queryable_weak_t::_cnt"]
        [::core::mem::offset_of!(_z_session_queryable_weak_t, _cnt) - 8usize];
};
pub type _z_session_queryable_eq_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_session_queryable_t,
        right: *const _z_session_queryable_t,
    ) -> bool,
>;
pub type _z_session_queryable_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_session_queryable_t,
        right: *const _z_session_queryable_t,
    ) -> ::core::ffi::c_int,
>;
pub type _z_session_queryable_rc_eq_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_session_queryable_rc_t,
        right: *const _z_session_queryable_rc_t,
    ) -> bool,
>;
pub type _z_session_queryable_rc_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_session_queryable_rc_t,
        right: *const _z_session_queryable_rc_t,
    ) -> ::core::ffi::c_int,
>;
pub type _z_session_queryable_rc_slist_t = _z_slist_t;
pub type _z_pending_reply_slist_t = _z_slist_t;
#[doc = " The callback signature of the functions handling query replies."]
pub type _z_closure_reply_callback_t = ::core::option::Option<
    unsafe extern "C" fn(reply: *mut _z_reply_t, arg: *mut ::core::ffi::c_void),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_pending_query_t {
    pub _key: _z_keyexpr_t,
    pub _id: _z_zint_t,
    pub _callback: _z_closure_reply_callback_t,
    pub _dropper: _z_drop_handler_t,
    pub _start_time: z_clock_t,
    pub _timeout: u64,
    pub _arg: *mut ::core::ffi::c_void,
    pub _pending_replies: *mut _z_pending_reply_slist_t,
    pub _target: z_query_target_t,
    pub _consolidation: z_consolidation_mode_t,
    pub _anykey: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_pending_query_t"][::core::mem::size_of::<_z_pending_query_t>() - 128usize];
    ["Alignment of _z_pending_query_t"][::core::mem::align_of::<_z_pending_query_t>() - 8usize];
    ["Offset of field: _z_pending_query_t::_key"]
        [::core::mem::offset_of!(_z_pending_query_t, _key) - 0usize];
    ["Offset of field: _z_pending_query_t::_id"]
        [::core::mem::offset_of!(_z_pending_query_t, _id) - 48usize];
    ["Offset of field: _z_pending_query_t::_callback"]
        [::core::mem::offset_of!(_z_pending_query_t, _callback) - 56usize];
    ["Offset of field: _z_pending_query_t::_dropper"]
        [::core::mem::offset_of!(_z_pending_query_t, _dropper) - 64usize];
    ["Offset of field: _z_pending_query_t::_start_time"]
        [::core::mem::offset_of!(_z_pending_query_t, _start_time) - 72usize];
    ["Offset of field: _z_pending_query_t::_timeout"]
        [::core::mem::offset_of!(_z_pending_query_t, _timeout) - 88usize];
    ["Offset of field: _z_pending_query_t::_arg"]
        [::core::mem::offset_of!(_z_pending_query_t, _arg) - 96usize];
    ["Offset of field: _z_pending_query_t::_pending_replies"]
        [::core::mem::offset_of!(_z_pending_query_t, _pending_replies) - 104usize];
    ["Offset of field: _z_pending_query_t::_target"]
        [::core::mem::offset_of!(_z_pending_query_t, _target) - 112usize];
    ["Offset of field: _z_pending_query_t::_consolidation"]
        [::core::mem::offset_of!(_z_pending_query_t, _consolidation) - 116usize];
    ["Offset of field: _z_pending_query_t::_anykey"]
        [::core::mem::offset_of!(_z_pending_query_t, _anykey) - 120usize];
};
unsafe extern "C" {
    pub fn _z_pending_query_eq(
        one: *const _z_pending_query_t,
        two: *const _z_pending_query_t,
    ) -> bool;
}
unsafe extern "C" {
    pub fn _z_pending_query_clear(res: *mut _z_pending_query_t);
}
pub type _z_pending_query_eq_f = ::core::option::Option<
    unsafe extern "C" fn(left: *const _z_pending_query_t, right: *const _z_pending_query_t) -> bool,
>;
pub type _z_pending_query_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_pending_query_t,
        right: *const _z_pending_query_t,
    ) -> ::core::ffi::c_int,
>;
pub type _z_pending_query_slist_t = _z_slist_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __z_hello_handler_wrapper_t {
    _unused: [u8; 0],
}
#[doc = " The callback signature of the functions handling hello messages."]
pub type _z_closure_hello_callback_t = ::core::option::Option<
    unsafe extern "C" fn(hello: *mut _z_hello_t, arg: *mut __z_hello_handler_wrapper_t),
>;
unsafe extern "C" {
    pub fn _z_session_generate_zid(bs: *mut _z_id_t, size: u8) -> z_result_t;
}
pub const _z_interest_msg_type_t__Z_INTEREST_MSG_TYPE_FINAL: _z_interest_msg_type_t = 0;
pub const _z_interest_msg_type_t__Z_INTEREST_MSG_TYPE_DECL_SUBSCRIBER: _z_interest_msg_type_t = 1;
pub const _z_interest_msg_type_t__Z_INTEREST_MSG_TYPE_DECL_QUERYABLE: _z_interest_msg_type_t = 2;
pub const _z_interest_msg_type_t__Z_INTEREST_MSG_TYPE_DECL_TOKEN: _z_interest_msg_type_t = 3;
pub const _z_interest_msg_type_t__Z_INTEREST_MSG_TYPE_UNDECL_SUBSCRIBER: _z_interest_msg_type_t = 4;
pub const _z_interest_msg_type_t__Z_INTEREST_MSG_TYPE_UNDECL_QUERYABLE: _z_interest_msg_type_t = 5;
pub const _z_interest_msg_type_t__Z_INTEREST_MSG_TYPE_UNDECL_TOKEN: _z_interest_msg_type_t = 6;
pub const _z_interest_msg_type_t__Z_INTEREST_MSG_TYPE_CONNECTION_DROPPED: _z_interest_msg_type_t =
    7;
pub type _z_interest_msg_type_t = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_interest_msg_t {
    pub type_: u8,
    pub id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_interest_msg_t"][::core::mem::size_of::<_z_interest_msg_t>() - 8usize];
    ["Alignment of _z_interest_msg_t"][::core::mem::align_of::<_z_interest_msg_t>() - 4usize];
    ["Offset of field: _z_interest_msg_t::type_"]
        [::core::mem::offset_of!(_z_interest_msg_t, type_) - 0usize];
    ["Offset of field: _z_interest_msg_t::id"]
        [::core::mem::offset_of!(_z_interest_msg_t, id) - 4usize];
};
#[doc = " The callback signature of the functions handling interest messages."]
pub type _z_interest_handler_t = ::core::option::Option<
    unsafe extern "C" fn(
        msg: *const _z_interest_msg_t,
        peer: *mut _z_transport_peer_common_t,
        arg: *mut ::core::ffi::c_void,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_session_interest_t {
    pub _key: _z_keyexpr_t,
    pub _id: u32,
    pub _callback: _z_interest_handler_t,
    pub _arg: *mut ::core::ffi::c_void,
    pub _flags: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_session_interest_t"][::core::mem::size_of::<_z_session_interest_t>() - 80usize];
    ["Alignment of _z_session_interest_t"]
        [::core::mem::align_of::<_z_session_interest_t>() - 8usize];
    ["Offset of field: _z_session_interest_t::_key"]
        [::core::mem::offset_of!(_z_session_interest_t, _key) - 0usize];
    ["Offset of field: _z_session_interest_t::_id"]
        [::core::mem::offset_of!(_z_session_interest_t, _id) - 48usize];
    ["Offset of field: _z_session_interest_t::_callback"]
        [::core::mem::offset_of!(_z_session_interest_t, _callback) - 56usize];
    ["Offset of field: _z_session_interest_t::_arg"]
        [::core::mem::offset_of!(_z_session_interest_t, _arg) - 64usize];
    ["Offset of field: _z_session_interest_t::_flags"]
        [::core::mem::offset_of!(_z_session_interest_t, _flags) - 72usize];
};
unsafe extern "C" {
    pub fn _z_session_interest_eq(
        one: *const _z_session_interest_t,
        two: *const _z_session_interest_t,
    ) -> bool;
}
unsafe extern "C" {
    pub fn _z_session_interest_clear(res: *mut _z_session_interest_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_session_interest_rc_t {
    pub _val: *mut _z_session_interest_t,
    pub _cnt: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_session_interest_rc_t"]
        [::core::mem::size_of::<_z_session_interest_rc_t>() - 16usize];
    ["Alignment of _z_session_interest_rc_t"]
        [::core::mem::align_of::<_z_session_interest_rc_t>() - 8usize];
    ["Offset of field: _z_session_interest_rc_t::_val"]
        [::core::mem::offset_of!(_z_session_interest_rc_t, _val) - 0usize];
    ["Offset of field: _z_session_interest_rc_t::_cnt"]
        [::core::mem::offset_of!(_z_session_interest_rc_t, _cnt) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_session_interest_weak_t {
    pub _val: *mut _z_session_interest_t,
    pub _cnt: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_session_interest_weak_t"]
        [::core::mem::size_of::<_z_session_interest_weak_t>() - 16usize];
    ["Alignment of _z_session_interest_weak_t"]
        [::core::mem::align_of::<_z_session_interest_weak_t>() - 8usize];
    ["Offset of field: _z_session_interest_weak_t::_val"]
        [::core::mem::offset_of!(_z_session_interest_weak_t, _val) - 0usize];
    ["Offset of field: _z_session_interest_weak_t::_cnt"]
        [::core::mem::offset_of!(_z_session_interest_weak_t, _cnt) - 8usize];
};
pub type _z_session_interest_eq_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_session_interest_t,
        right: *const _z_session_interest_t,
    ) -> bool,
>;
pub type _z_session_interest_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_session_interest_t,
        right: *const _z_session_interest_t,
    ) -> ::core::ffi::c_int,
>;
pub type _z_session_interest_rc_eq_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_session_interest_rc_t,
        right: *const _z_session_interest_rc_t,
    ) -> bool,
>;
pub type _z_session_interest_rc_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_session_interest_rc_t,
        right: *const _z_session_interest_rc_t,
    ) -> ::core::ffi::c_int,
>;
pub type _z_session_interest_rc_slist_t = _z_slist_t;
pub const _z_declare_type_t__Z_DECLARE_TYPE_SUBSCRIBER: _z_declare_type_t = 0;
pub const _z_declare_type_t__Z_DECLARE_TYPE_QUERYABLE: _z_declare_type_t = 1;
pub const _z_declare_type_t__Z_DECLARE_TYPE_TOKEN: _z_declare_type_t = 2;
pub type _z_declare_type_t = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_declare_data_t {
    pub _key: _z_keyexpr_t,
    pub _id: u32,
    pub _type: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_declare_data_t"][::core::mem::size_of::<_z_declare_data_t>() - 56usize];
    ["Alignment of _z_declare_data_t"][::core::mem::align_of::<_z_declare_data_t>() - 8usize];
    ["Offset of field: _z_declare_data_t::_key"]
        [::core::mem::offset_of!(_z_declare_data_t, _key) - 0usize];
    ["Offset of field: _z_declare_data_t::_id"]
        [::core::mem::offset_of!(_z_declare_data_t, _id) - 48usize];
    ["Offset of field: _z_declare_data_t::_type"]
        [::core::mem::offset_of!(_z_declare_data_t, _type) - 52usize];
};
unsafe extern "C" {
    pub fn _z_declare_data_clear(data: *mut _z_declare_data_t);
}
unsafe extern "C" {
    pub fn _z_declare_data_size(data: *mut _z_declare_data_t) -> usize;
}
unsafe extern "C" {
    pub fn _z_declare_data_copy(dst: *mut _z_declare_data_t, src: *const _z_declare_data_t);
}
pub type _z_declare_data_eq_f = ::core::option::Option<
    unsafe extern "C" fn(left: *const _z_declare_data_t, right: *const _z_declare_data_t) -> bool,
>;
pub type _z_declare_data_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_declare_data_t,
        right: *const _z_declare_data_t,
    ) -> ::core::ffi::c_int,
>;
pub type _z_declare_data_slist_t = _z_slist_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_liveliness_pending_query_t {
    pub _key: _z_keyexpr_t,
    pub _callback: _z_closure_reply_callback_t,
    pub _dropper: _z_drop_handler_t,
    pub _arg: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_liveliness_pending_query_t"]
        [::core::mem::size_of::<_z_liveliness_pending_query_t>() - 72usize];
    ["Alignment of _z_liveliness_pending_query_t"]
        [::core::mem::align_of::<_z_liveliness_pending_query_t>() - 8usize];
    ["Offset of field: _z_liveliness_pending_query_t::_key"]
        [::core::mem::offset_of!(_z_liveliness_pending_query_t, _key) - 0usize];
    ["Offset of field: _z_liveliness_pending_query_t::_callback"]
        [::core::mem::offset_of!(_z_liveliness_pending_query_t, _callback) - 48usize];
    ["Offset of field: _z_liveliness_pending_query_t::_dropper"]
        [::core::mem::offset_of!(_z_liveliness_pending_query_t, _dropper) - 56usize];
    ["Offset of field: _z_liveliness_pending_query_t::_arg"]
        [::core::mem::offset_of!(_z_liveliness_pending_query_t, _arg) - 64usize];
};
unsafe extern "C" {
    pub fn _z_liveliness_pending_query_clear(res: *mut _z_liveliness_pending_query_t);
}
unsafe extern "C" {
    pub fn _z_liveliness_pending_query_copy(
        dst: *mut _z_liveliness_pending_query_t,
        src: *const _z_liveliness_pending_query_t,
    );
}
unsafe extern "C" {
    pub fn _z_liveliness_pending_query_clone(
        src: *const _z_liveliness_pending_query_t,
    ) -> *mut _z_liveliness_pending_query_t;
}
pub type _z_liveliness_pending_query_eq_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_liveliness_pending_query_t,
        right: *const _z_liveliness_pending_query_t,
    ) -> bool,
>;
pub type _z_liveliness_pending_query_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(
        left: *const _z_liveliness_pending_query_t,
        right: *const _z_liveliness_pending_query_t,
    ) -> ::core::ffi::c_int,
>;
#[doc = " A hashmap entry with generic keys.\n\n Members:\n   void *_key: the key of the entry\n   void *_val: the value of the entry"]
pub type _z_liveliness_pending_query_intmap_entry_t = _z_int_void_map_entry_t;
#[doc = " A hashmap with generic keys.\n\n Members:\n    size_t _capacity: the number of buckets available in the hashmap\n   _z_list_t **_vals: the linked list containing the values\n   z_element_hash_f _f_hash: the hash function used to hash keys\n   z_element_eq_f _f_equals: the function used to compare keys for equality"]
pub type _z_liveliness_pending_query_intmap_t = _z_int_void_map_t;
#[doc = " Iterator for a generic key-value hashmap."]
pub type _z_liveliness_pending_query_intmap_iterator_t = _z_int_void_map_iterator_t;
unsafe extern "C" {
    pub fn _z_liveliness_get_query_id(zn: *mut _z_session_t) -> u32;
}
unsafe extern "C" {
    pub fn _z_liveliness_register_token(
        zn: *mut _z_session_t,
        id: u32,
        keyexpr: *const _z_keyexpr_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_liveliness_unregister_token(zn: *mut _z_session_t, id: u32);
}
unsafe extern "C" {
    pub fn _z_liveliness_subscription_declare(
        zn: *mut _z_session_t,
        id: u32,
        keyexpr: *const _z_keyexpr_t,
        timestamp: *const _z_timestamp_t,
        peer: *mut _z_transport_peer_common_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_liveliness_subscription_undeclare(
        zn: *mut _z_session_t,
        id: u32,
        timestamp: *const _z_timestamp_t,
        peer: *mut _z_transport_peer_common_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_liveliness_subscription_undeclare_all(zn: *mut _z_session_t) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_liveliness_subscription_trigger_history(
        zn: *mut _z_session_t,
        keyexpr: *const _z_keyexpr_t,
        peer: *mut _z_transport_peer_common_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_liveliness_register_pending_query(
        zn: *mut _z_session_t,
        id: u32,
        pen_qry: *mut _z_liveliness_pending_query_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_liveliness_unregister_pending_query(zn: *mut _z_session_t, id: u32);
}
unsafe extern "C" {
    pub fn _z_liveliness_init(zn: *mut _z_session_t);
}
unsafe extern "C" {
    pub fn _z_liveliness_clear(zn: *mut _z_session_t);
}
unsafe extern "C" {
    pub fn _z_liveliness_process_token_declare(
        zn: *mut _z_session_t,
        decl: *const _z_n_msg_declare_t,
        peer: *mut _z_transport_peer_common_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_liveliness_process_token_undeclare(
        zn: *mut _z_session_t,
        decl: *const _z_n_msg_declare_t,
        peer: *mut _z_transport_peer_common_t,
    ) -> z_result_t;
}
unsafe extern "C" {
    pub fn _z_liveliness_process_declare_final(
        zn: *mut _z_session_t,
        decl: *const _z_n_msg_declare_t,
    ) -> z_result_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _z_matching_status_t {
    pub matching: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _z_matching_status_t"][::core::mem::size_of::<_z_matching_status_t>() - 1usize];
